{
    "chat_id": "20210413",
    "messages": [
        {
            "party": "Victim",
            "content": "Good evening Sir/Madam. I'm [redacted], and I was asked by the [redacted]'s \nexecutives to assist them in completing a business arrangement with you.\n I'm neither a technological expert nor a lawyer. I have a financial \nbackground and currently work in the public sector here in the [redacted]. As \nyou probably understand, we would like to complete this unfortunate \nevent as swift and clean as possible. Kindly let me know how should I \ncall you and when should I expect your reply. Respectfully, [redacted].",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello, our communication is conducted only through this chat.\nWe are ready to listen to your proposal.",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Thank you Sir/Madam. I have no idea what kind of proposal I should make\n to you. We are an [redacted] charity run by [redacted]. We get money, \npublic funds, and I have no experience in this occurrence. We are not a \nbusiness. I understand that we need to pay a certain amount in order to \nget our systems back to full operation. Am I right? Respectfully, [redacted]",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "Yes, you are right, for our part we want to see the best deal that you can afford.",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir/Madam, do you mean what is the amount we can pay in order to restore our systems? Respectfully, [redacted]",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir/Madam, do you mean what is the amount we can pay in order to restore our systems? Respectfully, [redacted]",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "Yes of course.",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Sorry Sir/Madam, for sending twice. I'm a bit overwhelmed by stress and this experience.",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "No problem.",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir/Madam, I honestly don't know. I see that you request 4 Million USD \nwhich is almost 3M GBP. We will never be able to pay this amount. Should\n I now tell you how much we are willing to pay? Is this what you mean? \nMy apologies to be very cautious. I don't want any mistake to happen \nhere. It is the future of 50,000 pupils. Young kids. Respectfully, \n[redacted]",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "We understand this, but still we do not expect a low offer from you.",
            "timestamp": "14 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir/Madam, I understand. Please allow me to consult. Respectfully, [redacted]",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "14 days ago"
        },
        {
            "party": "REvil",
            "content": "We are not in the mood for a long conversation, so we look forward to hearing from you shortly.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir/Madam, I'm here and after intense conversations and internal \nconsultations as you might imagine. Please refrain from hostile \nlanguage. I will appreciate it. I was instruct to further elaborate with\n you couple of points, obviously after I did my own research about you \nand your highly professional capability and status.",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "Well, we are ready to listen to your questions.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks Sir/Madam. I appreciate that. (1) What type of information will \nyou provide upon completing the deal? (2) What type of information are \nyou currently possessing? (3) How can I guarantee that data will not be \nfurther monetized upon completion of our deal? Thanks much in advance. \n[redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "We value our reputation and we have proved ourselves over a long period\n of time. We have a 100% guarantee after the transaction is completed \nthat you will receive the decryptor and your data and information about \nyou will be immediately deleted.",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "Also, after payment, we will conduct a full audit of your network in order to avoid subsequent hacks.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks Sir. I will convey this and revert shortly. Respectfully, Emilie",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Thank you Sir. I believe that the last offer will not be required, \nhowever, I will be extremely thankful if you could at least tell me what\n information you have in your possession. I believe that this \ninformation is of utmost importance to determine the amount the charity \nwill pay. Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I could not red your last message. Was it deleted deliberately? Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "My apologies for typo. I meant \"read\".",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "We have information about all your financial transactions, the details of your partners, card numbers and much more.\nWe never conduct a full check of the information we have.But for example\n : [redacted] [redacted] [redacted] [redacted] [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "Sorry for the failed submission last time.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Thank you Sir. I understand that. Mistakes happen at all times. We are \nall humans. I will forward your reply. What does this mean: \n[redacted] [redacted] [redacted] [redacted] [redacted] Is this a\n file? or a directory? I want to ask you in order not to look \nunprofessional in the eyes of my colleagues. Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "These are lines from your documents.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, does it suppose to mean anything of importance? Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "If you think the card details of their owners are important, then yes, they are.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, you mean Credit Card details of the Charity owners? Is this what \nyou have in your possession? I'm asking again in order not to cause any \nconfusion, and the guarantee an decision making process which is based \non accurate data. Thanks, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "No, I mean the credit card details of your clients or employees.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Ohh, I understand. Thank you. I'll revert, hopefully tonight. Respectfully, [redacted].",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "I hope you understand that this is just an example of what we have.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Yes Sir. I do understand. And I'm confident enough in your wisdom to \npresent me with an attractive information, in order to present your most\n valuable assets. Credit card information of employees is probably the \nmost attractive asset. Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "REvil",
            "content": "I would like to remind you that we are not ready to drag out \nnegotiations. In case of waiting for long answers, there can be no \nquestion of any discounts from our side.",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I'm aware of that. I will present a significant amount in my early\n AM tomorrow. The relevant decision makers are currently consulting. \nThanks for your understanding. Respectfully, [redacted]",
            "timestamp": "13 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning Sir.. Your TOR website is offline for quite some time now.\n Is it ok to continue using this platform? Respectfully. [redacted]",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "I got the mandate to make you an offer. Please let me know if it's ok to make it now?",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "Yes we are listening to you.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks Sir. We can pay 750,000 USD in XMR, provided that you will share\n with me the exact scope, volume, and significance of data that is in \nyour possession. I would like to stress that this amount is far beyond \nwhat we understand is usually charged by your teams (based on recent \nnews reports. I've turned to be an expert on your business in the last 3\n days, Fortunately or unfortunately.) I do stress the data, rather than \nthe decryption key, since I learned about your very positive reputation \nin providing decryption keys. Looking forward hearing your thoughts. \nRespectfully, [redacted].",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "You are asking for a huge discount.\nBut my boss is ready to take a step forward.\nOur offer $ 3kk.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Sorry, you mean 3 Million USD?",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "Yes that's right.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Oh God. No, this is so far of what we can pay. Please hold and I'll report to my colleagues and revert. Respectfully, [redacted].",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, we will not be able to pay that amount. Please advise. Respectfully, [redacted]",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "This amount was formed after a detailed audit of your company and it fully corresponds to your level and size of your company.",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "You can make another suggestion, and we will consider it, but we are not expect small money from you.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, thank you for this frank answer. Your \"client\", my colleagues, are\n not a company, and it seems that your reply is of a general nature. We \nare a charity fund, [redacted] non-profit, and our resources are all \npublic resources. I will be able to come back to my colleagues, once you\n provided me with any information which will make them re-evaluate their\n decision. One of your colleagues, in a recent interview, said that you \ndon't like to bargain. So please, I'll appreciate if you will find me as\n a genuine partner with whom you share information in order to craft a \ndeal which works for both of us. Respectfully, [redacted].",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "Publication of your information will create damage much more valuable \nthan our requirements. Think about it, you have the minimal price and we\n usually don't negotiate about it.",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "If you pay soon, we are ready to make an additional discount.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Thank you Sir. I appreciate your advise, however this can't be \ncosidered a valuable advise. I will need to understand the percularities\n of what you wrote above: (1) Publication of which information? (2) What\n do you mean soon? (even if we agree tomorrow, it will take 3-4 days of \nofficial approval and execution) and (3) what is the additional \ndiscount? Thank you for understanding, and I really grateful for your \nwillingness to assist. Respectfully, [redacted]",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "We are talking about publishing information that we have downloaded. If\n you pay before Saturday, we will give an extra 20% discount.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, your proposal set the price tag for publishing unknown information\n on 2.4M USD. I see no scenario that the charity board and trustees will\n approve this by tomorrow, in order to be executed by Saturday. Sir, if \nyou want to take advantage of my expreienced services in deal making you\n will have to allow me (1) details of information you have, as this and \nthe decryption keys are the corner stone of any decision which will be \ntaken, and (2) set a reasonable price for a non-profit charity around \n800-900K, to be paid at some point next week. I'll be here, throughout \nthis process, to make sure that we are progressing as planned. \nRespectfully, [redacted].",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "I provide you additional proofs below and recommend you hurry up with decision, because payment procedure can takes time.\nIf you don't pay, your files will be published to the blog and shared to\n media, other data will be sold. Anyway it will influence to your \nreputation, think about your customers and fines and other troubles \nwaiting for you. We offer you solution to avoid everything of this.",
            "timestamp": "12 days ago"
        },
        {
            "party": "REvil",
            "content": "This is an example of files that we downloaded. All files you will receive after payment.",
            "timestamp": "12 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning Sir. My sincere apologies for not replying last night. I \nwas cought up at another event. I will forward this information to the \nrelevant people and contact you back later during the day. I thank you \nfor all the assistnce you provide in order to terminate this unpleasent \naffair. Respectfully, [redacted].",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello, ok.",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, are you one person or few people rotating in shifts. Asking \nbecause you are always available, and always accesible. And are you the \none who can finalize a deal or you need any approval from higher level? \nRespectfully, [redacted]",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "I have a boss",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks. Ok. I working on our case in the next couple of hours. Will revert as soon as I have information. Respectfully, [redacted].",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "Okay we wait.",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, one of the trustees of the charity have asked me in private what \nare the chances of bringing the price down to 900K USD? He shared with \nme her internal conversations and her belief, like you and me, that a \ndeal is better than any publication. However, she said, reviewing the \ninformation you sent will not convice the relevant people to pay that \namount of many. It's about \"risk management\" she said. Decryption keys \nand that information should cost around 1M. What would be your answer to\n her? Please keep in mind that she is sharing her thoughts with me in \nprivate and I'm not that sure that she represents any majority. Please \nconsult with the boss and let me know? Respectfully, [redacted]",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "I'll be back to this computer in 2-3 hours, Sir. Thanks. [redacted]",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "We need to discuss this with the superiors.Wait for answer.",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "My boss is ready to give you a discount.\n$ 1.5 million is our latest offer.",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "Let me remind you that this offer is valid only in case of quick payment.",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I'm thrilled. Thanks a lot. I'll convey this in my meeting with \nboard and trustees in the morning. First time in last days that I'm \ngoing to bed with a smile. I'll contact you for further communication \nand updates in the morning. Best regards, [redacted]",
            "timestamp": "11 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "11 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning Sir. Board and trustees of the charity will convene in 1.5\n hours. I'm in direct contact, as I shared with you yesterday with one \nof the trustees, and she will update me immedietly after the meeting, \neven before the official statement. Respectfully, [redacted]",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "Okay.",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, may I ask you a direct question? It's important that you will be \ncompletely honest with me, and if you don't know the answer, I would \nappreciate if you could check with the boss. Are you still interfering \nwith our systems? Do you do any actions related to our employees? \nAwaiting your answer, [redacted]",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "We provide this information only after payment along with the audit of your network.",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "I remind you once again that all our agreements are valid only in case \nof quick payment. It seems to us that you are deliberately delaying the \ndialogue.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I wish I could have brought you into the trustees meeting. In the \nmiddle of meeting when they discuss paying your suggested price, came \nthis notice of your continued efforts to sabotage the charity network. \nWith all due respect, Sir, do you think it was necessary? Do you think \nit was helpful? I'm doing a tremendous effort to show everyone your \nnice, welcoming and human face, and you keep on your evil moves? How \nshould I show my face now? I guess that you haven't understood that you \nand me are working together to bring this deal? You have to assist me, \nnot work against me..!",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "We never commit malicious acts while communicating.\nThese words are confirmed by our reputation.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Are you completely confident about that Sir? I'ts not only your reputation here, it's mine as well. Thanks, [redacted]",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "We are sure.\nYou have nothing to worry about.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Ok. I trust on that. I'll further communicate tonight. I need to go \nback, with this information, to do some damage control, and it starts to\n be late into the weekend. I'll come back later this evening. \nRespectfully, [redacted].",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "Today we are waiting for the results of your negotiations from you.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Good evening Sir, as I predicted on Wednesday or Thursday (sorry, last \nweek was like crazy hell for me, very little sleep, very stressful, and \nalmost no time for my young kids), the charity's leaderhip could not \nmake a decision before the weekend. As predicted they asked me to ask \nyou to delay reply until after the weekend (Monday afternoon), as well \nas to seek, if possible, additional discount to 1M. I told them, \nbluntly, that I'm not sure about additional discount, becasue from what I\n understood from you, what your boss already approved was beyond the \nususal discount you give. I left board meeting really frustrated, first \nof all on a personal level, due to the fact that I thought I will have a\n quite weekend, handing over our correspondance to the person who will \ntake care of execution and buying the XMR, but also because I have no \nface to disspoint you. I know that you expect an answer, and I feel bad \nthat I can't deliver any positive results at the moment. I need to ask \nyou for an extension. I'll be here to reply to all your notes, to \nprovide you with any background information you need, and even if you \nwant to exchange weekend receipies. Board and trustees will reconvene \nafter the weekend, on Monday morning, and on the positive side, it gives\n me time to talk and to be successful in persuading them to complete the\n deal in order to recover all systems by Tuesady/Wednesdy. Thanks in \nadvance for you understandging. I really appreciate it. Respectfully, \n[redacted].",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "We have provided the maximum possible discount in your case.\nOn Monday night, we will no longer be able to talk about any concessions, as the ransom amount will double.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Thank a lot, Sir, for understanding. I will be in close touch also \nduring the weekend. Best and have good night. Tell your boss that you \ndeserve some time off and a good drink. Emilie",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Please also update the countdown of the clock at the bottom of our corresponding page? Thanks, Emilie.",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "Your time runs exactly to the one indicated by me above.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Ok, maybe I'm a bit confused. I trust you. Good night Sir.",
            "timestamp": "10 days ago"
        },
        {
            "party": "REvil",
            "content": "Okay.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Good evening Sir. I hope that you took some time off to be with your \nfamily. I'm here to answer any question. Respectfully, [redacted].",
            "timestamp": "9 days ago"
        },
        {
            "party": "Victim",
            "content": "Good evening Sir. The IT team have sent me a file, which they kindly \nask you to decrypt in order to see, as mentioned in your early note and \nhere on this website, the the decryption tool actually work. I will try \nto attach it now. Respectfully, [redacted].",
            "timestamp": "8 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello",
            "timestamp": "8 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning Sir, I could not sleep the whole night. Thanks for the file, I'll be in touch later this morning. Thanks, [redacted].",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "This was written couple of hours ago, but apparently there was a fault in your system and it was sent just now.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "Okay , we wait.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks, I'm here. I would like to ask you, first, informally (before I \nspeak to \"my\" trustee in the board). Is there any chance that you will \nbe able to extend the deadline for Wednesday evening? The reason I'm \nasking is because there was some government move to our senior \nleadership, and I'm afraid that they were asked not to pay. I can tell \nyou that the majority of board members want to complete the deal, as \nit's the only way they can restore the system, but it seems that the \nweekend brought with it also pressure in the opposite direction. Would \nlove to hear your boss opinion on that. Respectfully, [redacted]",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "We are not ready to stretch the time like that.\nAll my boss is willing to offer is Tuesday night, if payment is received by then.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "If your senior management is unwilling to pay, we will start publishing information, be sure to remind them of this.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "This is why I'm checking with you Sir. The board of the charity is \nmeeting in 1:30 hours, (2 PM GMT), and I want to bring them the most \nupdated information from you. At the moment, you were kindly offering \nthe charity to pay 1.5M and deadline is tonight. If I could get an extra\n \"stretch\" (as you wrote) to pay 1M, and deadline is Wednesday morning, \nthat would have been very helpful to get the board and trustees \napproval, despite any other external voices. Please bring it to the boss\n approval. Anything of this will make my mission more likely to succeed.\n Thanks in advance, [redacted].",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "We have already given you time to discuss these issues at your meeting today.\nMy boss isn't ready to give you time until Wednesday.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "I understand. May I speak with the boss? Can he come to the chat? Can I give him an email address?",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "All conversations are conducted through this chat, and all messages are sent to it.\nWe gave you a good discount and enough time to resolve internal issues. It's all.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "Please, you can't leave me with this answer. I see that boss can't do \nWednesday, and I understand his and your perspective. Will it be \npossible to leave price as it is, and give time decision time until \nTuesday night? If it was not this external inputs, I'm confident that I \ncould have sort it out by myself. Thanks, [redacted]",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "Please reply Sir, I'll be back in an hour. Need to go and prepare for board meeting. A women, you know.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "Our agreement is valid until Monday night, I have nothing more to add for you.\nThe discount is provided for quick payment.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "I see, Sir. I can't ask more, and I don't beg. If you can extend the \ndeadline until Tuesday - it will be helpful with the board in 5 minuets.\n If you are not interested - I will not be happy with it, as it will be \nmore difficult for me to persuade board and trustees to complete the \ndeal, but - I will understand. As said, I'm a woman who respects herself\n and her partners. I will not beg. Respectfully, [redacted]",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "An article in our blog will be prepared tonight (not published at the moment).\nPerhaps this way your bosses will want to pay faster.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "My boss is willing to allow until Wednesday, but in this case, discounts are out of the question.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "So Sir, what are my option, currently??",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "My options, I mean. \n1.5M until tonight or 2.4M until Wednesday? \nOr can you do 1.5M until Tuesday 2PM GMT? \nBest, Emilie",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "This is the last thing we can offer on Tuesday, 14:00 GMT.\nIf you do not pay, the data will start to be published.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks Sir. I appreciate it. A lot. Please convey my thanks to your boss. Respectfully, Emilie.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "http://dnpscnbaix6nkwvystl3yxglz7nteicqrou3t75tpcc5532cztc46qyd.onion/posts/[redacted]?s=[redacted]\n (Use TOR browser)\nThis is just a small part of what is being prepared for publication.\nAt the moment, this blog is only visible to you.\nWe hope your boss is ready to resolve this issue soon.",
            "timestamp": "7 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning, Sir. I see. Thanks for sharing. I'll revert soon. Emilie",
            "timestamp": "7 days ago"
        },
        {
            "party": "REvil",
            "content": "You don't have much time.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "I know Sir. I can't ask for more time. There is no decision yet, on \nbehalf of the board and the trustees. The situation has turned to be too\n complex, and I hope that a positive decision will be taken in the next \ncouple of hours. I predicted that, and this is the reason for asking for\n the Wednesday deadline, however I fully understand your view point. \nI'll come back once I have news. Respectfully, [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Today we have not received a clear answer from you.\nYour data will be ready for publication shortly.\nWe still suggest that you solve this problem.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I have no news. I wish I could solve this matter. I wish. I \npredicted the dynamics in the charity, this is why I asked for \nWednesday, and 1M. There is nothing I can do now, apart from praying \nthat your boss will give me more time. But if it puts you, personally, \nat risk, please don't ask. Yours, [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "My boss is asking you a specific question.\nAre you ready to pay on Wednesday or continue unnecessary conversations with us?",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I want to be honest. I don't know now. I just don't know what the \ndecision will be. They are discussing, elaborating, trying to find \nunderstanding and sources of fund to pay. It is completely your decision\n Sir. I can't ask for more. You were very generous, and I hope one day \nwill come I could reciprocate. [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "We think it's worth starting publishing to make your bosses more accommodating.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "As said, it's your call. You are more experienced than me in this \nbusiness, and I'm familiar with the decision making process here. \nPublication will most likely discourage charity's leadership to pay \nanything. But again, you have the finger on the control button. Hope \nyou'll take the right one. [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "What time is your meeting tomorrow?",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Starts at 14:00 London time. Sir.",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "How long will they take?",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Hope to have an answer by 17:00 GMT. If not a definitive answer, at least a positive indication, Sir.",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "What do you mean by \"positive indication\" ? Another meeting on Thursday ? Or preparing for payment ?",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "I guess the latter Sir. This will not be dragged by Thursday, I believe.",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Wait for answer.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Im here Sir. Waiting for you.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "I'll check your decision in couple of hours Sir. I must leave this computer and go home to my family. Respectfully, [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "We spoke with the boss for a long time about the current situation.\nIf we receive the same response tomorrow as today, the attacks on your \nnetwork will continue and the data will begin to be published.\nThat's all we have to offer at the moment.\nAlso, in addition to the time, we extend the amount agreed by us.We need\n to know if you have informed your management about the current \npublication?",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Time added. Price update.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, I thank you and your boss, however I'm a bit confused by your \nmessage. First, my colleagues are informed on all our communication. I \nunderstand about the publication, and the sample publication you sent me\n earlier is what stirred the debate among the trustees, as I predicted. \nSecond, what do you mean the attack will continue? Is this kind of a \nterminology you use to persuade people? Thanks for understanding, [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Continued attacks only in case of refusal to pay, of course.\nIf we find a common language, we can help you close all vulnerabilities and prevent future hacks.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "So, am I right to understand that you still have assets and access to \nthe network? If yes, I need to inform the leadership as this change \ntheir discussions tomorrow. What type of access you have? Thanks, \n[redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Such information is provided only after payment.",
            "timestamp": "6 days ago"
        },
        {
            "party": "Victim",
            "content": "Yes. I thought that this will be your answer. I'm too exhausted to comment. Thanks and have a good night. [redacted].",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait.",
            "timestamp": "6 days ago"
        },
        {
            "party": "REvil",
            "content": "Any news ?",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "Sir, good evening. No news. Significant and powerful external forces \nare involved at the moment. No decision has been made. I don't know to \nsay when. I'm asking for nothing. Just humbly informing you of the \ncurrent state of affairs. Sorry for that. [redacted].",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "It seems like it's just your choice.",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "Not mine, Sir. I'm doing my best. [redacted].",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "If during the day my boss does not receive a response from you, attacks\n on your network will continue, I hope your management will be \npleasantly surprised.",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "I will pass this message Sir.",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "Why did you make your suggestions before, but now you cannot understand what is happening ?",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "After this timer expires, the data will be published in the blog and transmitted to the media.\n\ndnpscnbaix6nkwvystl3yxglz7nteicqrou3t75tpcc5532cztc46qyd.onion/posts/[redacted]?s=[redacted] (Use TOR browser)",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "Good morning Sir. I understand very well what is happening. And I \nprobably failed to explain what was going on at the board meetings. \n[redacted] charity is not a private company, many stakeholders \ninvolved. Unfortunately. [redacted].",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "Express your leadership's decision.",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "How much are you willing to pay in the near future?",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "You have 30 minutes left until posting.\nDon't you give a damn about a personal data leak?",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "This post will only be the first part.\nThe next one will contain information about your students and investors.",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "Soon we will start publishing all personal data of your students.",
            "timestamp": "3 days ago"
        },
        {
            "party": "REvil",
            "content": "[redacted] won't help you",
            "timestamp": "3 days ago"
        },
        {
            "party": "REvil",
            "content": "The first part of the data is being prepared for publication soon, if \nyou have a proposal for payment, my boss is ready to listen.",
            "timestamp": "2 days ago"
        },
        {
            "party": "REvil",
            "content": "We wait your answer.",
            "timestamp": "17 hours ago"
        }
    ]
}