{
    "chat_id": "20210709",
    "messages": [
        {
            "party": "REvil",
            "content": "Hello,  We are REvil Group. We want to inform that your company local network have been hacked and encrypted. We have all your local network data. The Price to unlock is $3.000,000. Now we're keeping it a secret, but if you do not reply us within 3 days it will be posted on our news-site. Think about the financial damage to your stock price from this publication. In case of successful negotiations we guarantee that you will get decryptors for all your machines, non recoverable removal of downloaded data and security report on how you were hacked to fix your vulnerabilities. We hope that you can correctly assess the risks for your company. You can find more information about REvil group in Google.    Posting on our blog and further publications in the media will lead to significant losses for your company: court and government fines, data recovery, loss of reputation, abandonment of clients, drop in limits.  But don't panic! We are in business, not in war. We can unblock your data and keep everything secret. All we need is a ransom. In this case, you also get: a security report, a complete tree of compromised data files, permanently deleting downloaded data, support with tips on unlocking and protecting.",
            "timestamp": "10 days ago"
        },
        {
            "party": "Victim",
            "content": "Hello there. You encrypted our network and we are stuck. But the amount on your website must be a mistake. We are a tiny company in a very rural state that just finally came out of lockdown. There is no way we can ever pay this much. Is there something different we can work out?",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello we know all about your company. My boss can offer 20% discount",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks for getting back. And thank you for lowering the price. But this is still really really too much money. If you know all about our company, you know things are not so good the past five years. What documents did you take from us?",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "we prepare proof of hack",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "offer your price and my boss will review it",
            "timestamp": "5 days ago"
        },
        {
            "party": "Victim",
            "content": "we are waiting for the proof pack, also we have taken your discount to our management team.",
            "timestamp": "5 days ago"
        },
        {
            "party": "REvil",
            "content": "small example",
            "timestamp": "4 days ago"
        },
        {
            "party": "REvil",
            "content": "Looking forward to your reply today or we start publication in our blog",
            "timestamp": "2 days ago"
        },
        {
            "party": "Victim",
            "content": "We apologize for the delay. We are working on getting you an offer, but right now we are struggling to get the cash together to make you happy. We do not want to insult you with a low number, but as I mentioned... things have not been so good the past few years. Since you know all about us, you know that this is true. We will get you something to offer you first thing tomorrow. Is that okay?",
            "timestamp": "2 days ago"
        },
        {
            "party": "REvil",
            "content": "we wait",
            "timestamp": "2 days ago"
        },
        {
            "party": "Victim",
            "content": "Okay I spoke to my boss. We really don’t want you to publish anything, but we are afraid we will never be able to make a deal with you because the price is so high. We just don’t have that kind of money. Here is what we do have. First, my boss has cancelled the reopening of the office for the rest of the year, which was earmarked at $30,000. It turns out we have an insurance policy that could help out as well. (I was not aware of this). The insurance is $100,000. Finally, my boss will personally contribute his own family money of $20,000. That is $150,000! I know it is not as much as you wanted, but please look at what we are doing here. My boss also wanted me to ask you to look at the financial records that you stole from us. He wanted me to tell you that if you look at those documents, they show that our company has a “negative returned earnings value”. I don’t know what that means, but my boss said that as a businessman, you would understand",
            "timestamp": "22 hours ago"
        },
        {
            "party": "REvil",
            "content": "not interested",
            "timestamp": "22 hours ago"
        },
        {
            "party": "REvil",
            "content": "we start published your data",
            "timestamp": "22 hours ago"
        },
        {
            "party": "Victim",
            "content": "Please man. That’s not fair! My boss is going to kill me. You have to give us more time… please! I am sure we can come up with more money, but you're demanding so much from us. Is there any way we can prove to you our financial situation. I can email you our tax records or something from our accountant? You have to believe me man… Please give me more time…",
            "timestamp": "18 hours ago"
        },
        {
            "party": "REvil",
            "content": "Your suggestions don't even come close to meeting our needs",
            "timestamp": "18 hours ago"
        },
        {
            "party": "REvil",
            "content": "300k and okay if you pay quickly",
            "timestamp": "15 hours ago"
        },
        {
            "party": "Victim",
            "content": "Oh wow, that is awesome. We are very appreciative of the huge discount. We want to get this behind us as fast as possible We can probably get $300,000, but we don’t have it today. We could probably get it by Monday. If you want something today, I know we have exactly $264,766 because I am looking at an email right now. Can we can get you $264,766. If you really need $300k, it’ll take some more time. Can we just pay you the $264,766 in the next 24 hours and be done with this?",
            "timestamp": "10 hours ago"
        },
        {
            "party": "REvil",
            "content": "300k last price your accept it or we start published data",
            "timestamp": "10 hours ago"
        },
        {
            "party": "Victim",
            "content": "We will find the money somewhere. We agree to 300,000 USD. Will you provide the decryption tool, return our data and then delete it after? How do we pay you?",
            "timestamp": "7 hours ago"
        },
        {
            "party": "Victim",
            "content": "Please also decrypt attached sample file",
            "timestamp": "7 hours ago"
        },
        {
            "party": "REvil",
            "content": "btc or xmr",
            "timestamp": "3 hours ago"
        },
        {
            "party": "Victim",
            "content": "btc",
            "timestamp": "3 hours ago"
        },
        {
            "party": "Victim",
            "content": "test",
            "timestamp": "3 hours ago"
        },
        {
            "party": "Victim",
            "content": "the earlier file you sent was empty so sending new test files.",
            "timestamp": "3 hours ago"
        },
        {
            "party": "REvil",
            "content": "file",
            "timestamp": "3 hours ago"
        },
        {
            "party": "REvil",
            "content": "file",
            "timestamp": "3 hours ago"
        },
        {
            "party": "REvil",
            "content": "btc enabled , price update",
            "timestamp": "3 hours ago"
        }
    ]
}