{
    "chat_id": "20210320",
    "messages": [
        {
            "party": "Victim",
            "content": "Hi. So how can you help?",
            "timestamp": "25 days ago"
        },
        {
            "party": "REvil",
            "content": "The system works as follows: you transfer the amount in crypt currency Monero (XMR) to the wallet specified on your page.\nAfter payment you receive:\n- Universal decryptor for your all network\n- The complete deletion of all your files with our warranty not to use the data for any purpose.\n- Deleting blog\n- 100% confidentiality of this incident and all terms of the transaction on our part.",
            "timestamp": "25 days ago"
        },
        {
            "party": "Victim",
            "content": "How do we know that what you have is worth the money?",
            "timestamp": "24 days ago"
        },
        {
            "party": "REvil",
            "content": "Wait for answer.",
            "timestamp": "23 days ago"
        },
        {
            "party": "Victim",
            "content": "Waiting",
            "timestamp": "23 days ago"
        },
        {
            "party": "REvil",
            "content": "I provide you additional proofs below and recommend you hurry up with decision, because payment procedure can takes time.\nIf you don't pay, your files will be published to the blog and shared to\n media, other data will be sold. Anyway it will influence to your \nreputation, think about your customers and fines and other troubles \nwaiting for you. We offer you solution to avoid everything of this.",
            "timestamp": "22 days ago"
        },
        {
            "party": "Victim",
            "content": "Password?",
            "timestamp": "22 days ago"
        },
        {
            "party": "REvil",
            "content": "Password: 123123",
            "timestamp": "21 days ago"
        },
        {
            "party": "Victim",
            "content": "Thanks",
            "timestamp": "21 days ago"
        },
        {
            "party": "REvil",
            "content": "How much time will it take you to make the payment?",
            "timestamp": "21 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello, we are tired of waiting for you, if there is no response from \nyou in a day, we will publish screenshots of some of your files for the \nmedia - this will be the first warning for you.\nBut even if it does not affect you, we will publish all your data. We recommend that you make a decision.",
            "timestamp": "18 days ago"
        },
        {
            "party": "Victim",
            "content": "can we get more time ?",
            "timestamp": "15 days ago"
        },
        {
            "party": "REvil",
            "content": "Hello\nWe see no attempts on your part to engage in a serious conversation.\nIf you do not pay, your files will be published on the blog and \ntransferred to the media, the rest of the data will be sold. In any \ncase, it will affect your reputation, think about your clients, fines \nand other troubles awaiting you. You will not have more time if we do \nnot see the prepayment.",
            "timestamp": "15 days ago"
        }
    ]
}