{
    "chat_id": "",
    "messages": [
        {
            "party": "REvil",
            "content": "Hello,\n\nWe are REvil Group.\nWe want to inform that your company local network have been hacked and encrypted. We have all your local network data. The Price to unlock is $5.500,000. Now we're keeping it a secret, but if you do not reply us within 3 days it will be posted on our news-site. Think about the financial damage to your stock price from this publication. In case of successful negotiations we guarantee that you will get decryptors for all your machines, non recoverable removal of downloaded data and security report on how you were hacked to fix your vulnerabilities. We hope that you can correctly assess the risks for your company.\nYou can find more information about REvil group in Google.\n\n\n\nPosting on our blog and further publications in the media will lead to significant losses for your company: court and government fines, data recovery, loss of reputation, abandonment of clients, drop in limits.\n\nBut don't panic! We are in business, not in war.\nWe can unblock your data and keep everything secret. All we need is a ransom.\nIn this case, you also get: a security report, a complete tree of compromised data files, permanently deleting downloaded data, support with tips on unlocking and protecting.",
            "timestamp": "1 day ago"
        },
        {
            "party": "Victim",
            "content": "I'm a little confused. Your message says 3 days but your website says 19 hours. Your decryption tool doesn't do us any good since we are in the process of recovering, but you may interest us with the data that you say you have taken. Can you show us what you took?",
            "timestamp": "18 hours ago"
        },
        {
            "party": "REvil",
            "content": "You were too slow when trying to assess the damage and did not write to us",
            "timestamp": "18 hours ago"
        },
        {
            "party": "REvil",
            "content": "Of course wait for answer",
            "timestamp": "18 hours ago"
        },
        {
            "party": "Victim",
            "content": "Will we have this today? Please increase the timer, there's no way we can make any payment in only 14 hrs",
            "timestamp": "13 hours ago"
        },
        {
            "party": "REvil",
            "content": "3 day added",
            "timestamp": "8 hours ago"
        },
        {
            "party": "REvil",
            "content": "Yes we prepaid proof of hack",
            "timestamp": "8 hours ago"
        },
        {
            "party": "Victim",
            "content": "Okay please send the proof of what you took from our network",
            "timestamp": "8 hours ago"
        },
        {
            "party": "REvil",
            "content": "ok",
            "timestamp": "7 hours ago"
        },
        {
            "party": "REvil",
            "content": "https://privatlab.com/s/v/[redacted]\n\npass for download : [redacted]\npass for archive : [redacted]\n\nhttps://privatlab.com/s/d/[redacted]#delete",
            "timestamp": "1 hour ago"
        }
    ]
}