{
  "chat_id": "20250720",
  "messages": [
    {
      "party": "Victim",
      "content": "Hello. I’m to negotiate on Case # GL57552. We finally made it here, please remove our name from your website so we can work this out.",
      "timestamp": "2025-07-20"
    },
    {
      "party": "PEAR",
      "content": "You had enough time to reach out in time and then your name would not appear on our website. But you’ve ignored the timeline. So, now your name will be taken down after we make a deal and you pay ONLY. There’s no other way at this point. No need saying anything about that anymore. Just hold on and we’ll provide you with the complete list of your files we have and with deal conditions soonest.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "We have breached your systems and duplicated over 3.8 TB of your sensitive data to our servers.\n\nThe link below contains the archive with the complete list of your files we have taken:\nArchive link - https://limewire.com/d/[Redacted]\nArchive password - 6rj75o1n_js^  \nChoose for up to 3 files from the list and send us the file names. We’ll send you those files back as proof of your data availability on our side.\n\nConditions:\n(a) You have to pay us 4 BTC to save your data from leaked and avoid any additional damages possible;\n(b) We will provide you with our bitcoin address immediately after you confirm a deal and ready to proceed with the payment;\n(c) We set Wednesday, July 30, as the deadline for the payment to be completed;\n(d) You’d better stay online and be in touch with us daily within all this time. Otherwise, we will find your silence as declining a deal and will follow to harassing you, your staff, partners, and all other parties affected whose contacts we have on your files;\n(e) We will start leaking your files since Thursday, July 31, if we don’t get paid by that time.\n\nWhat you get if we are paid:\n(a) All your data we have will be permanently removed from our servers;\n(b) You will be provided with deletion proof;\n(c) We will take your name down from our website and will not ever spread a word related to this incident;\n(d) We will not ever leak, use, sell, or share with third parties even a file of your data;\n(e) We will not attack your company again.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "Here’s our website mirror link in case you can’t access it with the first one http://pear...3rmtqd.onion\nThe deadline we’ve set is more than adequate. But you don’t have too much time to waste it. You’ve lost Monday.\nWhen will you request for 3 files?",
      "timestamp": "2025-07-22"
    },
    {
      "party": "Victim",
      "content": "This has all been very overwhelming, and we’d really appreciate some time to review everything you’ve sent us. We’re committed to finding a way forward. Please reconsider taking our name down from your website — this is the first real opportunity we’ve had to reach out. It’s been quite hectic on our end, and as you can imagine, we’ve been juggling a lot.\nWe’ll choose the files asap.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> Please reconsider taking our name down from your website\nUnfortunately, this is non-negotiable at this point. It will be taken down immediately after the deal is closed. Don’t worry, we will not post anything else anywhere or any of your files within the timeline set.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> We’d really appreciate some time to review everything you’ve sent us\nYou are aware of the deadline. You’d better request for any 3 files soonest for we could move forward. You may continue reviewing the listing even after files requested. But have no doubt that each file on the list is yours. More over, we are investigating your files on our side, as well. And we’ll provide you with some proof of your data we have is sensitive. Some of it is extremely sensitive.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "It’s unfortunate that our name is still on your website, especially as we’ve been cooperating. We hope you’ll reconsider. In the meantime, here are the files we’re requesting back:\n[Redacted].jpeg\n[Redacted].jpeg\n[Redacted].pdf",
      "timestamp": "2025-07-23"
    },
    {
      "party": "PEAR",
      "content": "Here are your files:\nArchive Link - https://limewire.com/d/[Redacted]\nArchive Password - 7o6iFf(sT)8pFGW32q4Y\n\n> You had enough time to reach out in time and then your name would not appear on our website. But you’ve ignored the timeline. So, now your name will be taken down after we make a deal and you pay ONLY. There’s no other way at this point. No need saying anything about that anymore.\n> Unfortunately, this is non-negotiable at this point. It will be taken down immediately after the deal is closed.\nDon’t make us repeat same things again and again. Your name up on our website is your fault only.\nYou have to be active and strictly constructive. The soonest you pay - the soonest your name will be taken down.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "It’s not that we’re ignoring the timeline, it’s just that your expectations may be a little off. We’re doing everything we can to move as quickly as possible, but it’s hectic on our end. We’ll get leadership to review the files and confirm they’re ours, then follow up. In the meantime, how flexible are you on the price?",
      "timestamp": "2025-07-24"
    },
    {
      "party": "PEAR",
      "content": "It depends on whether you are able to make payment by the end of this week or not. If so, we agree to negotiate on the price.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "You mentioned a deadline of next week, is that still the case? There’s no way we can pay nearly a half a million dollars, especially not by the end of this week. What kind of discounted price could you offer us?",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> is that still the case?\nSure\nWell, a 10% discount is not a problem. We can deal at 3.6 BTC",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "Hello?\nNear Wednesday the deadline comes. What you stall for?",
      "timestamp": "2025-07-25"
    },
    {
      "party": "Victim",
      "content": "Bitcoin is a bit too hectic for us, can you just give us a price in dollars? Is 10% the best you can do on the discount?\nYou also mentioned you’d be sending over some sensitive files you have from us, we’re still waiting on those.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "3.6 btc makes it $420,000 at the moment.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> Is 10% the best you can do on the discount?\n> you’d be sending over some sensitive files you have from us\nYou could request for absolutely any files from the file tree. You’ve chosen and requested. And we’ve sent them back to you. You know well what information your files contain. Your files we have I mean. So, we do not understand clearly what exactly you want at the moment. An additional discount to be provided for reaching an agreement shortly without waiting until the deadline comes? Or us demonstrating you real sensitivity of your files and no more discounts further? Or you doubt about all the files from the list are in our possession?",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "??",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "You are not active enough guys. That may bring you to irreparable consequences. But ok. Let’s start with the light one\nArchive link - https://ufile.io/[Redacted]\nArchive password - lr#s$XC/plcuCWQ#24d\nSay ‘Hello’ to Joseph W. Bryant\nSo, would you like us to search something that kind among your multiple cases’ exhibits and evidences? Or will we move to reaching and closing a deal?",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "Why haven’t you replied yesterday? Only 3 business days ahead you have. What you say?",
      "timestamp": "2025-07-26"
    },
    {
      "party": "Victim",
      "content": "We can’t seem to download that file. As for the price, we still do not have the means to pay that amount. As for our responses, we can’t sit here 24/7 and with it being the weekend, we can’t collect anything. We need to re group on Monday and see where the larger group stands.\nOne thing the partners have requested is the ability to request a few more files from the list. We are hoping to have those file names for you by Monday.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> https://ufile.io/[Redacted]\nThe link is valid and works properly. I’ve checked it right now. What’s your problem downloading the file? Looks like bluff.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "Try this link:\nhttps://limewire.com/d[Redacted]\nSame archive password\n> Archive password - lr#s$XC/plcuCWQ#24d",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> We still do not have the means to pay that amount\nDon’t you?",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "The archive below contains samples of different types of data on your files we have. Take a look:\nArchive Link - https://limewire.com/d[Redacted]\nArchive Password - E%`YfR6d#79*}Ghi\nEach folder contains 2/3 files.\nSSNs, DLs, Children’s Birth Certificates (PIL folder)\nPHI records. Infants’ as well (PHI folder)\nPositive drug testing results (DT folder)\nBiometry data - finger prints (FP folder)\nChildren’s DNA testing results (DNA folder)",
      "timestamp": "2025-07-27"
    },
    {
      "party": "Victim",
      "content": "> We still do not have the means to pay that amount",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> partners have requested is the ability to request a few more\nDo you really think they need to request for additional files? We don’t think so. That makes no sense doing that when 3 days left before deadline comes. We can provide you with a couple more files, for sure. But what firm’s owners need indeed is to start collecting money to make the payment if they want to avoid their data and reputation leaked.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "They would still like to request more random files from the list. As for the deadline, you’re asking us for nearly half a million dollars. We are a fairly small firm compared to most and raising that amount is impossible. We understand the seriousness information you have but we’re still hoping you will lower the price to something more reasonable and affordable.\nAs I mentioned before, we will be meeting Monday and should have some more file names for you then.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "We find this simple stalling and nothing else. You already have proof provided and know well that all the files from the list are available on our side. But ok, we said we can and we’ll do. We allow you to request for 3 more files but no more further and today only.",
      "timestamp": "2025-07-28"
    },
    {
      "party": "PEAR",
      "content": "1. You are saying about the price according to firm’s financials only. But you are not saying a word about penalties and fines possible if we leak their data. Hundred thousand or even millions USD under HIPAA only. But if class action claim will take place firm will suffer in millions for sure. We understand the price set doesn’t make anyone happy on your side. We have a lot of firm’s financial files through years and understand best what they can afford after seeing some samples.\nArchive Link - https://limewire.com/d/[Redacted]\nArchive Password - DscTVGg6{hp7Bujj\nBut the incident took place is firm’s fault only. They’ve neglected taking proper measures on systems security and grossly violated sensitive data storage conditions.\n2. We see you will not be able to complete the payment by Wednesday. You’ve lost too much time saying anything but nothing constructive for reaching a deal. So, looking ahead we move the timeline. Near Wednesday is still the deadline for you confirmed a deal. Near Friday - for payment completed. Samples of your sensitive data will be posted on our website near Thursday if we don’t shake hands by that time.\n3. Over a week since we are negotiating here with you. And still nothing constructive from you we see. You (you personally, we mean) saying ‘we’ as if you are part of Garrison Law Firm. You are not and we understand that clearly. You are either the insurer’s employee, or an external negotiator hired by their insurers. That’s why you are not active enough and always reply once a day only. You don’t really care about Garrison’s firm. What you’re doing is try make a solid discount and nothing else. The point you may bring them to irreparable consequences doesn’t touch you. So, we will send the complete log of this negotiation to all Garrison Law Firm partners if you bring their data to leaked.\nLet’s just do business and figure out this. We will make a solid discount step and set the price at $370,000. Do you confirm?",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "Let’s take this one step at a time. We’re actively working to find the funds to increase our offer to you, and that takes effort and time — so please bear with us.\nWe’re very grateful for the discount, and we’ll be discussing it with the rest of the team. In the meantime, here are the additional 3 files we’re requesting:\n[Redacted].docx\n[Redacted].docx\n[Redacted].pdf",
      "timestamp": "2025-07-29"
    },
    {
      "party": "PEAR",
      "content": "> to increase our offer to you,\nWhat’s wrong with you??? You haven’t offered even anything. What are you talking about?\n> We allow you to request for 3 more files but no more further and today only.\nYou’ve ignored this. So, you’ve lost your chance. Looks like you find it a game. Well, even if it is - we set rules. We will not provide you with any more files you request.\nBut we will now send you some more files we’ve picked while investigating your data. Just hold on for a while.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "You have to see this:\nArchive link - https://limewire.com/d/[Redacted]\nArchive Password - D%6^*fewq@53sae4S\nYou will be able to verify each file from the list after we publish your data on our website. That will happen if you continue same way.\nTomorrow evening is latest you have to confirm a deal. No more time extensions will be provided to you.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> after we publish your data\nGarrison firm’s data we meant.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "Do you confirm a deal?",
      "timestamp": "2025-07-30"
    },
    {
      "party": "PEAR",
      "content": "And one more point. Here’s another pack of GLW’s files in the archive below:\nArchive Link - https://limewire.com/d/[Redacted]\nArchive Password - dY%6$#WGJ0(jW5d1vQ\nThese are some password encrypted files we’ve found while investigating. We’ve decrypted them. Here are passwords:\nFile Name - Spencer Check History (2).xlsx\nFile Password - protected\nFile Name - MEP.xlsx\nFile Password - 614175\nFile Name - Report Copy Transmittal Letter for George Drake SF07300544.pdf\nFile Password - drake7877\nFile Name - 10-16 10-29.pdf\nFile Password - 54471978\n> GLW’s\nGLF’s*",
      "timestamp": "2025-07-31"
    },
    {
      "party": "PEAR",
      "content": "So, none information will be saved after leaked. You weird man. GLF’s ship is going down.\n1 pm today we’ll send screenshots of this conversation to Chris Garrison, Joshua Martin, Gabriel Berry, Stephen Thompson, and Cody Cogswell. They will be delivered, have no doubt. We want them to know your actions bringing their data to leaked.\n5 pm today samples of GLF’s sensitive data will be posted on our website. This will be leakage beginning.\nWe always do what we say. So, we’ll do what we have to do. You have timelines.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "Do you have the files we requested? If you want us to confirm a deal with you we need to see the files.\nThere’s no reason to rush us this much, we’re cooperating. Just please give us some more time while we work things with you and try to figure out the financial side of things.",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> [Redacted].docx\nFiles with this name are in folders with cases of 3 your clients:\n[Redacted]\n[Redacted]\n[Redacted]\nWhich folder would you like us to take it from?",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "> [Redacted]\nWe’ll take from here",
      "timestamp": ""
    },
    {
      "party": "PEAR",
      "content": "> we need to see the files.\nHere they are:\nhttp://peargxn3oki34c4savcbcfqofjjwjnnyrlrbszfv6ujlx36mhrh57did.onion/Companies/[Redacted]/\nand mirror link\nhttp://pear...3rmtqd.onion/Companies/[Redacted]/\nUse the Tor browser to follow links above\nNear Monday we’ll post samples of your files we’ve been sending you before in archives. On Tuesday we’ll publish all your data we have.\nWe set the lowest price at $270,000 to settle the incident.",
      "timestamp": ""
    },
    {
      "party": "Victim",
      "content": "Since you chose to post our name and files on your website, we have no choice but to part ways effective immediately. It’s unfortunate we couldn’t reach a resolution, but sometimes things end this way. We’re moving on and hope you do the same. This will be our final message. Goodbye.",
      "timestamp": "2025-08-01"
    }
  ]
}
