{
    "chat_id": "",
    "messages": [
        {
            "party": "Victim",
            "content": "[redacted]: How much to recover?",
            "timestamp": "10/19/2020, 5:57:21 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Price for you is 74btc.\n You need to pay this amount and we will give you decrypt tool for all \nyour machines, security report on how you were hacked, file tree on what\n we have downloaded from your network and wiping log of that \ninformation.\nTake into consideration that we have downloaded a lot of data from your \nnetwork that in case of not payment will be published on public news \nwebsite and sold on the black-markets. We remove it after payment and \nwiping log is provided as well.  To start a business we offer you to \nmake payment in two stages. What amount you can pay today?",
            "timestamp": "10/19/2020, 6:16:29 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you \nand we do not reach a consensus, we will start publishing and selling \nyour private information very soon. Please keep us writing notifying how\n it is going if there is still no success, so we understand that you are\n still with us.",
            "timestamp": "10/19/2020, 9:46:26 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Checking with management regarding your response. Don't think they would pay more than one or two coins.",
            "timestamp": "10/20/2020, 3:44:17 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: You're asking for over 3/4 of million dollars. 865k.",
            "timestamp": "10/20/2020, 3:46:48 AM"
        },
        {
            "party": "Conti",
            "content": "Support: We could give you \ndiscount if you pay shortly. Also you should remember that we own all \ncorporate data, including personal info of the employees, clients data, \nemails chats and etc. If you do not pay us, we will start to publish and\n sell that data. Think about your reputation.",
            "timestamp": "10/20/2020, 9:43:33 AM"
        },
        {
            "party": "Conti",
            "content": "Support: We think that you are \nnot completely aware of the seriousness of the situation. In the event \nof a further delay, we will be able to use information resource \nhttps://continews.best and will start to sell you private data on the \nblack markets.\nWe will publish the full dump of your data on our news website with \n1,000 visitors per day, 50% of them are mass media reporters and \nregulators, the other part is blackhat hackers. We are not interested in\n this, and we gain nothing from data publication, that is why we are \noffer you a deal.\n1) your clients data will be used by criminals\n2) your clients will fill lawsuit against you\n3) government regulators will fine you for data breach, if you have in \nclients at least one EU resident then you will be also fined by EU \ngovernment by GDPR law with millions of dollars of fine or permit ban \nfor working with EU citizents. US has the similar laws, but they are not\n so costly, however the total cost will exceed the asked amount from \nyou, so our offer is the best deal for you to resolve this issue.",
            "timestamp": "10/21/2020, 9:08:00 AM"
        },
        {
            "party": "Conti",
            "content": "Support: Look to the leaked info\n https://continews.best so you understand how full dump looks like and \nyou could estimate your losses carefully, we have more 7 big companies \nwaiting in queue to be published, do not get traped into this list.\nWe need your decision today or you will be published.",
            "timestamp": "10/22/2020, 9:50:38 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Well we start to \npublish your data. Here is the web link:\nhttps://continews.best/[redacted]\nIf you want to stop that process you have last chance for that. \nOtherwise the most valuable part of info will be sold on the black \nmarkets and the the rest will be published. Private data of your \nemployees and clients is under the risk, you have to think about it.",
            "timestamp": "10/23/2020, 11:08:32 AM"
        }
    ]
}