{
    "chat_id": "20201017",
    "messages": [
        {
            "party": "Victim",
            "content": "[redacted]: Hello",
            "timestamp": "10/17/2020, 2:50:24 PM"
        },
        {
            "party": "Conti",
            "content": "Support: HI\nPrice for you is 69btc. You need to pay this amount and we will give you decrypt tool for all your machines, security report on how you were hacked, file tree on what we have downloaded from your network and wiping log of that information.\nTake into consideration that we have downloaded a lot of data from your network that in case of not payment will be published on public news website and sold on the black-markets. We remove it after payment and wiping log is provided as well.  To start a business we offer you to make payment in two stages. What amount you can pay today?",
            "timestamp": "10/17/2020, 5:28:06 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will start publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "10/18/2020, 8:43:41 AM"
        },
        {
            "party": "Conti",
            "content": "Support: We think that you are not completely aware of the seriousness of the situation. In the event of a further delay, we will be able to use information resource https://continews.best and will start to sell you private data on the black markets.\nWe will publish the full dump of your data on our news website with 1,000 visitors per day, 50% of them are mass media reporters and regulators, the other part is blackhat hackers. We are not interested in this, and we gain nothing from data publication, that is why we are offer you a deal.\n1) your clients data will be used by criminals\n2) your clients will fill lawsuit against you\n3) government regulators will fine you for data breach, if you have in clients at least one EU resident then you will be also fined by EU government by GDPR law with millions of dollars of fine or permit ban for working with EU citizents. US has the similar laws, but they are not so costly, however the total cost will exceed the asked amount from you, so our offer is the best deal for you to resolve this issue.",
            "timestamp": "10/19/2020, 1:22:08 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Well we start to publish your data. Here is the web link:\nhttps://continews.best/[redacted]\nIf you want to stop that process you have last chance for that. Otherwise the most valuable part of info will be sold on the black markets and the the rest will be published. Private data of your employees and clients is under the risk, you have to think about it.",
            "timestamp": "10/20/2020, 9:29:50 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Hi, we were notified of data being posted to your website. We do not want any mire data posted. What can we do to stop this?",
            "timestamp": "10/23/2020, 12:06:23 AM"
        },
        {
            "party": "Conti",
            "content": "Support: We gave the price. It is just beginning. We have much more data which will be posted or sold on the black markets.",
            "timestamp": "10/23/2020, 9:37:53 AM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will keep publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "10/23/2020, 5:50:52 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We understand. We will reach a consensus, we just need more time. Please do not sell or post anything.",
            "timestamp": "10/23/2020, 7:31:24 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Hello. We are still with you. We are a non-profit organization that provides [redacted] services to people that don't have a lot of money or possessions. You have posted our data to your site once already. What other data do you have? We really don't want any more of our data posted, as that would really affect the poor folks here that are already down on their luck. Unfortunately, we dont have much extra in the budget, but we will do whatever we can to protect this data.",
            "timestamp": "10/25/2020, 11:03:00 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We posted you, because you stopped to response. We do not like wasting of time. You know the price, moreover we could you give discount 10BTC. So total price is 59BTC. Also you should not forget that the most valuable part of data will be sold to the black hat hackers.",
            "timestamp": "10/26/2020, 8:47:55 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We will need to get upper management together to discuss how much we can afford. Before our meeting, is it possible for you to give us some statistics about the amount of data and from what servers it has been compromised? This will help us get everyone to agree to pay and get the budget approved.",
            "timestamp": "10/26/2020, 1:10:58 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We have a lot of your data from more then 90 servers and 500 desktops. Hurry up, it is a lot of private data. Otherwise we will start to look for clients on it and the price will raise.",
            "timestamp": "10/26/2020, 1:27:03 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will start publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "10/27/2020, 11:40:56 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Okay, we understand how severe this is, and we will reach and agreement with you. In order for me to continue the conversation with our bosses here, can you send me a sample of stolen data from at least 2 different servers that are different than what was already posted to the website? Once we have that, we will hopefully be able to quickly determine our budget and let you know how long it will take to save up the money.",
            "timestamp": "10/27/2020, 1:56:27 PM"
        },
        {
            "party": "Conti",
            "content": "Support:   Copy of [redacted] July 2020.xlsx [ 1MB ]",
            "timestamp": "10/27/2020, 3:56:18 PM"
        },
        {
            "party": "Conti",
            "content": "Support:   RECORD REQUEST.xlsx [ 95kB ]",
            "timestamp": "10/27/2020, 3:56:28 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Here is 2 more samples.",
            "timestamp": "10/27/2020, 3:56:41 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will start publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "10/27/2020, 8:34:57 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We are still here. Is it possible for you to provide any more information on what was taken that hasn't already been posted? We need to know more about what is at stake. We don't want any more of our data leaked or sold.",
            "timestamp": "10/28/2020, 6:17:20 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We already sent you files and told that we took data from 96 servers and more then 500 desktops. Is it not understandable for you?",
            "timestamp": "10/28/2020, 6:26:46 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Is there anything you can do to prove that you have that much data of ours? How do you normally prove to people?",
            "timestamp": "10/28/2020, 11:47:09 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Normally is several enough. We do not keep data on hard drives, it is all in clouds. So it is complicated process to show several more files. Also you should understand that downloading process is very easy compare to hacking process. We mean that if we broke your system, get your data is the easiest part.",
            "timestamp": "10/29/2020, 8:46:34 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: I understand and believe you that its not a hard process to steal data once you are on our network. We are just trying to get more information because we dont have as much money as the companies that I bet you normally work with do. We are a nonprofit, so we dont have much extra cash for events like this, but we are working on getting money together. Could you do us a favor and send a screenshot of the amount of data that is in the cloud? That will give us more information to go get the budget approved. Is that screenshot easy enough to do or do you not have access to the cloud?",
            "timestamp": "10/29/2020, 12:38:15 PM"
        },
        {
            "party": "Conti",
            "content": "Support: That is not possible. We could not provide that screenshot. We told the size of it.",
            "timestamp": "10/29/2020, 2:11:46 PM"
        },
        {
            "party": "Conti",
            "content": "Support: How is it going so far?",
            "timestamp": "10/29/2020, 7:10:57 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We are working on reviewing all the data you have provided, and we are trying to adjust budgets to be able to pay something. How would we even pay you?",
            "timestamp": "10/29/2020, 10:49:12 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We will give you BTC wallet as soon as you will be ready. It is not a problem. Also it is only small part of data, even we can say 1 folder of thousands folders. One more thing, we will upload more data on Monday.",
            "timestamp": "10/30/2020, 7:34:25 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Oh okay, so we have to get BTC and transfer to you. We will lookup how to do that. One more question about the data you have taken. Can you tell us the size of all the data youve taken? Number of Gigabytes? There is no way we could pay you by Monday. We dont even have the money to pay 59 Bitcoin. How can you expect us to pay before Monday? If anymore data is posted, we will stop talking to you and not pay anything. We need you to be patient with us. Looking at the current price of bitcoin, I wish we had $780,000 to pay, but we dont. We lose money every year. Can you confirm no data will be posted on Monday while we figure out how much we can pay?",
            "timestamp": "10/30/2020, 12:36:21 PM"
        },
        {
            "party": "Conti",
            "content": "Support: OK. We are confirming this. The size of the data which was taken is more then 50TB, as we told you previously this files are from 96 servers and 500 desktops.",
            "timestamp": "10/30/2020, 1:12:19 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Thanks for letting us know the total size. We are taking this into consideration while we review how much we can afford. Is there anything else we need to know?",
            "timestamp": "10/31/2020, 12:31:12 PM"
        },
        {
            "party": "Conti",
            "content": "Support: You know the price and conditions. You should remember that we will start to raise price very soon if we do not arrange an agreement.",
            "timestamp": "11/2/2020, 10:22:38 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Okay, we are continuing to try and come up with the money for 59 Bitcoins, but it will take at least a few weeks. I'm sorry, but as a non-profit, we hardly have the money for payroll, so we need to adjust the budget and save. Please do not raise the price because we cannot afford any additional increase. Is there any further discount you can provide?",
            "timestamp": "11/2/2020, 1:41:43 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We could make additional discount 5BTC. We will not wait for several weeks and keep the price on the same level. That price is valid till the end of the week. OK?",
            "timestamp": "11/2/2020, 2:16:30 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: I will take the offer to management and get back to you soon. Could we have until at least Monday to decide?",
            "timestamp": "11/3/2020, 1:12:45 AM"
        },
        {
            "party": "Conti",
            "content": "Support: That is too long. You need to pay till the end of the week.",
            "timestamp": "11/3/2020, 8:32:25 AM"
        },
        {
            "party": "Conti",
            "content": "Support: How is it going so far?",
            "timestamp": "11/4/2020, 11:55:50 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Hi, we have talked, and the most we can possibly afford to pay is 14BTC. We can not afford to pay the 54 Bitcoins that you are asking for. If you can accept this, it will take us a little while to get the bitcoin, but we could pay it.",
            "timestamp": "11/4/2020, 1:39:12 PM"
        },
        {
            "party": "Conti",
            "content": "Support: That is not enough. Your private data cost much more on the black market because it includes a lot of private info(ids, ssn and etc). You should make better offer.",
            "timestamp": "11/4/2020, 2:26:54 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We could give additional discount 5BTC.",
            "timestamp": "11/4/2020, 3:55:32 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Thank you for the additional discount. Could you send us one sample file showing us Social Security numbers as proof that you have the data you saw? That will help us get more budget approved.",
            "timestamp": "11/4/2020, 11:20:44 PM"
        },
        {
            "party": "Conti",
            "content": "Support:   Driver's License.pdf [ 19kB ]",
            "timestamp": "11/5/2020, 4:14:29 PM"
        },
        {
            "party": "Conti",
            "content": "Support:   [redacted].pdf [ 94kB ]",
            "timestamp": "11/5/2020, 4:14:39 PM"
        },
        {
            "party": "Conti",
            "content": "Support:   License.pdf [ 303kB ]",
            "timestamp": "11/5/2020, 4:14:48 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Here is several samples.",
            "timestamp": "11/5/2020, 4:16:26 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will start publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "11/5/2020, 10:35:02 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We will start to publish and sell your data on Monday if you do not answer.",
            "timestamp": "11/6/2020, 3:49:29 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We do not want any data published. We just can't get even close to approval to pay what you are asking. We just simply do not have the money. We could afford at most 15 bitcoins. We are working on getting budget approval for 15 bitcoins. We are a not for profit healthcare facility. We don't have the same types of budget as some other healthcare. Can you please not publish anything and consider our offer?",
            "timestamp": "11/6/2020, 7:46:41 PM"
        },
        {
            "party": "Conti",
            "content": "Support: That is still very low.We could earn more profit if we sell your data. So you should make better offer.",
            "timestamp": "11/6/2020, 8:24:32 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: This is not a low offer for us. You can look up information about us, but we are not funded and we are a non profit, but we want to do everything we can to protect our information. We will go back and see what we can do to afford more, but please understand there is not much more money than this to go around.",
            "timestamp": "11/7/2020, 6:59:13 PM"
        },
        {
            "party": "Conti",
            "content": "Support: According to the public records, your revenue is 76KK. So we offer possible price for you.",
            "timestamp": "11/8/2020, 5:26:24 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Yes, our revenue is very low, and this year it will be negative. Im not sure I understand. What is the possible price?",
            "timestamp": "11/8/2020, 12:27:09 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Ok. We could give additional discount and price now is 44BTC.",
            "timestamp": "11/8/2020, 6:45:46 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We could even make some more, so price is 39BTC.",
            "timestamp": "11/8/2020, 10:14:04 PM"
        },
        {
            "party": "Conti",
            "content": "Support: So what is your decision?",
            "timestamp": "11/9/2020, 4:55:30 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: I am taking your latest price of 39BTC to our team and seeing if we can get any additional budget approved.",
            "timestamp": "11/9/2020, 7:08:43 PM"
        },
        {
            "party": "Conti",
            "content": "Support: How long will it take?",
            "timestamp": "11/9/2020, 8:37:58 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We will have a decision to you this week.",
            "timestamp": "11/10/2020, 2:53:25 PM"
        },
        {
            "party": "Conti",
            "content": "Support: It is taking too long. We want to know it tomorrow. You have talk to your bosses and explain them the seriousness of the situation. Also they should remember that the price is much cheaper then you will pay lawsuits, that your clients will send you and government fines, because you have lost so much of their data.",
            "timestamp": "11/10/2020, 4:42:58 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Yes, this is a severe incident for us, but we just simply dont have the Money. Our offer of 15BTC still stands if you want to accept it, but we cant pay what youre asking.",
            "timestamp": "11/11/2020, 2:06:58 AM"
        },
        {
            "party": "Conti",
            "content": "Support: That is not reasonable price for so huge batch of data. You should remember that the price is much cheaper then you will pay lawsuits, that your clients will send you and government fines, because you have lost so much of their data. So, our offer is 25BTC.",
            "timestamp": "11/11/2020, 10:52:43 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: Ok. We appreciate the discount to 25BTC but, that is still more than we can afford. We don't have that kind of cash on hand. We are certainly willing to try and work something out with you because we don't want any more of our data posted but, 15BTC is the maximum we can pay. Please let us know if 15 BTC is enough.",
            "timestamp": "11/11/2020, 10:39:42 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Of course, we understand, that your work here is not easy and requires efforts to convince your board members. But we do not want to waste our time. So you should understand, that our team have plenty of projects running, and yours - just one from many. If we don't reach an agreement, we'll just shorten our profit. And on other hand, you would be ruined.",
            "timestamp": "11/12/2020, 12:36:46 AM"
        },
        {
            "party": "Conti",
            "content": "Support: So when will you proceed with the payment? Otherwise we will start to public data tomorrow.",
            "timestamp": "11/12/2020, 4:08:30 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: It took a lot of debate to get to this 15BTC, I'm not sure 25BTC will ever be possible. I will talk with the board and let them know about the 25BTC and see what they think. Like I said, we want to try and work something out with you so, we will update you in the next couple of days.",
            "timestamp": "11/12/2020, 11:35:02 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We think that you do not understand the seriousness and waste our time. Also you are making all movements very slow. Also, you could split the amount, pay us 15BTC and we will give decrypt tool for example. The rest 10BTC you could in 2 weeks and we will delete your data. So, we will start to upload your data anyway today, maybe it will rush you and your boss.",
            "timestamp": "11/13/2020, 7:02:10 AM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: If you upload any more data we will no longer pay anything. We dont need the decryption program. We just need our data deleted. For now, our offer still stands.",
            "timestamp": "11/13/2020, 2:47:17 PM"
        },
        {
            "party": "Conti",
            "content": "Support: So when do you proceed with the payment? We could accept 15BTC without decryption tool, just for data.",
            "timestamp": "11/13/2020, 3:09:52 PM"
        },
        {
            "party": "Conti",
            "content": "Support: In the event that you and we do not reach a consensus, we will start publishing and selling your private information very soon. Please keep us writing notifying how it is going if there is still no success, so we understand that you are still with us.",
            "timestamp": "11/16/2020, 1:58:01 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: We are working on figuring out how to get Bitcoin and will let you know when we have it.",
            "timestamp": "11/16/2020, 2:51:48 PM"
        },
        {
            "party": "Conti",
            "content": "Support: OK. Keep updating us please.",
            "timestamp": "11/16/2020, 4:01:46 PM"
        },
        {
            "party": "Conti",
            "content": "Support: How is it going so far?",
            "timestamp": "11/17/2020, 1:14:15 PM"
        },
        {
            "party": "Victim",
            "content": "[redacted]: I'm sorry, when we original had 15BTC approved, the price of bitcoin was much lower. With the new price of bitcoin, we can no longer afford 15BTC. When we tried to get the purchase approved, it wasn't approved because its almost $100,000 more than we originally had approved when we made the offer.",
            "timestamp": "11/17/2020, 2:45:54 PM"
        },
        {
            "party": "Conti",
            "content": "Support: We could not control the btc rate and it is your problem that you wasted time. We mean that you borrow additional funds somewhere.",
            "timestamp": "11/17/2020, 2:48:04 PM"
        },
        {
            "party": "Conti",
            "content": "Support: So should we start posting of your data?",
            "timestamp": "11/17/2020, 3:42:26 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Well we start to publish your data. Here is the web link:\nhttps://continews.best/[redacted]\nIf you want to stop that process you have last chance for that. Otherwise the most valuable part of info will be sold on the black markets and the the rest will be published. Private data of your employees and clients is under the risk, you have to think about it.",
            "timestamp": "11/19/2020, 9:48:27 AM"
        },
        {
            "party": "Conti",
            "content": "Support: Should we start to sell the data of your employees and patients?",
            "timestamp": "11/19/2020, 3:18:15 PM"
        },
        {
            "party": "Conti",
            "content": "Support: Good morning. Are you still with us?",
            "timestamp": "11/24/2020, 10:09:13 AM"
        }
    ]
}