{
    "chat_id": "20210316",
    "messages": [
        {
            "party": "Victim",
            "content": "Okay, what comes next?",
            "timestamp": "3/16/2021, 12:17:32 AM"
        },
        {
            "party": "Conti",
            "content": "As you already know - your network and all of your data were encrypted by CONTI team. Besides the encryption process we've downloaded a large pack of your internal documents and files that will be published in case our negotiations fail. How it happens can be seen on our website.\nThe recovery price is $920000 (17 BTC). If you want to make sure we can recover all of your data - you can send us the two files of your choice and we will decrypt them free of charge.\nIf we reach mutual agreement your will be provided with decryption tool, none of your internal data will be published and you will be provided with security tips on how to avoid further breaches.\nWe strongly recommend to review our offer in a timely manner to avoid additional expenses from your side on security software and on building the new network from scratch.\nThe example data pack will be provided tomorrow, which will include part of the file list and some actual data you can review.",
            "timestamp": "3/16/2021, 8:03:37 AM"
        },
        {
            "party": "Conti",
            "content": "[redacted]-30percentlisting.txt [ 7.4MB ]",
            "timestamp": "3/16/2021, 8:42:44 AM"
        },
        {
            "party": "Conti",
            "content": "[redacted]-datapack-example.zip [ 32.4MB ]",
            "timestamp": "3/16/2021, 8:44:34 AM"
        },
        {
            "party": "Victim",
            "content": "Can you allow us a few days to read through these? We have our hands full with our servers down and trying to look over the documents",
            "timestamp": "3/16/2021, 5:22:27 PM"
        },
        {
            "party": "Conti",
            "content": "Yes, you have time till the end of the week. Bit if you would like to receive a 25% discount it will be valid for only two business days.",
            "timestamp": "3/16/2021, 5:40:34 PM"
        },
        {
            "party": "Victim",
            "content": "Ok i understand. I will get back to you as soon as possible",
            "timestamp": "3/16/2021, 10:09:35 PM"
        },
        {
            "party": "Victim",
            "content": "I will come to this chat tomorrow with a decision. The final management meeting is this afternoon",
            "timestamp": "3/18/2021, 8:18:54 PM"
        },
        {
            "party": "Conti",
            "content": "Ok, we will be waiting for your reply tomorrow.",
            "timestamp": "3/18/2021, 8:23:16 PM"
        },
        {
            "party": "Victim",
            "content": "Ok thank you for giving us time to work through our analysis. With the end of the quarter closing in, our balances allow us to offer $110,000 to you for the deal. Please please take this offer to your side and ask if it is possible to accept. We will wait for your reply",
            "timestamp": "3/19/2021, 5:31:10 PM"
        },
        {
            "party": "Conti",
            "content": "Unfortunately we cannot accept this offer according to our internal rules, but we've discuss with the team and a ready to make a step forward by going down to $600k",
            "timestamp": "3/20/2021, 7:58:50 AM"
        },
        {
            "party": "Victim",
            "content": "Ok, I will tell the team this, but it's the weekend so they won't be able to meet until Monday or Tuesday ok?",
            "timestamp": "3/20/2021, 12:52:11 PM"
        },
        {
            "party": "Conti",
            "content": "Ok, just update me by Tuesday.",
            "timestamp": "3/20/2021, 1:12:26 PM"
        },
        {
            "party": "Victim",
            "content": "Ok yes",
            "timestamp": "3/20/2021, 1:24:04 PM"
        },
        {
            "party": "Victim",
            "content": "We are still in talks to see how we could pull authority to go higher but they are moving very very slowly. We have been able to get them to grant authority for a better offer of $145,000. Please tell me if it possible to accept this amount for us.",
            "timestamp": "3/23/2021, 3:58:28 PM"
        },
        {
            "party": "Conti",
            "content": "That is totally impossible. We have discussed internally and the lowest we can get is $350k. I am not authorized to accept any lower payment.",
            "timestamp": "3/24/2021, 9:37:54 AM"
        },
        {
            "party": "Victim",
            "content": "I submitted this to my superiors. I know they want to finish this up as soon as possible, but $350k may still be out of reach. I will check in with you when I hear back.",
            "timestamp": "3/24/2021, 9:24:14 PM"
        },
        {
            "party": "Victim",
            "content": "I will get back to you tomorrow with an update. Expenditures over a certain amount have to be approved by executive leadership and we are trying to keep this under that amount so we dont have to go through their approval.",
            "timestamp": "3/25/2021, 9:24:35 PM"
        },
        {
            "party": "Conti",
            "content": "ok. we will wait",
            "timestamp": "3/25/2021, 9:38:14 PM"
        },
        {
            "party": "Victim",
            "content": "Ok. By relocating some of our budget funds, we are able to move our offer higher to $162,000. I know this is lower than you are authorized to accept, but please let me know if your group can make an exception.",
            "timestamp": "3/26/2021, 3:51:30 PM"
        },
        {
            "party": "Conti",
            "content": "As I have already told, try to allocate $350k \nI cannot move any forward unfortunately",
            "timestamp": "3/26/2021, 4:17:55 PM"
        },
        {
            "party": "Victim",
            "content": "We'll need to find another way, because we cannot risk getting this delayed in the leadership approval process. Otherwise it will take weeks. I will have to look into outside sources for donations.",
            "timestamp": "3/26/2021, 5:36:18 PM"
        },
        {
            "party": "Conti",
            "content": "Ok. Keep us updated.",
            "timestamp": "3/27/2021, 7:00:01 AM"
        },
        {
            "party": "Victim",
            "content": "Please if you have a smaller amount from $350k this will help speed up the process greatly. I know you can't accept $162k, but it's going to be an uphill battle for us to try to double that amount for you. Please let me know",
            "timestamp": "3/27/2021, 12:26:41 PM"
        },
        {
            "party": "Victim",
            "content": "Can you please let me know if there is anything you could do. It is going to be challenging battle for us to come up with double the amount from what we have available ($162,000). We want to be able to reach an agreement with you but our executive leadership team is not approving $350,000. Please let me know if you can come down anymore.",
            "timestamp": "3/28/2021, 1:09:05 PM"
        },
        {
            "party": "Conti",
            "content": "Let's meet in between at the sum of $255k and get this over with. We want to close the deal asap, so the offer is exclusive and valid for only 2 business days.",
            "timestamp": "3/29/2021, 7:17:40 AM"
        },
        {
            "party": "Victim",
            "content": "We have our weekly monday meeting this afternoon and I will tell them about the amount and the deadline. I also wish to get this over with.",
            "timestamp": "3/29/2021, 5:17:50 PM"
        },
        {
            "party": "Conti",
            "content": "Ok, get back to me when the meeting is over.",
            "timestamp": "3/29/2021, 7:24:31 PM"
        },
        {
            "party": "Victim",
            "content": "We are able to go up to $172,000. We are too close to the limit at which point we will have to halt and go through the top leadership approval process, which has a high risk of rejection. We do not want to risk them turning us away.",
            "timestamp": "3/30/2021, 7:42:23 PM"
        },
        {
            "party": "Conti",
            "content": "We agree to accept.\nThe btc wallet for the payment is : [redacted]\nlet me know as soon as the transfer is made.",
            "timestamp": "3/30/2021, 8:47:19 PM"
        },
        {
            "party": "Victim",
            "content": "Thank you. I will notify the cfo's office and instruct them to arrange it",
            "timestamp": "3/31/2021, 5:24:45 PM"
        },
        {
            "party": "Victim",
            "content": "I'm sorry for the delay on this. They've asked me to come in for a meeting in the morning to confirm the arrangement of payment. I will check in with you after",
            "timestamp": "4/1/2021, 11:11:22 PM"
        },
        {
            "party": "Conti",
            "content": "It's been a while, let me know when the meeting is over.",
            "timestamp": "4/2/2021, 9:42:34 AM"
        },
        {
            "party": "Victim",
            "content": "Thanks for waiting. I guess the executives read some concerning news reports this week that companies who are hit with ransom are getting published anyway even if they try to pay. It scared them. I will make sure it gets done on Monday after they calm down",
            "timestamp": "4/2/2021, 9:44:05 PM"
        },
        {
            "party": "Conti",
            "content": "We would never do such a thing that will hurt our reputation. The executives shouldn't be worried while dealing with our particular group.",
            "timestamp": "4/3/2021, 8:54:37 AM"
        },
        {
            "party": "Victim",
            "content": "I have been in meetings all day. Our leadership has seen more news reports over the weekend that the conti group is publishing people who are offering to pay and they are uncomfortable about this. You said you never do that, but that is not what we read in the news",
            "timestamp": "4/5/2021, 8:45:14 PM"
        },
        {
            "party": "Conti",
            "content": "I haven't seen these news actually and not sure what it is about.",
            "timestamp": "4/6/2021, 11:52:50 AM"
        },
        {
            "party": "Conti",
            "content": "We do publish people who do not pay for sure.",
            "timestamp": "4/6/2021, 11:53:09 AM"
        },
        {
            "party": "Victim",
            "content": "It says the company offered conti 500k for payment and they got published instead, even though they wanted to pay",
            "timestamp": "4/6/2021, 2:03:38 PM"
        },
        {
            "party": "Victim",
            "content": "https://www.insurancejournal.com/news/[redacted].htm",
            "timestamp": "4/6/2021, 2:04:09 PM"
        },
        {
            "party": "Victim",
            "content": "https://www.databreaches.net/[redacted]/",
            "timestamp": "4/6/2021, 2:04:30 PM"
        },
        {
            "party": "Conti",
            "content": "We haven't reached the agreement on the price. That's the only thing why they were published. We already have such an agreement with you - so that is not an issue.",
            "timestamp": "4/6/2021, 2:05:56 PM"
        },
        {
            "party": "Victim",
            "content": "Ok. This wallet still ok? [redacted]",
            "timestamp": "4/6/2021, 4:02:49 PM"
        },
        {
            "party": "Conti",
            "content": "Yes.",
            "timestamp": "4/6/2021, 4:06:58 PM"
        },
        {
            "party": "Victim",
            "content": "We are about ready. Are you online?",
            "timestamp": "4/6/2021, 7:57:54 PM"
        },
        {
            "party": "Victim",
            "content": "Before we continue, please confirm you will send: 1) decryptor for all systems 2) list of our files 3) tell us how you accessed our network 4) proof our files are destroyed and promise they will never be published",
            "timestamp": "4/6/2021, 8:04:20 PM"
        },
        {
            "party": "Conti",
            "content": "I do confirm each of those four.\nBy the way, according to our talk I might assume we've dealt before previously, am I right?",
            "timestamp": "4/6/2021, 8:06:31 PM"
        },
        {
            "party": "Victim",
            "content": "We have been talking in here for a while if that is what you mean. Are you ready for us to send?",
            "timestamp": "4/6/2021, 8:08:39 PM"
        },
        {
            "party": "Conti",
            "content": "Yes, we are ready to accept the payment.\nAnd no, I meant your recovery company. Nevermind though, I might be mistaken.",
            "timestamp": "4/6/2021, 8:11:31 PM"
        },
        {
            "party": "Victim",
            "content": "The payment is done",
            "timestamp": "4/6/2021, 8:52:45 PM"
        },
        {
            "party": "Conti",
            "content": "I have already processed the request to the tech dept to provide the decryption tool the soonest possible.",
            "timestamp": "4/6/2021, 8:54:49 PM"
        },
        {
            "party": "Victim",
            "content": "What is approximate time to receive?",
            "timestamp": "4/6/2021, 8:55:22 PM"
        },
        {
            "party": "Conti",
            "content": "[redacted]-full-listing.txt [ 24.7MB ]",
            "timestamp": "4/6/2021, 8:58:11 PM"
        },
        {
            "party": "Conti",
            "content": "[redacted]_decryptor.exe [ 103kB ]",
            "timestamp": "4/6/2021, 9:01:58 PM"
        },
        {
            "party": "Conti",
            "content": "Please review the full listing and let us know when we can start shredding your data to provide the deletion log.",
            "timestamp": "4/6/2021, 9:02:52 PM"
        },
        {
            "party": "Victim",
            "content": "Ok thanks. I will let you know when its time",
            "timestamp": "4/6/2021, 9:03:22 PM"
        },
        {
            "party": "Conti",
            "content": "Decryptor:\n1) Launch the decryptor under Administrative rights\n2) Wait till the decryptor window is closed\n3) if any of the files haven't changed the extension back to the original - repeat 1 and 2",
            "timestamp": "4/6/2021, 9:03:41 PM"
        },
        {
            "party": "Victim",
            "content": "Please keep our chat open while we work on decryption in case we have questions. It is still running",
            "timestamp": "4/9/2021, 8:18:09 PM"
        },
        {
            "party": "Conti",
            "content": "Sure, let me know when you're over and we will delete the chat.",
            "timestamp": "4/9/2021, 8:23:55 PM"
        },
        {
            "party": "Victim",
            "content": "Thanks for waiting. Please proceed with file shredding and send me the delete log when it is ready",
            "timestamp": "4/19/2021, 8:55:03 PM"
        },
        {
            "party": "Victim",
            "content": "Did you get my message",
            "timestamp": "4/21/2021, 3:16:00 PM"
        },
        {
            "party": "Conti",
            "content": "[redacted]-removed.log [ 18.8MB ]",
            "timestamp": "4/21/2021, 4:21:30 PM"
        },
        {
            "party": "Conti",
            "content": "Shall we delete this chat now?",
            "timestamp": "4/22/2021, 12:36:19 PM"
        }
    ]
}
