{
    "chat_id": "20210923",
    "messages": [
        {
            "party": "Conti",
            "content": "Hello,  are you ready to negotiate?",
            "timestamp": "23/09/2021, 12:25:23"
        },
        {
            "party": "Conti",
            "content": "As you already know - your network and all of your data were encrypted by CONTI team. Besides the encryption process we've downloaded a large pack of your internal documents and files that will be published in case our negotiations fail. How it happens can be seen on our website\nThe recovery price is $100.000. If you want to make sure we can recover all of your data - you can send us the two files of your choice and we will decrypt them free of charge.\nIf we reach mutual agreement your will be provided with decryption tool, none of your internal data  will be published and you will be provided with security tips on how to avoid further breaches.\nWe strongly recommend to review our offer in a timely manner.",
            "timestamp": "23/09/2021, 15:33:14"
        },
        {
            "party": "Victim",
            "content": "Hi are you there?? Kindly help us please",
            "timestamp": "24/09/2021, 12:55:39"
        },
        {
            "party": "Conti",
            "content": "yes",
            "timestamp": "24/09/2021, 12:57:48"
        },
        {
            "party": "Victim",
            "content": "Kindly help us we are ready to pay you",
            "timestamp": "24/09/2021, 13:00:28"
        },
        {
            "party": "Victim",
            "content": "Price is very high? can you provide some discount to us?",
            "timestamp": "24/09/2021, 13:00:59"
        },
        {
            "party": "Victim",
            "content": "How much time will it takes to decrypt after sending money to you",
            "timestamp": "24/09/2021, 13:02:52"
        },
        {
            "party": "Conti",
            "content": "We will give the decrypt app immediately after payment and you can decipher everything for an hour",
            "timestamp": "24/09/2021, 13:22:46"
        },
        {
            "party": "Conti",
            "content": "In addition, we stole your 50 gigabyte data\nWithin 24 hours, we will download the list of what downloaded from your network",
            "timestamp": "24/09/2021, 13:24:49"
        },
        {
            "party": "Victim",
            "content": "tell us where we have to pay and kindly provide some discount please",
            "timestamp": "24/09/2021, 13:37:58"
        },
        {
            "party": "Conti",
            "content": "Do you wait for listing or want to pay fast?",
            "timestamp": "24/09/2021, 13:39:10"
        },
        {
            "party": "Conti",
            "content": "full-listing_[redacted].txt [ 4MB ]",
            "timestamp": "24/09/2021, 15:24:53"
        },
        {
            "party": "Victim",
            "content": ".",
            "timestamp": "27/09/2021, 21:21:43"
        },
        {
            "party": "Conti",
            "content": "?",
            "timestamp": "27/09/2021, 21:51:06"
        }
    ]
}