{
    "chat_id": "20211112",
    "messages": [
        {
            "party": "Victim",
            "content": "Hello - we will talk here from now on. Please confirm you are online on this chat.",
            "timestamp": "12/11/2021, 2:45:12 PM"
        },
        {
            "party": "Conti",
            "content": "confirmed",
            "timestamp": "12/11/2021, 4:30:45 PM"
        },
        {
            "party": "Conti",
            "content": "The good news is that we are businessmen. We want a ransom for anything that needs to be kept secret, and we don' t want to ruin your business. The amount at which we are ready to meet you and keep everything as collateral is $ 1,950,000\nIf you have secured a contract with us, all the consequences stated in this release would not affect you. We always keep the terms of the contract. - before your decision to have a contract with us or not your information will not be published or any other way disclosed. - In case you didnt contact us in 3 days just 1-3% of all your information will be published. You file structure will not be introduced to third parties. - In case of contract with us all the information will be deleted without the any possibility of recovery. You will be provided with the deletion report Despite the rumours spread by recovery companies we have never had any leaks of the data. We mean the data of the clients who have a contract with us and paid it. We are working with facts, not with rumours. And we have facts and proves of some recovery companies who secretly add 10-50% to our price for the client. If you have refused to make a contract with us or you just decided not to start communication, you should know: The dark information market has a turnover of about 500 billion dollars. We are going to loose the additional income so: - Your data will be fully uploaded to public access or never uploaded at all in case you make a contract with us and buy it - You file structure can be and will be introduced to other parties so they can choose what to buy if we didnt make a contract - You files can be sold and we dont care about the way those files will be used and where those files will be published. The main idea is that you can settle the wave the lawsuits and claims but in a few years the information that was sold can appear again as a a new data breach and you will have to solve that problem again and again.\nAfter payment you will get decryptors to all your systems, full file tree of downloaded data, non-recoverable deletion with proof log and security report on how you were hacked.",
            "timestamp": "12/11/2021, 5:29:29 PM"
        },
        {
            "party": "Victim",
            "content": "thank you. We will get some test files to you soon. The amount is quite significant can you offer any discounts if we try to work out a quick deal? bear in mind all financial institutions are closed on weekend.",
            "timestamp": "12/11/2021, 7:40:35 PM"
        },
        {
            "party": "Conti",
            "content": "Sure we can give you discount. But please don' t forget that we have studied your financial documents and bank statements very attentively. Also we are aware about your cyber insurance.",
            "timestamp": "12/11/2021, 7:48:36 PM"
        },
        {
            "party": "Victim",
            "content": "Please review this financials because we are not even close to being able to pay 1.95m business",
            "timestamp": "12/12/2021, 4:38:27 PM"
        },
        {
            "party": "Conti",
            "content": "You have cyber insurance. Use it.",
            "timestamp": "12/12/2021, 7:03:43 PM"
        },
        {
            "party": "Victim",
            "content": "we do not. The policy we have does not cover ransomware payment and my insurance said even if we had it back (they removed it recently) that CONTI is on their list of non payment.",
            "timestamp": "12/12/2021, 10:26:28 PM"
        },
        {
            "party": "Victim",
            "content": "we have to fund this ourselves",
            "timestamp": "12/12/2021, 10:26:38 PM"
        },
        {
            "party": "Conti",
            "content": "I have heard that story several times that your insurance company does not pay Conti. Please don' t bluff. If you have a counter proposal, then we are ready to listen to it and if it is adequate to accept it for discussion.",
            "timestamp": "12/13/2021, 7:13:52 AM"
        },
        {
            "party": "Conti",
            "content": "We see that you do not want to solve your problem. We are going to start publishing your data tomorrow.",
            "timestamp": "12/13/2021, 6:40:32 PM"
        },
        {
            "party": "Victim",
            "content": "we want to solve but you are being very difficult to discuss this. We do not have this kind of money and now you are telling me the insurance is lying to us. There is no insurance here period and we do not have this kind of money. What do you want us to do?",
            "timestamp": "12/13/2021, 7:56:14 PM"
        },
        {
            "party": "Conti",
            "content": "If you have a counter proposal, then we are ready to listen to it and if it is adequate to accept it for discussion.",
            "timestamp": "12/13/2021, 8:11:08 PM"
        },
        {
            "party": "Conti",
            "content": "Are you going to make us an offer? Or what we are waiting for?",
            "timestamp": "12/13/2021, 8:58:58 PM"
        },
        {
            "party": "Victim",
            "content": "I can offer 115K to settle this quickly. This is what we have.",
            "timestamp": "12/14/2021, 12:58:18 PM"
        },
        {
            "party": "Conti",
            "content": "Try to get a better decision.",
            "timestamp": "12/14/2021, 1:10:21 PM"
        },
        {
            "party": "Victim",
            "content": "This is what we have. What do you suggest?",
            "timestamp": "12/14/2021, 1:16:53 PM"
        },
        {
            "party": "Victim",
            "content": "and you published us too. We are not discussing any more if we are on your site.",
            "timestamp": "12/14/2021, 1:21:53 PM"
        },
        {
            "party": "Conti",
            "content": "You have cyber insurance policy !!!",
            "timestamp": "12/14/2021, 1:27:27 PM"
        },
        {
            "party": "Conti",
            "content": "2021 Cyber Cover.pdf [ 35.54 KB ]",
            "timestamp": "12/14/2021, 1:51:01 PM"
        },
        {
            "party": "Conti",
            "content": "If you want us to remove you from our blog, then you must negotiate and not answer once a day.",
            "timestamp": "12/14/2021, 1:52:43 PM"
        },
        {
            "party": "Victim",
            "content": "We will not discuss anymore until we are removed. \nThis policy does not pay for ransom. Do you know how to read what you showed? Do you understand what \" in aggregate\"  means anyway?\nThe insurance does not cover paying you. Now are you going to remove us and we can discuss a reasonable number or you just want to make your opinions get the better of you?",
            "timestamp": "12/14/2021, 2:01:25 PM"
        },
        {
            "party": "Conti",
            "content": "We will not remove you from our blog. Because you are lying to us about your insurance policy. We know how insurance works. You are not our first client and we have a very vast experience on this field. Give us a serious starting offer and we will remove you immediately.",
            "timestamp": "12/14/2021, 2:09:33 PM"
        },
        {
            "party": "Victim",
            "content": "We are aware of your vast experience and you are wrong. Let me know when you decide to discuss more seriously. We will be back to check but otherwise this is not moving ahead unless we are removed now. thank you.",
            "timestamp": "12/14/2021, 2:11:24 PM"
        },
        {
            "party": "Conti",
            "content": "You should understand, that our team have plenty of projects running, and yours - just one from many. If we don' t reach an agreement, we' ll just shorten our profit. And on other hand, you would be ruined. That is much more serious threat, than none making payment to us.",
            "timestamp": "12/14/2021, 2:14:26 PM"
        },
        {
            "party": "Conti",
            "content": "Once again, we studied your clients, what business you do on their behalf. The publication of the information downloaded by us will lead to large legal costs and the loss of business reputation will bring your company to bankruptcy.",
            "timestamp": "12/14/2021, 2:14:58 PM"
        },
        {
            "party": "Victim",
            "content": "guys - as I stated before, no negotiations can take place as long as we are on the blog. Now that we have been on it for a day, the appetite is even less. regardless of how many projects you have, which we know are many, in this one you are just burning bridges instead of being reasonable.",
            "timestamp": "12/15/2021, 1:13:15 PM"
        },
        {
            "party": "Conti",
            "content": "guys you don' t understand. in your situation, you are not telling us what to do, but vice versa. 2 business days left before we start uploading your private data.",
            "timestamp": "12/15/2021, 1:35:14 PM"
        },
        {
            "party": "Conti",
            "content": "We have removed your company for 24h.",
            "timestamp": "12/15/2021, 1:48:46 PM"
        },
        {
            "party": "Conti",
            "content": "your time is almost up. Give us reasonable offer",
            "timestamp": "12/16/2021, 3:22:58 PM"
        },
        {
            "party": "Victim",
            "content": "We can offer 150K to close this situation we are not woth what you think.",
            "timestamp": "12/16/2021, 4:45:24 PM"
        },
        {
            "party": "Conti",
            "content": "keep it. we will publish your data and  it will be a good example for the other companies.",
            "timestamp": "12/16/2021, 5:13:29 PM"
        }
    ]
}