{
    "chat_id": "Chat: *************EF866E",
    "messages": [
        {
            "party": "Victim",
            "content": "[Chat started]",
            "timestamp": "29.11.2023 00:40:19 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello",
            "timestamp": "29.11.2023 00:59:06 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "hi. to decrypt the data and avoid publication you need to pay us.",
            "timestamp": "29.11.2023 07:58:17 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Soon we will send you a tree of some of your data that we have downloaded.",
            "timestamp": "29.11.2023 07:58:25 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "File: [www.brownintegratedlogistics.com_list(112GB).txt]",
            "timestamp": "29.11.2023 08:01:15 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Select a few files from the list and we will send them  to you as proof. The entire list of downloaded data (430gb) is kept  confidential so as not to violate the privacy of the company and the  data we downloaded. We do not know exactly who we are negotiating with  and will not disclose such information.",
            "timestamp": "29.11.2023 08:01:29 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for providing this over. I will have to talk  with some of the other decision makers here so they can understand what  this all means so please give us a little time. We will keep in touch  with you and check here for any updates. Can you tell us how much we  need to pay?",
            "timestamp": "01.12.2023 17:52:22 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "$4,000,000 USD",
            "timestamp": "02.12.2023 07:53:18 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/lpL4qUkHcWxkXn05655b43bb2d843  You have 12 days to pay",
            "timestamp": "02.12.2023 07:56:42 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "When will you pay?",
            "timestamp": "05.12.2023 16:37:12 UTC"
        },
        {
            "party": "Victim",
            "content": "Okay we will be conscious of the time while we are  reviewing and meeting about this and check in here for any updates. Also  4 million is steep, is there anyway we can work on a lower price?",
            "timestamp": "07.12.2023 19:33:18 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "What price are we talking about? And why should the  price be lower? We have a lot of sensitive information from your network",
            "timestamp": "08.12.2023 06:13:24 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "4D 22H 18M",
            "timestamp": "09.12.2023 14:26:13 UTC"
        },
        {
            "party": "Victim",
            "content": "You are asking for 4 million dollars as well as calling  and DDOSing our site. If you want us to pay you need to give us time and  quit with these antics. It is only taking our attention away from  getting this resolved. If you need an update please message me here. In regards to your price, I do not think its unreasonable to ask if you  are able to work with us on it. 4 million dollars is not something we  could afford in any sort of time frame. What can we do to work out some  sort of discount or lower offer?",
            "timestamp": "11.12.2023 18:11:31 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "You entered the chat on Nov 29th and still haven't made a  single suggestion, it's not like you wish to resolve the issue quietly  and quickly, you force us to publish your name, force us to call you and  ddos. And then you ask for a discount? You are not the company that  needs it and you have very little time left. You're a huge corporation  with huge revenues, and the price is fair. If you resolve the issue  quickly, we'll give you a discount, but you haven't earned it yet.",
            "timestamp": "11.12.2023 18:16:27 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "When will you pay?",
            "timestamp": "11.12.2023 18:24:07 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "14 Dec, 2023 12:44 UTC your data will be published  unless we approve a timeframe and final redemption price. Will you  comment on this? Ignoring the question, will be considered as a refusal  to pay and agree to publication.",
            "timestamp": "13.12.2023 10:57:47 UTC"
        },
        {
            "party": "Victim",
            "content": "You are asking for an unattainable amount of money for  this. No one is ignoring you, we are just discussing how we can try and  make this work and checking in to make sure nothing is missed. Your  threats and calls and the DDOS will do nothing but put us in a position  where we can't work with you as it takes all the attention away from  gathering funding.  If you want that much money you need to give us more time as we can't  just throw together millions of dollars. If you want this done quicker  then please work with us on this. We can make an offer to you but it  will be substantially lower than what you want as we have no way to  reference what something like this is worth.",
            "timestamp": "14.12.2023 04:41:18 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Ok, we will remove your name from the blog, and stop the  ddos and calls, only in return we want to see you in chat, and we want  to know the time frame, how long do you still need to raise the amount?",
            "timestamp": "14.12.2023 05:12:36 UTC"
        },
        {
            "party": "Victim",
            "content": "Well your posting has caused us some further set backs  but we do appreciate you taking things down. If you are not willing to  budge on the price, we will need well into next week before we have  things gathered and approvals in place. This is no small amount of money  and we need to make sure we are doing everything appropriately to not  cause further issues.   We will continue to check this chat so please message me if you need an  update and I will keep you in the loop.",
            "timestamp": "15.12.2023 19:47:16 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We were forced to make a post because you didn't enter  the chat. If you negotiate and write to us about all the updates, then  you won't see your name on the blog. We've given you extra time to raise  money.  We look forward to hearing from you next week. We have to close  our issue by the end of next week",
            "timestamp": "15.12.2023 20:11:26 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Hey, what's the news? When will you pay?",
            "timestamp": "19.12.2023 10:55:49 UTC"
        },
        {
            "party": "Victim",
            "content": "We're trying our best to coordinate all the approvals  needed, please stay patient while we continue making progress.",
            "timestamp": "22.12.2023 16:05:56 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Next week is the last chance to settle this peacefully.  Otherwise, we will launch calls to your employees and customers, offer  the data downloaded from you to journalists and your competitors, and  launch another DDOS attack. Patience is running out...",
            "timestamp": "22.12.2023 16:27:41 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you, the Holiday just makes things difficult but we are working through it to get this wrapped up.",
            "timestamp": "23.12.2023 02:14:20 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Hurry up",
            "timestamp": "23.12.2023 07:14:24 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Your time is running out, when will you pay? If payment  is not received by 15:00 UTC 30.12.2023 we will publish your data",
            "timestamp": "28.12.2023 08:28:24 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "bc1q55nuugzpjfrvq60rsywsrhfdr8nw95706xpz5a",
            "timestamp": "30.12.2023 07:47:40 UTC"
        },
        {
            "party": "Victim",
            "content": "If you are still firm on your price, then we will need  time. We have had one long holiday weekend and are currently going into  another. You know that the holidays have made things very difficult with  banks and we are just trying to get this sorted. We would like to have  this wrapped up early but will more than likely get everything together  once the holiday is over.",
            "timestamp": "30.12.2023 16:29:23 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "The data has been released! Celebrate",
            "timestamp": "31.12.2023 09:46:14 UTC"
        }
    ]
}