{
    "chat_id": "Chat: *************3FB886",
    "messages": [
        {
            "party": "Victim",
            "content": "[Chat started]",
            "timestamp": "29.06.2022 18:43:54 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello. Thank you for your message. My bosses have said that they are taking this very seriously and want to work with you to find a solution.",
            "timestamp": "29.06.2022 19:07:39 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Hi. Ok.",
            "timestamp": "29.06.2022 19:08:08 UTC"
        },
        {
            "party": "Victim",
            "content": "Hi, what are the next steps please so that we can move forward with you?",
            "timestamp": "29.06.2022 19:08:13 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Here is the scheme. You pay us $5,000,000. We give you decryptor and remove your company from our blog and never publish stolen files as well delete them.",
            "timestamp": "29.06.2022 19:08:17 UTC"
        },
        {
            "party": "Victim",
            "content": "That is a tremendous amount of money that you are asking for and a figure that we can’t possibly offer to you. We know we have a 2022 negative cashflow situation. This is causing a considerable issue. We have passed your message to senior management who will consider your request.",
            "timestamp": "29.06.2022 19:08:26 UTC"
        },
        {
            "party": "Victim",
            "content": "We have spoken with the senior management. They have confirmed what we thought and told you earlier. The business has a negative cashflow situation at the end of this financial year in two weeks' time that is causing real difficulties. You can read our 2022 interim results announcement and confirm this fact for yourselves: http://www.genusplc.com/media/1991/interim-report-1h22-final.pdf. We had a cash outflow of £16.1M in the first half of our financial year and the second half has been equally challenging as the business focuses on conserving cash. This cyber-attack could not have come at a worse time for us as you can see from the market report we have linked to. We do want to work with you to reach a solution. Is there anything you can do?",
            "timestamp": "29.06.2022 19:08:37 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "you had an oppotunity to secure your network at a better time then. misfortune never comes alone. price is $5M.",
            "timestamp": "29.06.2022 19:08:45 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response, we are taking this very seriously. There are a number of important considerations that we need to undertake as a public company, as I'm sure you can appreciate. What reassurances do we have that making a payment to you is not unlawful?",
            "timestamp": "29.06.2022 19:08:53 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We are receiving payments from companies including public ones almost every day. Everything went good with all of them.",
            "timestamp": "29.06.2022 19:08:57 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response, and to confirm, we remain committed to resolving this situation with you. As a public company we need to ensure that our operating protocols are followed, therefore please confirm the file listing of data you have taken from us in order that we can proceed.",
            "timestamp": "29.06.2022 19:09:05 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "hi. ok. we send data listing after payment. these are the terms.",
            "timestamp": "29.06.2022 19:09:12 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response. In order for us to justify making a payment to you, which will benefit us both, we need to justify this action to our company stakeholders. We understand that it is normal practice for companies in our situation to be provided with details of the files in your possession. Once you have given us this, we will pick a file of our choosing for you to prove that you have the data concerned. When we have completed these steps we can move forward towards a resolution with you.",
            "timestamp": "29.06.2022 19:09:18 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "hi! we do not provide a list of data without payment",
            "timestamp": "29.06.2022 19:09:25 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "u must pay. or u will soon have the ability too see files on blog as countdown ends.",
            "timestamp": "29.06.2022 19:09:28 UTC"
        },
        {
            "party": "Victim",
            "content": "We have demonstrated throughout our conversations with you that we are absolutely committed to resolving this situation with you, both to your benefit and ours. However, how can we do this when you have not provided proof of possession of our data?",
            "timestamp": "29.06.2022 19:09:31 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "the best we can afford is to send you partial list of files.",
            "timestamp": "29.06.2022 19:09:36 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "https://temp.sh/XcaBs/genus.7z 2568256782468248428245724582452457245",
            "timestamp": "29.06.2022 19:09:39 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "very small part",
            "timestamp": "29.06.2022 19:09:43 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response and update regarding the partial data reveal. Clearly it is within your interests to share as much detail as possible on files that you hold so we can value the information accordingly and reach a suitable settlement with you that we are both in agreement with. The partial data that you have now provided will be categorised by our IT team in the morning on their return to work. We will update you as soon as this process has taken place.",
            "timestamp": "29.06.2022 19:09:48 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "You will get complete file tree after payment. As we have told before these are the terms of the deal. If you want to review the file tree for free - wait until your data is published.",
            "timestamp": "29.06.2022 19:10:00 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response which we will respond to shortly. Please note that we remain fully committed to resolving the situation with you to the benefit of us both.",
            "timestamp": "29.06.2022 19:10:04 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "https://temp.sh/LJPJj/genus_part2.7z",
            "timestamp": "29.06.2022 19:10:15 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "password 71366489127846894278",
            "timestamp": "29.06.2022 19:10:19 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response and the additional link to our data currently in your possession. We can confirm that we will be making a payment to you and therefore to proceed, please verify the following points: - You have now revealed all of our data file trees currently in your possession, there is nothing else that you have not shown us? - On payment you will destroy all of our data immediately? - You will not attack our organisation again in the future?",
            "timestamp": "29.06.2022 19:10:22 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We can confirm we have now revealed all of your data, your data will be destroyed right after you make a payment of $5,000,000 to our cryptowallet, we will never attack you anywhere in the future.",
            "timestamp": "29.06.2022 19:10:28 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Are you going to pay? We've been waiting.",
            "timestamp": "11.07.2022 14:44:36 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response. We have now assessed the value of our data that you hold and are willing to make a payment of USD 105,000 based on our previously agreed conditions with you; On payment you will destroy all of our data immediately and confirm that this has taken place; You will not attack our organisation again in the future.  Please confirm how we should make the payment.",
            "timestamp": "12.07.2022 07:19:37 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Though the amount you have offered is far away from our demanded amount, we can provide you a 25% discount as a goodwill gesture. 3750000$ for tool and data. BTC wallet for payment: bc1qh98g7cu0wnrf7awuqyjjs8uzc0sx7knp4d78kj.",
            "timestamp": "12.07.2022 09:23:09 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for your response and updated request. Our offer is based accurately on the value of the data that you hold, which has been calculated after meticulous review by us. Please note that we do not require decryption keys from you either.  We have been committed to dialogue with you, and have remained open and transparent throughout our conversations, therefore as a sign of good faith and good will gesture, we are prepared to make a very generous offer of USD 155,000 which is significantly beyond the value of the information you hold. We trust that this will conclude our business today in agreement.",
            "timestamp": "12.07.2022 15:05:02 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "It doesn't work this way. We will not accept 155,000. Your data will be posted if you do not pay within 24 hours.",
            "timestamp": "12.07.2022 17:02:50 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello. We have considered our position very carefully and have fully assessed the limited value of the data that you hold. Whilst we would prefer that you do not make our information publicly available, we have prepared for this eventuality should you choose this route. As it is not in either of our interests for our information to be made public, we are prepared to make a final settlement offer of USD 200k to reach agreement today, based on you not publishing any of our data and agreeing to destroy it immediately after payment. This figure is extremely generous and is a win-win scenario for both of us. Your money is ready now. Please advise how you wish to proceed?",
            "timestamp": "13.07.2022 15:54:44 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "There's a difference between us in how we estimate value of information and cost of our postpaid pentest service. The price is far bigger than your offered amount. However we offer a final discount if you pay us today. Final price is $3,3kk.",
            "timestamp": "13.07.2022 16:12:44 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/UH9CN38uu4tIdmMe62d0116b7c5f8",
            "timestamp": "14.07.2022 12:57:54 UTC"
        }
    ]
}