{
    "chat_id": "Chat: *************DEDFDF",
    "messages": [
        {
            "party": "Victim",
            "content": "[Chat started]",
            "timestamp": "07.11.2023 16:42:49 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello, how much to decrypt?",
            "timestamp": "07.11.2023 16:43:31 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "hi. to decrypt the data and avoid publication you need to pay us. we haven't published your name on our blog yet",
            "timestamp": "08.11.2023 08:10:49 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "$2,000,000 USD",
            "timestamp": "08.11.2023 08:11:51 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Soon we will send you a tree of some of your data that we have downloaded. We downloaded 163gb of data, which includes data from other companies",
            "timestamp": "08.11.2023 08:14:35 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello gentlemen, thank you for your communication. This demand is very high for us. Please do send through the data tree so that we can review this",
            "timestamp": "08.11.2023 08:40:38 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "I'm uploading it now. I apologize, we only downloaded 192gb.",
            "timestamp": "08.11.2023 08:48:10 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "http://lockbitfile2tcudkcqqt2ve6btssyvqwlizbpv5vz337lslmhff2uad.onion/r/QL2BmhkLqn#B41uCdiZJGQb6viZW/43RGHngWCStmiFLdQ2pgr0A9Q=",
            "timestamp": "08.11.2023 08:59:34 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Select a few files from the list and we will send them to you as proof. The entire list of downloaded data is kept confidential so as not to violate the privacy of the company and the data we downloaded. We do not know exactly who we are negotiating with and will not disclose such information.",
            "timestamp": "08.11.2023 08:59:56 UTC"
        },
        {
            "party": "Victim",
            "content": "Thank you for this information. I have been quite shocked by your initial demand as i am just 1 man IT service provider and honestly these are figures that I have not even seen in my lifetime. I think that perhaps you have misunderstood who you have attacked and even the clients i serve are very small businesses and do not deal with figures like this, after all they work with me and I am just a 1 man band and nothing more. I cannot even imagine being able to afford $2 million, i wish that I could. Can you please reconsider this amount?",
            "timestamp": "08.11.2023 13:21:03 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "we worked on a network of ~180 pc's, what are you talking about?! You were the only one working on that network?",
            "timestamp": "08.11.2023 13:37:20 UTC"
        },
        {
            "party": "Victim",
            "content": "I am IT service provider, I have server for my clients and its only me. You access my network",
            "timestamp": "08.11.2023 13:39:23 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "You'll have to pay",
            "timestamp": "08.11.2023 14:26:00 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Either you or your customers will have to pay",
            "timestamp": "08.11.2023 14:26:55 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "At this point, we are reviewing the downloaded information. After that it will be clear who will be affected by the publication of this data",
            "timestamp": "08.11.2023 14:29:36 UTC"
        },
        {
            "party": "Victim",
            "content": "I do not mind to pay but this figure is really unachievable. Even my clients they are small people, dentist, company that sells toys to kindergarten, retired consultant mostly working for themselves. ",
            "timestamp": "08.11.2023 14:54:46 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "so to avoid publication, you all have to pool your money and pay up.",
            "timestamp": "08.11.2023 16:13:42 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello gentlemen, unfortunately this demand is just not at all achievable. I simply have never seen this kind of money before. I really do want to work with you on this and come to a resolution but I am not in a position to produce money that either myself or my clients have ever been able to produce in our entire lives. I still think that you might be confused about who you have attacked, but if you take a look at my company and my client companies you will see that we are just small companies and we simply are not making millions, even $100,000 is something that we do not make in a year",
            "timestamp": "09.11.2023 08:16:10 UTC"
        },
        {
            "party": "Victim",
            "content": "I have spoken together with my small clients and looked myself into what I can manage to pay here and currently I am able to pull together $30,000 here for you. Please understand gentlemen that I am not being difficult here. My company is only myself, i have no other employees working with me, so i don't make hundred of thousands or millions of dollars. My clients are the same as me, all we are doing is working to pay our own salary, we are not big companies working to make big profits.",
            "timestamp": "09.11.2023 08:21:20 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Impossible.",
            "timestamp": "09.11.2023 08:24:38 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "$2,000,000 USD",
            "timestamp": "09.11.2023 08:27:50 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "to resolve the issue and avoid publication, you'll have to pay",
            "timestamp": "09.11.2023 08:28:23 UTC"
        },
        {
            "party": "Victim",
            "content": "There is no such money",
            "timestamp": "09.11.2023 08:28:33 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Then we won't come to an agreement. 30k is not enough for that.",
            "timestamp": "09.11.2023 08:30:12 UTC"
        },
        {
            "party": "Victim",
            "content": "I mean no disrespect and I see how good you are at what you do and achieve through your work. I just do not understand where you think that I can find 2,000,000. This does not exist",
            "timestamp": "09.11.2023 08:31:27 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We consider it a fair price for our work and the information we received",
            "timestamp": "09.11.2023 08:32:39 UTC"
        },
        {
            "party": "Victim",
            "content": "If I have this money then maybe I will be sitting on a beach enjoying my life instead of working 12 hours a day on my own to maintain IT systems for small clients that pay very little for IT support because they themselves are not making much money",
            "timestamp": "09.11.2023 08:33:20 UTC"
        },
        {
            "party": "Victim",
            "content": "I do not disagree with you about the work that you do and the worth of it. You are very good at what you do, I can see this. Much better than me as a small IT guy. ",
            "timestamp": "09.11.2023 08:34:13 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Thank you, but you'll have to pay",
            "timestamp": "09.11.2023 08:47:28 UTC"
        },
        {
            "party": "Victim",
            "content": "$2,000,000 is just not possible for us",
            "timestamp": "09.11.2023 09:06:46 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Look for the money or else publishing will do more damage to you and your customers. Plus, you'll have to rebuild your networks and systems",
            "timestamp": "09.11.2023 09:44:44 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "If you don't have the ability to raise the money and pay, go away and don't waste our time. Wait calmly for your data to be published",
            "timestamp": "09.11.2023 09:50:24 UTC"
        },
        {
            "party": "Victim",
            "content": "Unfortunately I have been able to raise up to $50,000 here but we just don't have millions. So we are unable to proceed here. It is disappointing that you still want to release data as this does not do more damage to us here given we do not have millions to be damaged.  I was hoping we will meet an understanding here.",
            "timestamp": "09.11.2023 10:13:29 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "I have no desire to publish your data. I have a desire to be paid for our work. But if you do not pay, I will be forced to publish your data. These are the rules",
            "timestamp": "09.11.2023 10:15:23 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "50k is still not enough. You know the price. We won't settle for less",
            "timestamp": "09.11.2023 10:17:52 UTC"
        },
        {
            "party": "Victim",
            "content": "I met with my customers yesterday and confessed the overall situation to them in shame. I would take out 2 private loans and one of my clients can use his reserves so we can get a total of $123,238 together.  Do you agree to this deal?",
            "timestamp": "11.11.2023 07:36:41 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "a good step, but it's still not enough. I gave you a ransom price to pay.",
            "timestamp": "11.11.2023 07:40:50 UTC"
        },
        {
            "party": "Victim",
            "content": "Okay, it's a shame that your management won't agree to this or at least be realistic about it. As I have already written, it is financially impossible to pay such an amount.  I will therefore file for bankruptcy for my company and the customers will have to prepare their data manually. A possible publication of data is therefore irrelevant.   Thank you very much for your time and your always friendly communication.",
            "timestamp": "11.11.2023 07:42:35 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Okay",
            "timestamp": "11.11.2023 07:43:27 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello",
            "timestamp": "15.11.2023 12:50:36 UTC"
        },
        {
            "party": "Victim",
            "content": "I spoke with support in TOX who agree to the offer of $100,000 here. Can you confirm this and send bitcoin wallet for payment?",
            "timestamp": "15.11.2023 12:53:16 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Hey, do you take us for fools?",
            "timestamp": "15.11.2023 13:40:37 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We can discount 100k but not accept payment. That's pennies to resolve this issue",
            "timestamp": "15.11.2023 13:41:59 UTC"
        },
        {
            "party": "Victim",
            "content": "Well noted, unfortunately this will mean we cannot move forward here. The person in this Tox ID is claiming to be lockbit, i would assume this is lies? 59052DE8288FE054576FB2D8ADE27E35AD9269F5AB4BED99BDC019B81D40B97",
            "timestamp": "19.11.2023 16:07:30 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "Where you got this tox ID?",
            "timestamp": "19.11.2023 18:58:55 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "It's scammers",
            "timestamp": "19.11.2023 18:59:55 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "You can make deal only in this chat",
            "timestamp": "19.11.2023 19:00:07 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "We never make deals in tox",
            "timestamp": "19.11.2023 19:00:21 UTC"
        },
        {
            "party": "Victim",
            "content": "Ok Gentlemen, thank you for your time. Unfortunately i've only manage to come up with $100,000 here. You know my company and know that I cannot afford more, so unfortunately you have blocked us from coming to an agreement. I note the data is set to be published, this is of no consequence at this stage given no damage can be done here. I hope that your future endeavours are more fruitful for you.",
            "timestamp": "20.11.2023 10:18:22 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "you can talk all you want, but it's no good. We don't need 100k, we'll just publish your data and get on with our work.",
            "timestamp": "20.11.2023 10:26:25 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "$1,900,000",
            "timestamp": "20.11.2023 10:26:40 UTC"
        },
        {
            "party": "Victim",
            "content": "Hello, now that data has been leaked, will you reconsider your figure only for decryption?",
            "timestamp": "27.11.2023 06:52:22 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "if you want your data back, you need to change your negotiating approach, and offer us a good price.",
            "timestamp": "27.11.2023 07:27:53 UTC"
        },
        {
            "party": "LockBit 3.0",
            "content": "So far, you've only offered 100k, which we're not happy with, but we still gave you a discount.",
            "timestamp": "27.11.2023 07:28:38 UTC"
        }
    ]
}