{
    "chat_id": "",
    "messages": [
        {
            "party": "Avaddon",
            "content": "Hello, will you take the decryption or not?",
            "timestamp": "15:25 12.01.2021"
        },
        {
            "party": "Victim",
            "content": "Hello There! I need help my test decryption not working",
            "timestamp": "12:49 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "u still there? Ready to pay!",
            "timestamp": "12:50 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "by now Github Decrypted my files, thanks!",
            "timestamp": "12:51 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "Hi sir",
            "timestamp": "13:16 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "What do you mean \"by now Github Decrypted my files, thanks!\"?",
            "timestamp": "13:18 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "Only we have a decryptor, no github decryptors will help you!",
            "timestamp": "13:18 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "Do not rejoice, you will not be able to \nunblock all your servers, only we can unblock your servers, you better \npay, we even reduced the price for you from $ 1,000,000 to $ 200,000, \nyou now better buy a decryption, and finish this business already",
            "timestamp": "15:34 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "Hey You know the guy that publish the free decryptor on githut and You seen it ?",
            "timestamp": "19:34 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "we have already released a patch, so it won't help you another time)",
            "timestamp": "19:47 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "the more we doubt that you have decrypted \nfiles, because the decryptor can decrypt files under very specific \nconditions",
            "timestamp": "19:49 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "Have you seen the release of your important documents on our blog?",
            "timestamp": "19:50 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "I would like to know if You will come after me again.",
            "timestamp": "20:08 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "We cannot pay that even though! It is \noutrageous! We are drowing on debt, no payment will be released to You, \nWe have no assurance of decryption as many customers of yours are \ncomplaining of issues decrypting their files after payment as well.;",
            "timestamp": "20:12 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "We have no problem starting from scratch, \nOur only concern is been hit a second time like One customer of Yours \ndid.",
            "timestamp": "20:13 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "ok, enjoy leaking files on your blog. Our \nclients have no problems with decrypting files, you need to listen to \nnegotiators less and then you will have no problems",
            "timestamp": "20:19 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "We don't want to listen to them That is Why i come in here myself!",
            "timestamp": "20:23 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "I am begging You",
            "timestamp": "20:23 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "and why are you writing here?",
            "timestamp": "20:36 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "Cause There is no place else to write. We Want to rear from You",
            "timestamp": "21:17 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "It's good that you contacted us yourself. \nLook, we are a serious organization and every month Avaddon General \nDecryptor is bought by hundreds of clients and there are no problems \nwith decryption. Those comments that you read can be written by anyone, \neven people who have never worked with us, in order to lower our \nreputation. But this is pointless, since thousands of customers who \nbought our decryptor will refute information about the about poor \nperformance ability of our software.",
            "timestamp": "22:06 20.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "If we do not agree on a price for the \nbuyback and you do not pay, then we will wait until you fully restore \nyour entire online infrastructure and we deliver a SECOND IMPACT, and \nbelieve me, this blow will be more destructive, you will lose a lot more\n money and get more problems. as there will be a second wave of data \nleakage which will be measured by terabytes of data. We are ready to \ndiscuss the new price with you and remove your company data from our \ndata breach blog. After payment, we will give you a decryptor that will \ndecrypt absolutely all PCs / servers on your network, delete the files \n(we will provide proofs that the files have been deleted) and provide \nyou with a list of vulnerabilities, with the help of this list you can \neliminate all the vulnerabilities in your network and this situation \ncannot happen again with you in the future",
            "timestamp": "22:08 20.02.2021"
        },
        {
            "party": "Victim",
            "content": "Will You be Our consultant perhaps? Will You\n tell Us how you got in because We failed to diagnose the entry point, \nWe just found the binary. Vulnerabilities are discovered everyday and \nyet We failed to fix Ours with your penetration at Our Network. How low \ncan We get on a ransom? We already lost so much, If you hit Us one more \ntime We will no option but declare bankruptcy.",
            "timestamp": "11:26 21.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "In what sense will I be your consultant?",
            "timestamp": "12:00 21.02.2021"
        },
        {
            "party": "Avaddon",
            "content": "Look, you could write to us right away, we \nwould have settled this issue and you resumed your work a few weeks ago,\n but for some reason you did not want to do this ... Yes sir, \nvulnerabilities are found every day, but there were many holes in your \nnetwork, we are ready to point you to them and tell you what to do so \nthat they are closed, we will help you secure your network and if in the\n future you keep our advice it will be practically impossible to crack, \nbut You will receive instructions on how to close the holes and secure \nyour network only after payment. We understand that financial losses are\n possible in your business now and we understand perfectly well what \nwill happen if we deliver the SECOND IMPACT, the second blow will mean \nan absolute collapse for you. We do not want to do this (we even reduced\n the price for you from 1kk to 200k), but we will have to if we do not \nnow agree with you on the price for the buyback. Make a meeting with the\n management or people who are responsible for finances in your company, \nexplain to them the current situation and what awaits you in the future,\n if we do not agree on the price for the ransom and offer us your price,\n we are waiting for an answer from you, because time is ticking, and for\n you, time is money.",
            "timestamp": "12:00 21.02.2021"
        }
    ]
}