{
    "chat_id": "20250203 - from @RakeshKrish12",
    "messages": [
        {
            "party": "Qilin",
            "content": "Hello. I'm here. How can I assist you?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "Hello?",
            "timestamp": "3.02.2025 22:39:55"
        },
        {
            "party": "Qilin",
            "content": "Your company's network is attacked and the entire system is encrypted. We have downloaded all the company's confidential data. After payment you will receive.\n1. Decryption tool for all devices\n2. Complete list of files taken from the network.\n3. Proof that all your data has been deleted.\n4. Information about how we got into the network.\n5. Security recommendations to stop future attacks.\n6. Promise that we will not attack you again in the future.\n7. Guarantee that we will forget about this incident.",
            "timestamp": "3.02.2025 22:56:43"
        },
        {
            "party": "Victim",
            "content": "ok, what do we need to do?",
            "timestamp": "4.02.2025 14:38:51"
        },
        {
            "party": "Qilin",
            "content": "We will provide the list of files what we took from you as soon as possible and you can offer 3 names of files from it and we will provide them as a proof of availability. Also you can send 3 encrypted files and we will decrypt them as a proof that our decryption tool really works. But these files must not contain a valuable information.",
            "timestamp": "4.02.2025 15:22:44"
        },
        {
            "party": "Qilin",
            "content": "file tree.txt (0.232 MB)",
            "timestamp": "4.02.2025 21:1:24"
        },
        {
            "party": "Victim",
            "content": "Thank you, I'll review and pick out some files",
            "timestamp": "5.02.2025 13:33:45"
        },
        {
            "party": "Victim",
            "content": "Please provide us with copies of the following files:\n\n- [redacted].xls\n\n- [redacted].pdf\n\n- [redacted].docx",
            "timestamp": "6.02.2025 21:47:33"
        },
        {
            "party": "Qilin",
            "content": "We will do it as soon as possible.",
            "timestamp": "6.02.2025 21:56:52"
        },
        {
            "party": "Qilin",
            "content": "[redacted].docx (0.032 MB)",
            "timestamp": "6.02.2025 23:16:34"
        },
        {
            "party": "Qilin",
            "content": "[redacted].xls (0.039 MB)",
            "timestamp": "6.02.2025 23:17:11"
        },
        {
            "party": "Qilin",
            "content": "[redacted].pdf (0.484 MB)",
            "timestamp": "6.02.2025 23:17:24"
        },
        {
            "party": "Victim",
            "content": "ok, so next I'm suposed to send you encrypted files? How am I supposed to get to those when you've encrypted the server?",
            "timestamp": "7.02.2025 22:41:36"
        },
        {
            "party": "Qilin",
            "content": "In order for you to make sure that we can really help you decrypt all your files and prevent all your information from going online - you can offer us some test files ... and we will decrypt them. After full payment you will get a full activation key to your computers and forget about us forever.",
            "timestamp": "7.02.2025 22:46:12"
        },
        {
            "party": "Victim",
            "content": "ok, I need to get with out team when they're back on Monday to see what we're able to get and send to you",
            "timestamp": "8.02.2025 21:18:21"
        },
        {
            "party": "Qilin",
            "content": "On Monday we are waiting.",
            "timestamp": "8.02.2025 21:34:31"
        },
        {
            "party": "Victim",
            "content": "What kind of files are we allowed to upload? All we've been able to get are some encrypted log files, will that work?",
            "timestamp": "10.02.2025 22:33:30"
        },
        {
            "party": "Qilin",
            "content": "You can select 2-3 random files from the list, and we will upload them to this chat as proof of availability. To prove that we can decrypt your data correctly, you can upload 2-3 encrypted files to our chat, and we will upload the decrypted copies back",
            "timestamp": "10.02.2025 23:55:52"
        },
        {
            "party": "Victim",
            "content": "Please decrypt the following files:",
            "timestamp": "11.02.2025 3:7:3"
        },
        {
            "party": "Victim",
            "content": "[redacted] (0.555 MB)",
            "timestamp": "11.02.2025 3:7:18"
        },
        {
            "party": "Victim",
            "content": "[redacted] (0.238 MB)",
            "timestamp": "11.02.2025 3:7:32"
        },
        {
            "party": "Victim",
            "content": "[redacted] (0.239 MB)",
            "timestamp": "11.02.2025 3:7:43"
        },
        {
            "party": "Qilin",
            "content": "[redacted].log (0.551 MB)",
            "timestamp": "11.02.2025 10:47:46"
        },
        {
            "party": "Qilin",
            "content": "[redacted].log (0.234 MB)",
            "timestamp": "11.02.2025 10:47:53"
        },
        {
            "party": "Qilin",
            "content": "[redacted].log (0.234 MB)",
            "timestamp": "11.02.2025 10:47:57"
        },
        {
            "party": "Victim",
            "content": "Thank you. We are considering your demands, is there any way you could provide a discount to your price?",
            "timestamp": "12.02.2025 14:7:45"
        },
        {
            "party": "Qilin",
            "content": "As a sign of goodwill and quick closing of the deal, we are ready to give a 10% discount and stop at the price of 63,000 dollars. You can pay this amount as we have reviewed your financials. Talk to the management and pay, after payment you will get everything you agreed on.",
            "timestamp": "12.02.2025 14:10:48"
        },
        {
            "party": "Victim",
            "content": "Understood. If we only require either the decryptor or confidentiality, would the cost be adjusted accordingly?",
            "timestamp": "13.02.2025 13:48:56"
        },
        {
            "party": "Qilin",
            "content": "Understand that we don’t have something that requires you to pay separately for something. Any payment includes all our terms and conditions. It depends whether you need decryption or not. Should your data be deleted or not, etc. Everything is included in the complex. Hurry up, there is very little time left.",
            "timestamp": "13.02.2025 13:51:54"
        },
        {
            "party": "Victim",
            "content": "That makes sense. We have some key decision makers that are flying in to discuss your deal. We expect to have an update for you early next week.",
            "timestamp": "14.02.2025 15:16:43"
        },
        {
            "party": "Qilin",
            "content": "As we see that you are interested in making a deal as soon as possible, we do for you an exception and extend the timer till the 19th of February for you to make a decision with your management and inform us about the payment. Please, don't delay with it, otherwise we will return with the tools which are stronger. You must understand that as the timer will expire we will post your files on our blog.",
            "timestamp": "14.02.2025 16:16:45"
        },
        {
            "party": "Victim",
            "content": "Our apologies, we are awaiting a decision from leadership. Can we have one more day to consider your offer?",
            "timestamp": "19.02.2025 17:4:56"
        },
        {
            "party": "Qilin",
            "content": "we extended the timer for 24 hours.",
            "timestamp": "19.02.2025 17:8:38"
        },
        {
            "party": "Qilin",
            "content": "So you just had a meeting about finances. What do you have to offer? We are willing to make an additional discount and accept payment from you today. The price will be 60,000 dollars. That's a very good discount. We're ready to make the deal today and start rebuilding you. It's up to you. Time is running out today.",
            "timestamp": "20.02.2025 18:27:40"
        },
        {
            "party": "Qilin",
            "content": "We see that you are not interested in the security of your patients and choose to play the silent way. Tommorow we will publish a press relise about you on our blog, and in a couple more days all of your data will become public. You still have time to start collaborating and do it without any attention from the press and the public.",
            "timestamp": "26.02.2025 12:58:15"
        },
        {
            "party": "Qilin",
            "content": "http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=[redacted]",
            "timestamp": "26.02.2025 12:59:41"
        }
    ]
}
