{
    "chat_id": "You must pay\n\n$ 250000\n5.51 BTC (+20%) or 603.89 XMR",
    "messages": [
        {
            "party": "Victim",
            "content": "Is this support?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Yes, of course whats ups?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Tomorrow we will publicate your data",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Tomorrow? We just got more information on this because IT didn't \ntell us about this site. We want to learn more about your offering.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Tomorrow, of course , we done attack week ago, you didnt came \nonline, tomorrow we will add local mass media, and attack your \ninfrastructure by IP. thats our plan, on today, because you didnt start \ndialog with us.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We didn't even know what was going on and we were misinformed. We \ncan't pay by tomorrow since we're just learning about this. Can you give\n us more time so that we can handle this appropriately?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Your price is settled up, you are small client for us. Make your \nchoice today - you will be listed, or close question with us.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "In case of close question nobody will now about this issue.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We can't pay $600,000 by tomorrow. We're not sure what we can pay \nbut we will certainly see what is available. Can you show us some data \nthat you have?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Do we have your word that you will not list us tomorrow?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We have full dumped your network by data, of course we can show",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "After payment you will get full file tree of stolen data.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "After payment you will get: decrypt your system (network) file tree \nof data, and i will explain your black holes, (network audit) discount \nwe cant make, sorry. You came too late on dialog, thats your problem.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We will not list your tomorrow, in case of agreement.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Sorry thats our buisness, we are only interested in to take money.",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Okay, that is understood, but can we see anything that you have taken?",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "You are very small client, see your infrastructure, after agreement and payment\n1) we will decrypt instantly your network\n2) if you need - provide file tree , with all taken files\n3) delete data from our servers\n\nSome random files for proof:\nhttps://www.sendspace.com/file/[redacted]\nhttps://www.sendspace.com/delete/[redacted]/c5421cf9271e05e7b323e000d9283ec8\npass: [redacted]\n\nDon`t waste our time, how we don`t wasting your. Rules for all clients same.\n\nThank for understanding",
            "timestamp": "17 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We're not here to waste time. We're sorry for joining late. We'll review and get back to you.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Files where randomizded.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "When will be done payment?? Or We should continue attacks ?",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We are still reviewing the information. We only found out about the \n$600,000 price. Our intention is not to push this to the side, but we \nneed some time to figure out what we can afford. This is the first time \nwe are dealing with this type of issue.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Whats your offer?",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "I know your resources very well, after your offer i will explain you what is what",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We have a meeting set for tomorrow morning to discuss finances. Can we get back to you in the morning?",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "yes price you can see, i dont know about you want to talk, search \nmoney. and we will do things, in other cay we are not interested in \ndialog.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "money money, can help you",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Dont waste your time, as our. Its not our politic how we working, if\n you have money, we can talk ,if you dont have, than we can go by sides.\n we doesnt work like this",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Price you can see in your administration panel.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Yes, but we will get back to you in the morning after the meeting. Is this okay?",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Yes, OK.",
            "timestamp": "16 days  ago,"
        },
        {
            "party": "Victim",
            "content": "As promised, we spoke today and can make an initial offer. It's been\n a tough year for us and we're a tiny company. We hope you can see that.\n Based on a few loans we received, we can pay you $110,000. If this \nprice is not suitable, then we'll need to look at outside sources for \ncash. We're a small shop and don't have access to easy funding.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Then if your business doesnt gaving you profit, you should think about - close business like this.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We can do our best, give you some discount, but not big like you want",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We just need a price we can afford. What type of discount can you give us?",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "10%.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "So $540,000?",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "If that's the case, then we really have a lot of work to do here. We can't take on so much debt considering our size.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Are there any other files you can provide us so that we have more bargaining power with lenders?",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We have already given files and a good discount.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "You're asking 5x more than what we can afford to pay. We're putting \nourselves on the line and potentially in more debt as we speak with \nlenders. We can't take all this on if we don't know what we're paying \nfor. All we need is some help from you.",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Last evidence pack, other requests will be regarded as a waste of our time. \nThe package contains a variety of documents from different directories\n-------\n457 Megabytes \nDownload : https://bashupload.com/JrSuB/[redacted].rar \n\nPassword : FKL59MBY}c?Uox~d$4QCNnVAE0@yOvmC",
            "timestamp": "15 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We're looking. Thanks",
            "timestamp": "14 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We see the data but we can't just print money and pay. We really \nneed a few days to see what other funding options we have. Can we get \nback to you early next week with our options?",
            "timestamp": "13 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "OK.",
            "timestamp": "13 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Thanks",
            "timestamp": "13 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We will have more news for you later today",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Your price is still not possible for us but we do have a better \noffer for you. We have an initial agreement with a funding source and \ncan pay you $200,000. You are asking a lot from a company of our size \nand we are giving you all we can. Please let us know",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Thanks for your offer, last what we can offer - is change price \nright now to 250 000 USD , and you will pay money in 24 hours, other \noffers we don`t have, because time cost money. We are doing very big \ndiscount for you. After payment you will get - full decrypt of your \nsystems, and we will delete all your data from our servers.",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Yes, this is a very big discount indeed. It's still more money than \nwhat we have but we'll get back to you ASAP tomorrow once we review. \nThank you.",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We pleasure your opinion - tomorrow we waiting payment from your \nside. Discount is very big - we never do discounts like this - we work \non mathematical algorithms. As well this discount where decided by team -\n its not agreement by one person. \nWe done our best. We changing price right now, tomorrow we waiting for payment. \n\n\nHave a nice day",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Refresh page, price changed - tomorrow we waiting for money. Good luck",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We held an emergency meeting. The lender was not happy but they are \ndiscussing this and they understand the urgency. We told them that we \nneed to hear from them today but they have to get their own approval \nfirst. Can we reach out to you tomorrow with their decision? We really \ndon't want to let this slip away.",
            "timestamp": "8 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We told, our rules, please guys be serious, situation by your side, \nnot by our. We already get agreement in our team about price witch we \ndone, it`s very good discount we know that in your hands have \npossibility to pay amount of money witch we getting agreement. Price \nwhere settled up, you can start pay by parts, it`s not problem.",
            "timestamp": "8 days  ago,"
        },
        {
            "party": "Victim",
            "content": "We completely understand. We just can't commit to a price until we \nspeak to the lender, because they're in control of the money. They'll \nhave news for us tomorrow.",
            "timestamp": "8 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Alright. The lender agreed! They're going to wire us the money \ntomorrow and our bitcoin broker will be able to pay you early next week.\n Can you confirm what we'll receive from you?",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Your payment currency is XMR (monero) not bitcoins.",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Can you confirm what we will receive from you?",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Yes.\n - Windows decryptor.\n - Deleting data and blog post.\n - Support for 2 days after decryption.",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Okay we will be able to pay monero next week",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "What date?",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Victim",
            "content": "Aiming for the 27th",
            "timestamp": "6 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Ok",
            "timestamp": "6 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "If you don't contact us within the next 24 hours we will publish your data",
            "timestamp": "1 day  ago,"
        }
    ]
}
