{
    "chat_id": "You must pay\n\n$ 10000000\n220.02 BTC (+20%) or 23879.46 XMR",
    "messages": [
        {
            "party": "Darkside",
            "content": "Hello, [redacted]. We downloaded more then 500 GB of sensitive data\n from your network, if you don't pay, we will publish them.\nWe know that you have 3 million cyber insurance police from Response \nLimit, you must contact Beazley Group to take money for payment.\nAlso, we know about your 45 millions credit line. So, please, don't say us that you haven't money or etc.\nShares of your company ([redacted]) are traded on NASDAQ. If you don't contact\n us, we will notify all the biggest mass media about your company hack \nand data leak, what will lead to the fall of the price of your shares.\nAnd you can be sure, we always do that was promised.",
            "timestamp": "12 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Since you ignore us, we prepare the data to publication. \nWe are confident that your company will be a good example for others and create us good advertising.",
            "timestamp": "10 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "We will start publish your data after 6 days 14 hours. \nWe also prepare the list of the press that we will notify about your leakage, we will soon provide you with a list.",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "In the case of payment, we guarantee:\n  - Non-disclosure of information about your hacking.\n  - Providing you windows and linux decryptors.\n  - Help with the recovery your data.",
            "timestamp": "9 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "List of the press who will be sent links to your data after the publication:\n- https://www.forbes.com/tips/\n- https://www.nytimes.com/tips\n- https://www.bloomberg.com/tips/\n- https://www.bleepingcomputer.com/news-tip/\n- https://nypost.com/tips/\n- https://edition.cnn.com/tips/\nWe also found several traders who want to earn on the fall of your shares.\nAre you ready for what will happen after the publication?",
            "timestamp": "7 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "2 days left.",
            "timestamp": "6 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "In 2 days your post will become public, we will notify traders in advance, in 3 days we will publish your data.",
            "timestamp": "6 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "You have the last day to resolve this.\nWe are ready for a dialog, you should write.",
            "timestamp": "5 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Tomorrow we will begin to fulfill all our promises. Good luck.",
            "timestamp": "4 days  ago,"
        },
        {
            "party": "Darkside",
            "content": "Are you ready for a dialog?",
            "timestamp": "1 day  ago,"
        }
    ]
}
