[
    {
        "created_at": "2025-01-16 11:01:03",
        "date": 1737025263,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 109
    },
    {
        "created_at": "2025-01-16 14:28:44",
        "date": 1737037724,
        "content": "~~~ You have been attacked by LockBit 4.0 - the fastest, most stable and immortal ransomware since 2019 ~~~~\nDO NOT WASTE TIME or your sensitive files will be PUBLISHED.\nas you probably already know most of your systems are encrypted and data was stolen.\nwe stole ALL! databases and ALL! management (server\\verwaltung) shares from ALL! servers with sensitive data (total +4TB) on servers that are not encrypted too!\n\nYou can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\n\nTell us filepaths and we will show proof of stolen data.\n\nFor security reasons we do not click on other links you send in chat.\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 109
    },
    {
        "created_at": "2025-01-16 14:35:15",
        "date": 1737038115,
        "content": "We will offer decryption and deletion of all date for 110k$ in btc or 90k$ in xmr. price is suspect to change.\ndo not waste yours and our time.",
        "clientid": 109
    },
    {
        "created_at": "2025-01-21 22:31:14",
        "date": 1737498674,
        "content": "your data was uploaded to the blog. publishing soon.",
        "clientid": 109
    },
    {
        "created_at": "2025-02-03 15:23:42",
        "date": 1738596222,
        "content": "We did not receive any further update from the other chat. Because of this contact we stopped publishing, because of negotiation. So we will restart publishing of files, if you do not respond in the next 24h",
        "clientid": 109
    },
    {
        "created_at": "2025-02-05 17:59:27",
        "date": 1738778367,
        "content": "Why no communication from your side? Not interested in solving this?",
        "clientid": 109
    },
    {
        "created_at": "2025-02-05 18:00:58",
        "date": 1738778458,
        "content": "We would advise you doing this. There are already people that are interested in this data and would pay money for it. Do you need more time?\nIt would be better for you if you would answer us.\nWe want to solve this case too, probably as you too.",
        "clientid": 109
    },
    {
        "created_at": "2025-02-05 18:01:33",
        "date": 1738778493,
        "content": "Do you want proof of stolen data? We will of course send.\nDo you want file list or files?\nJust tell us filenames and we will send.",
        "clientid": 109
    },
    {
        "created_at": "2025-03-26 22:10:25",
        "date": 1743027025,
        "content": "what are you waiting for or why are you revisiting the site if you do not want to communicate with us?",
        "clientid": 109
    }
]