[
    {
        "created_at": "2025-04-09 11:27:24",
        "date": 1744198044,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 245
    },
    {
        "created_at": "2025-04-09 11:31:25",
        "date": 1744198285,
        "content": "Congrats, your business is very professional. \nUnfortunately We got into your radar.\nWhat is your demand?\nRegards, Eva",
        "clientid": 245
    },
    {
        "created_at": "2025-04-09 11:55:04",
        "date": 1744199704,
        "content": "Good day, could you let me know, how to proceed?",
        "clientid": 245
    },
    {
        "created_at": "2025-04-09 23:07:30",
        "date": 1744240050,
        "content": "You must pay the ransom and then we will restore your systems and remove the data stolen from you from our servers.",
        "clientid": 245
    },
    {
        "created_at": "2025-04-10 04:15:46",
        "date": 1744258546,
        "content": "How much is the ransom? I am a small lawyer office, it is only me as a lawyer an 3 employees and I don`t know if I can rase the amount.....",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 04:23:02",
        "date": 1744345382,
        "content": "Why you don`t let me know your expectations?",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 09:01:08",
        "date": 1744362068,
        "content": "50k usd",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 09:03:03",
        "date": 1744362183,
        "content": "The content of the downloaded information: financial documentation: a full archive of financial reports, including detailed accounting statements, tax charges and payment registers for various periods of activity. Bank statements, reports on the movement of funds, documents on credit obligations and financial guarantees are included. Also containing analytical reports on the profitability of projects, estimates for current operations and strategic plans for the distribution of budgets. Data on settlements with counterparties, including advance reports and acts of reconciliation of mutual obligations are presented.\nLegal documents: information on legal documents covering contractual relations with counterparties, including delivery, rental and provision of services. Corporate documents governing the organization’s activities, as well as materials on judicial and pre -trial settlements of disputes are included. Information is also contained in labor contracts, personnel orders and internal regulatory acts.\nJudicial and procedural materials: complete dossier on trials with claims, appeals and court decisions. Expert conclusions, meetings and materials of enforcement proceedings are included. Documents on arbitration disputes, claims and mediative agreements were separately allocated.\nPersonal cases and confidential documentation: an archive of personal files of employees with labor contracts, personnel movements and certification sheets. Medical certificates, social security documents and personal agreements are included.The confidential section contains notarized documents, hereditary cases and materials on the protection of personal data. Personal information of employees and customers includes full data, such as information about medical insurance, the size of monthly and annual wages, as well as current contact details - the address of residence, phone numbers and email. Additionally, the documentation contains copies of personality certificates, information on driver’s license, and numbers of medical insurance for employees and customers.\nTechnical and auxiliary materials: accompanying documentation on current activities, including archival copies of important documents, backups of databases and official correspondence on organizational issues. A separate block is devoted to materials on information security and the protection of commercial secrets.\nThe full archive of correspondence for 2024–2025, including business correspondence with customers and partners. Electronic letters, attached files and materials, internal reports, discussions of contracts, court cases, financial transactions related to the activities of the RECHTSANWALTSKANZLei Mag are included. Eva Holzer-Waisocher.",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 09:03:10",
        "date": 1744362190,
        "content": "http:\/\/temp.sh\/ftZCY\/tree_HOLZER.txt",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 09:03:33",
        "date": 1744362213,
        "content": "If you don't want all this data to become publicly available, then pay the ransom.",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 16:15:35",
        "date": 1744388135,
        "content": "Sorry guys that must be a misunderstandig because 90% of the topics you are pretending which is containing the gathered data isn`t part of the data actually.\nThe  ransome ist more than 20 times the amount which we had to pay for the work needed to reestablish our hardware functional an reload data.\nSo we can only offer a ransom of max USD 3k because in this case we would be operational quicker.\nBR, Eva\n",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 17:22:34",
        "date": 1744392154,
        "content": "Then expect lawsuits from the victims.",
        "clientid": 245
    },
    {
        "created_at": "2025-04-11 17:22:40",
        "date": 1744392160,
        "content": "bye bye",
        "clientid": 245
    },
    {
        "created_at": "2025-04-12 06:36:31",
        "date": 1744439791,
        "content": "Euer Versuch, mich durch erbärmliche Verschlüsselungstricks und leere Drohungen zum Zahlen zu zwingen, ist gescheitert. Eure Ransomware mag Dateien blockieren, doch Angst verbreitet ihr nicht. Während ihr euch hinter Affiliate-Programmen und anonymen Serverfarmen versteckt, haben internationale Behörden eure Infrastruktur bereits zerschlagen – die Kontrolle über eure Erpresser-Webseiten ist längst verloren.\n\nIhr behauptet, unbesiegbar zu sein, doch selbst euer angeblicher «Sprecher» Dmitrij Choroschew steht nun mit einem 10-Millionen-Dollar-Kopfgeld auf der Liste des FBI. Sanktionen machen jede Zahlung an euch zur Straftat, und über 2500 Entschlüsselungsschlüssel liegen bereits in den Händen der Ermittler. Eure «Doppel-Erpressung»? Ein lahmes Manöver, das längst durchschaut ist.\n\nStatt Lösegeld zu kassieren, werdet ihr bald selbst zahlen – mit eurer Freiheit. Jeder Angriff hinterlässt Spuren, und jedes Opfer, das sich weigert, schwächt eure Macht. Ihr seid keine digitalen Dämonen, nur eine Bande von Dieben, die auf die Verzweiflung anderer angewiesen ist. Meine Daten mögen verschlüsselt sein, doch meine Entschlossenheit ist es nicht.\n\nMit verachtungsvoller Gelassenheit,\nDie unbeugsame Eva",
        "clientid": 245
    },
    {
        "created_at": "2025-04-12 19:29:29",
        "date": 1744486169,
        "content": "haha",
        "clientid": 245
    },
    {
        "created_at": "2025-04-13 19:12:39",
        "date": 1744571559,
        "content": "I want to order chickennuggets please ",
        "clientid": 245
    }
]