[
    {
        "created_at": "2025-04-09 08:02:44",
        "date": 1744185764,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 244
    },
    {
        "created_at": "2025-04-09 08:18:33",
        "date": 1744186713,
        "content": "I am writing to you with utter desperation. We are in an impossible situation and cannot afford your ransom demand.\n\nWe live in Iran, where hyperinflation and exchange rates have crippled us.\n\n1 [Your Currency, e.g., BTC\/XMR\/USD] = ~1,000,000,000,000 IRR (a month’s wages for many here).\n\nYour ransom is equivalent to years of our income—we are not a corporation or wealthy individuals.\n\nThese files hold our entire lives: family photos, medical records, university work, and irreplaceable memories.\n\n\n\nDesperately,",
        "clientid": 244
    },
    {
        "created_at": "2025-04-09 13:14:15",
        "date": 1744204455,
        "content": "hi ",
        "clientid": 244
    },
    {
        "created_at": "2025-04-09 13:33:48",
        "date": 1744205628,
        "content": "my File : \nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\/r\/bApxjRwMEd#pJgUnM7EObljT090cBgWZwDrvzBhhCrabscuW1445m0=",
        "clientid": 244
    },
    {
        "created_at": "2025-04-09 13:39:39",
        "date": 1744205979,
        "content": "I'm willing to negotiate, but first I need:\n\n1. **The exact ransom amount** in [BTC\/USD\/IRR] \n2. **Proof of decryption capability** (decrypt 1 unimportant file as sample)\n3. **Payment deadline extension** \n\n**My limitations:**\n\n- The exchange rate destroys me (1 USD = 1,0500,000 IRR)\n\n**Let's find a realistic solution. What's your lowest acceptable amount?**\n\nAwaiting your reply,",
        "clientid": 244
    },
    {
        "created_at": "2025-04-10 00:25:41",
        "date": 1744244741,
        "content": "1. 5 BTC\n2. Wait\n3. 15.10.2025",
        "clientid": 244
    },
    {
        "created_at": "2025-04-10 14:22:36",
        "date": 1744294956,
        "content": "",
        "clientid": 244
    },
    {
        "created_at": "2025-04-11 20:01:31",
        "date": 1744401691,
        "content": "Hello,\nI am writing to you from Iran. Please believe me when I say I am not a wealthy person or part of any rich organization. I don’t have access to international banking systems, and because of global sanctions, I can’t even buy Bitcoin legally in my country.\nThe amount you’re asking is far beyond anything I could ever afford. Our currency has lost almost all its value — people here are struggling just to survive. Paying 5 BTC per server is not just difficult, it’s completely impossible for me. Even saving 0.1 BTC would take years here.\nThis situation has destroyed everything I’ve worked for. I am desperate and broken. Please understand that I’m not your enemy — I’m just a small person in a very hard place, trying to find a way forward.\nIf there is any way you could help, or reduce the amount, or show any mercy, I would be deeply grateful. I am willing to cooperate or discuss any possible solution that is humanly possible for me.\nThank you for reading. I truly hope you will show some mercy.",
        "clientid": 244
    },
    {
        "created_at": "2025-04-12 19:30:44",
        "date": 1744486244,
        "content": "We can give you a discount, but you will have to find the money, otherwise we will not reach an agreement.",
        "clientid": 244
    },
    {
        "created_at": "2025-04-14 05:29:13",
        "date": 1744608553,
        "content": "I want to be completely honest with you: I don’t have access to any international banking systems. I don’t have a foreign account, and I can’t legally buy cryptocurrency like Bitcoin in my country. I live in Iran, and we are under heavy sanctions. Our currency — the Toman — has lost almost all its value. Even earning just a small amount of BTC is a nearly impossible task here.\n\nI’m not a business owner with income in dollars or euros. I’m just an individual who has lost everything — 20 servers gone. What you’re asking for is simply beyond my means, even with a discount. If there was a way to pay in Toman, I could try to gather something, but I know it may not be useful to you.\n\nPlease, I am desperate. I’m not trying to avoid responsibility — I just need a chance to recover even part of what I’ve lost. If you can reduce the amount to something that someone like me could possibly afford, I will do everything I can to make it happen.\n\nThis is my last hope. I’m asking not as a company or target — just as a human being.",
        "clientid": 244
    },
    {
        "created_at": "2025-04-14 18:33:22",
        "date": 1744655602,
        "content": "Then I won't be able to help you in any way.",
        "clientid": 244
    }
]