[
    {
        "created_at": "2025-04-01 14:55:18",
        "date": 1743519318,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 14:58:50",
        "date": 1743519530,
        "content": "What are the next steps to unencrypt our data?",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 17:09:28",
        "date": 1743527368,
        "content": "Hello. Please wait, we will answer you soon",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 17:14:27",
        "date": 1743527667,
        "content": "Hello, Physician's Medical Billing Inc\n\nYour network was penetrated, servers were completely encrypted with our special algorithm, and also we has downloaded sensitive Data from your file servers. In case if you won't cooperate with us, then everything would be published and\/or sold.\nWe also found a lot of contact information of your employees, clients, partners, etc. In case of your refusal to cooperate, we will try to convey information about the leak of your data to each of these contacts.\n\nWe offer you to make a deal and resolve this issue smoothly, all encrypted files will be restored, you will avoid Data Leaks and we will provide you a proofs of deleting all your data from our server. The total weight of the files we have is approximately ~850 gigabytes.\nPrice for all these services is $400,000 USD, it should be paid in cryptocurrency equivalent.\n- To prove that our Decryption tool works properly we can decrypt few random files for FREE, just send them to us\n- As a proof of data possession we can provide a partial file-tree of downloaded data (usually about 5-7% of total volume)\n\nYou should also know that the files that were downloaded from you were carefully selected. These are not random files, but the most important ones in our opinion.",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 17:40:36",
        "date": 1743529236,
        "content": "$400,00 is unaffordable, as we are a small independently owned business.  Due to post covid business challenges, the most that is affordable is $5000, for a full recovery.  Otherwise, I may be looking at bankruptcy.  Please accept this offer. ",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 19:21:00",
        "date": 1743535260,
        "content": "This is absolutely unacceptable. Sometimes we give some discounts in case of loyal cooperation and fast negotiations. But this is definitely not a 90%+ discount. In your case, we have nothing more to offer you.",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 20:47:13",
        "date": 1743540433,
        "content": "I have reached out to family members for money help, but we are not a cash rich people.  The most I can raise is $20,000. total.  Can you please accept this offer?!",
        "clientid": 238
    },
    {
        "created_at": "2025-04-01 21:43:34",
        "date": 1743543814,
        "content": "What family members? What are you talking about? We know all the necessary information about your company. And the money we asked you for is not very large for your company. If you, the one who contacted you, are an ordinary employee, then we should not continue the conversation, you need to urgently contact the management.\nTo answer your question: your offer is not even close to the real values. The price we asked for is not a joke. This is an absolutely real offer.\n\nPlease contact us when you are ready for real negotiations, and not this kindergarten.",
        "clientid": 238
    }
]