[
    {
        "created_at": "2025-04-16 07:03:26",
        "date": 1744787006,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 07:08:29",
        "date": 1744787309,
        "content": "Hello,\n\nWe’ve received your message and understand that you’re approaching this situation seriously.\nIt looks like you’ve put effort into what you’ve done and expect this to be treated accordingly.\nIn order for us to understand the situation and evaluate our options, we’ll need more information.\nCould you please explain what exactly you expect from us? What do you see as the next step?\nWe’d like to avoid unnecessary misunderstandings and are looking for a way to address this constructively.\n\nLooking forward to your reply.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 13:05:03",
        "date": 1744808703,
        "content": "You pay money, after which we will restore all your systems and delete the information stolen from you.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 17:07:59",
        "date": 1744823279,
        "content": "We understand that you're offering to restore access and delete the stolen data after payment.\nCan you help us understand how this process works from your side? What exactly was taken?\nIt seems like you’ve done this before and know how important trust is in a situation like this.\nWe’re trying to fully understand the scope of the incident and your expectations so we can decide how to proceed.\nLooking forward to your clarification.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 18:52:49",
        "date": 1744829569,
        "content": "http:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\/r\/zUK6yZ09zp#mjKOlmgoc+OLLDwum\/fFQQTFc2y2rWWz5LH5j43AYCA=",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 18:52:57",
        "date": 1744829577,
        "content": "tree of stolen data",
        "clientid": 255
    },
    {
        "created_at": "2025-04-16 18:54:36",
        "date": 1744829676,
        "content": "If you refuse to pay the ransom, we will make the data from this list publicly available and you will not be able to restore your systems. To restore your systems and remove this data, please pay.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-18 07:33:00",
        "date": 1744961580,
        "content": "We’ve reviewed the data you shared, and from our perspective, it seems to be mostly general in nature, nothing extremely sensitive or business critical.\nThat said, we understand this is a serious matter for you, and we know there’s always concern on your side that we might not pay. But the truth is, we still don’t even know what the payment would be.\nCan you please clarify the amount you’re asking for, and what exactly the payment would cover?\nWe’re trying to understand everything clearly so we can make an informed decision.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-18 08:31:16",
        "date": 1744965076,
        "content": "0.7 btc",
        "clientid": 255
    },
    {
        "created_at": "2025-04-20 15:52:33",
        "date": 1745164353,
        "content": "time for publication and delete decryptor?",
        "clientid": 255
    },
    {
        "created_at": "2025-04-28 09:29:38",
        "date": 1745832578,
        "content": "Thank you for sharing the details.\n\nWe understand that you expect to be compensated for your efforts, and we respect the work you’ve done.\nHowever, the amount you’re asking for is extremely difficult for us to manage, especially under the current circumstances.\nIs there any way we could work together to find a figure that would be more realistic for us, while still respecting the effort you’ve made?\nWe are trying to find a solution that minimizes losses on both sides.",
        "clientid": 255
    },
    {
        "created_at": "2025-04-28 16:13:44",
        "date": 1745856824,
        "content": "We named the optimal amount in this case. We are trying for you, asking you for a real amount to pay. I can pass your suggestions to my boss, maybe he will give you a small discount.",
        "clientid": 255
    }
]