[
    {
        "created_at": "2025-04-19 06:37:36",
        "date": 1745044656,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 09:03:29",
        "date": 1745053409,
        "content": "",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 09:11:11",
        "date": 1745053871,
        "content": "Hello, we sent you encrypted files. Please decrypt and tell us what we have to do to get all our data back",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 10:51:53",
        "date": 1745059913,
        "content": "hello, wait",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 14:21:29",
        "date": 1745072489,
        "content": " do you have any information for us? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 14:54:27",
        "date": 1745074467,
        "content": "yes",
        "clientid": 263
    },
    {
        "created_at": "2025-04-19 20:28:21",
        "date": 1745094501,
        "content": "We attacked the following list of companies through your network: \nwww.extragent.ch\nwww.bachmann-rimensberger.ch\nwww.kmpag.ch\nwww.gms-technik.com\nwww.storosol.ch\nwww.gammacard.ch\nwww.bp-ing.ch\nwww.kopitsis.com\nwww.kopp-metallveredlung.ch\nwww.innofact-suisse.ch\nwww.baku.ch\nwww.najid.ch\nwww.zahnarztpraxismutschellen.ch\nwww.summit-treuhand.ch\nwww.zhsh.metaltecsuisse.ch\nwww.profrose.ch\nwww.bau-recht.ch\nwww.kfc-suisse.ch\nwww.promrisk.ch\nwww.lanz-partner.ch\nwww.ledtex.ch\nwww.maadan.ch\nwww.marketagent-schweiz.ch\nwww.n-protec.com\nIn addition to crypto systems, we downloaded 2 TB of data.\nIf you want to solve the problem, then pay the ransom.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 00:41:33",
        "date": 1745109693,
        "content": "",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 00:44:10",
        "date": 1745109850,
        "content": "This file (zabbix_agent2.log.old.5984de3d3b75) has a different ID, please find another note and enter the chat",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 06:40:28",
        "date": 1745131228,
        "content": "how much is the ransom ?\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 07:14:00",
        "date": 1745133240,
        "content": "and can you provide a list of file names that were stolen? we would also have to inform our customers",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 07:53:22",
        "date": 1745135602,
        "content": "",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 07:53:22",
        "date": 1745135602,
        "content": "Everything is ok, the second file is decrypted",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 10:03:05",
        "date": 1745143385,
        "content": "the second file is corrupt at the end or is it not ? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 10:24:07",
        "date": 1745144647,
        "content": "Please send more files for testing, the corrupted ones are excluded",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 10:25:46",
        "date": 1745144746,
        "content": "We will do, its not so easy to find small files\nhow much is the ransom, we would please like to know",
        "clientid": 263
    },
    {
        "created_at": "2025-04-20 11:21:53",
        "date": 1745148113,
        "content": "At the moment, our team of lawyers is studying your financial documentation, today we are not ready to name the price for you.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 06:12:56",
        "date": 1745302376,
        "content": "good morning\ndo you have an update for us? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 09:30:07",
        "date": 1745314207,
        "content": "wait",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 11:17:24",
        "date": 1745320644,
        "content": "2kk usd",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 11:47:42",
        "date": 1745322462,
        "content": "is that 2 million USD or 200.000 USD? \n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 13:55:18",
        "date": 1745330118,
        "content": "we would like to have a list of the extracted files if thats possible - we would need some solid proof for 2 mio USD",
        "clientid": 263
    },
    {
        "created_at": "2025-04-22 16:46:40",
        "date": 1745340400,
        "content": "http:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\/r\/dMyCJVQVKD#ehUDCgKJtapTNv9t3Vrvqqxy49cbOISjJFE8T6BF9Vo=",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 06:19:08",
        "date": 1745389148,
        "content": "just to clarfiy for us since we have to discuss this with the 24 companies that are impacted, there is just 1 decryptor and we can't do it company by company, right ? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 11:57:01",
        "date": 1745409421,
        "content": "yes",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:35:07",
        "date": 1745411707,
        "content": "yeah well we discussed it with the companies and just very few want to pay, if we put the money together what they individually are ready to pay we are at about 200.000 USD. Are there any possible other ways? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:39:35",
        "date": 1745411975,
        "content": "Are you sure you want to lose your reputation? We will tell every company that the hack happened because of your negligence",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:40:16",
        "date": 1745412016,
        "content": "we are a small hosting company, it is now in our decision to pay this, you must know this ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:42:34",
        "date": 1745412154,
        "content": "What do you think will happen to your company if we publish all the data on each company?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:43:07",
        "date": 1745412187,
        "content": "how do you think we could pay 2 million USD when we are just a small company? we could not even if we would like to ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:43:47",
        "date": 1745412227,
        "content": "You can collect this money from your clients' companies.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:44:48",
        "date": 1745412288,
        "content": "thats what we asked them but they don't want to pay, all the companies who want to pay can put 200.000 USD together, the big ones had offline backups and do not want to pay anything ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:45:32",
        "date": 1745412332,
        "content": "Explain what will happen if their data is published.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:49:32",
        "date": 1745412572,
        "content": "they know, we communicated with all of them but we can't make them pay since only 20% of the companies want to pay something\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 12:52:07",
        "date": 1745412727,
        "content": "how does this normally work when you hack 20 companies and half of them does not want to pay? can we say \"this 5 companies paid and don't make their data public\"?\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 13:00:06",
        "date": 1745413206,
        "content": "Then you won't get a decryptor. For $200,000 we can just forget about these companies and not list them",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 13:02:15",
        "date": 1745413335,
        "content": "yeah the small companies need the decryptor and thats what they would pay the 200.000 USD for\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 13:02:49",
        "date": 1745413369,
        "content": "We can't do it like that. Everyone has to pay.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 13:03:03",
        "date": 1745413383,
        "content": "Because either everyone or no one will get the decryptor",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 15:15:54",
        "date": 1745421354,
        "content": "yeah can you give us the decryptor for 200.000 USD? they can't pay more really\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 17:21:46",
        "date": 1745428906,
        "content": "or how much would be just the decryptor? \n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-23 20:01:46",
        "date": 1745438506,
        "content": "2 million USD",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 09:16:41",
        "date": 1745486201,
        "content": "we are having another round with the customers today, if we have some new information we will inform you",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 11:02:38",
        "date": 1745492558,
        "content": "I want increase price x2 in 48 hours if you not pay",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 15:41:33",
        "date": 1745509293,
        "content": "we have to coordinate more than 20 customers and we would ask you to please be patient, we do what we can to get a deal ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 15:42:40",
        "date": 1745509360,
        "content": "So far you are only trying to lower the price, and not solve the problem.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 15:51:07",
        "date": 1745509867,
        "content": "we try to raise more money with all the customers and will tell you what we have as soon as possible\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 15:52:05",
        "date": 1745509925,
        "content": "Listen to what I'm going to tell you now, and this is only a small part of what we realized when we studied the stolen information.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-24 15:56:27",
        "date": 1745510187,
        "content": "Analytics department report:\n\nWe would like to note that among the information that was stolen from the servers, there is a lot of important data, the publication of which will cause great harm to the company, from the servers from which it was stolen.\n* This is personal data of employees and clients, for the disclosure of which there is a certain liability. These are copies of passports, IDs, resumes, statements, invoices, correspondence, as well as exported passwords and logins. Leakage of such data is a direct violation of the legislation on the protection of personal data.\n* Legal documents of companies, including financial statements, strategic documents, corporate forms, approvals and internal regulations. All of this can be used by competitors and cause legal consequences.\n* Corporate correspondence that reflects the company's internal processes, discussions, corporate plans, project implementation problems, complaints and reactions to them. All of this reveals the \"inner workings\" of the company and can be used against it.\n* Files with calculations and costings that reveal pricing, margin structure, and commercial strategies of the company. Leakage can undermine tender positions, lead to dumping, and loss of competitive advantage.\n* Commercial offers and agreements that disclose the terms of contracts with major clients, partners and contractors. If published, it may be used by competitors and may also entail legal and business liability.\n* Design and engineering calculations: disclosure of technologies, technical solutions, non-standard methods and materials. This may lead to the loss of know-how and a threat to patent security.\n* Correspondence with clients and contractors, letters, discussions of working conditions, negotiations. Disclosure of such data may compromise trust, violate confidentiality and cause reputational damage.\n* Intellectual property: templates, standards, methods, typical calculations, engineering concepts, documentation on specialized solutions. This is the basis of competitiveness, and its leakage can cause serious damage.\n* Architectural and construction plans of objects: detailed drawings, room plans, facades, assembly units. Particularly critical for healthcare facilities, educational institutions and government infrastructure. Leakage of this data is a direct threat to security.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 10:06:24",
        "date": 1745575584,
        "content": "is it possible if we pay from different bitcoin wallets? we are trying to consolidate the money, but as you know it is complicated with that many companies ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 10:17:34",
        "date": 1745576254,
        "content": "as of now, we have about 1.281.000 swiss franks collected which is roughly 1.540.000 USD, would you be able to settle on this if we can transform that money into BTC?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 10:55:13",
        "date": 1745578513,
        "content": "You can transfer this money to your wallet and we will give you time to collect the remaining money.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 10:57:15",
        "date": 1745578635,
        "content": "we started the onboarding process with the bank and the customers will transfer the money as soon as possible, it should be there on monday \/ tuesday and we can then buy the BTC and pay, thank you for your patience so far",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:00:23",
        "date": 1745578823,
        "content": "Give me the exact date and time when the payment will be made, otherwise my boss will make a fundamental decision and increase the amount to 4 million.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:03:39",
        "date": 1745579019,
        "content": "we do now know since we do not know how long it takes for all companies to transfer the money to the BTC bank but it should be within next week\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:04:16",
        "date": 1745579056,
        "content": "Wouldn't it be easier for you to collect all the money in your account and buy bitcoin yourself?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:07:15",
        "date": 1745579235,
        "content": "the process is that we buy the BTC with a neutral bank to have the trust between all the customers also",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:08:28",
        "date": 1745579308,
        "content": "its not so easy to buy that amount of BTC without raising money laundering alarms in switzerland\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:09:50",
        "date": 1745579390,
        "content": "Okay, do you guarantee to pay the $2 million by the end of next week?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 11:12:54",
        "date": 1745579574,
        "content": "we cannot guarantee to raise the whole 2 million since the companies for now raised 1.54 million and it is not our money. If they can raise the other half million we will transfer the money on their behalf as soon as its in the wallet and yes, we hope that this will be within the end of next week. if you can lower the price a bit - to probably 1.6 or 1.7 million they would probably be able to pay by tuesday or wednesday, that is what we can offer for now. We will have more information on monday and tuesday when the money trickles in",
        "clientid": 263
    },
    {
        "created_at": "2025-04-25 12:14:11",
        "date": 1745583251,
        "content": "Then we expect the first transaction of $1.5 million by Tuesday inclusive.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:10:12",
        "date": 1745921412,
        "content": "time for publication and delete decryptor?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:19:08",
        "date": 1745921948,
        "content": "Hello. We have some information for you, but we need to wait for confirmation at around 15:30 by all the affected customers. Please stand by",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:20:02",
        "date": 1745922002,
        "content": "Confirmation of what?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:21:48",
        "date": 1745922108,
        "content": "that we can pay the amount you asked for till the end of the week as you asked for \n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:22:16",
        "date": 1745922136,
        "content": "You must pay the first installment today.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:24:04",
        "date": 1745922244,
        "content": "we don't have the BTC now, yesterday was a bank holiday in switzerland and on thursday is another bank holiday in switzerland, but we can pay the requested amount on friday as you asked for it",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:24:50",
        "date": 1745922290,
        "content": "We need the first transfer today. You can start buying bitcoin now and then you will have time for everything.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:32:55",
        "date": 1745922775,
        "content": "as said, we have a lot of customers in the background and this takes time .. the affected companies came to the agreement to transfer the 2 million USD on friday - as you requested,  we don't have any other chance to get that amount of BTC so please confirm the deal - friday 2 million USD in exchange for:  \n-deletion of files\n-decryptor from your side\n-you won't attack any of the impacted companies again \n\nplease also ask your boss if this is ok, since we need the definitive confirmation and since thursday is a banking holiday we can't get them sooner and we will transfer the whole amount at once on friday",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:36:23",
        "date": 1745922983,
        "content": "we will also send 2 more pdf files for you to decrypt since the decryption didn't work with the other provided files, please decrypt them for confirmation",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:37:28",
        "date": 1745923048,
        "content": "",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:39:51",
        "date": 1745923191,
        "content": "Okay, we confirm everything, but we need an advance. Otherwise, my boss will increase the ransom amount. He is a man of principle, I cannot negotiate with him myself.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:41:43",
        "date": 1745923303,
        "content": "we cannot send BTC now since we buy them in bulk with a bank, so there is nothing we can send in advance. The amount of 2 million USD can be confirmed and friday can also be confirmed, we stand by our word and we hope you do so too. Please give the deal to your bosses so we can confirm everything and close this. the whole amount will be transferred on friday if the decryption of the PDFs work ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:42:55",
        "date": 1745923375,
        "content": "21.1 BTC all amount",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:43:48",
        "date": 1745923428,
        "content": "yes",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:44:07",
        "date": 1745923447,
        "content": "ok, wait test decrypt",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:44:40",
        "date": 1745923480,
        "content": "I'll ask my boss to give you a chance to pay on Friday. I can't promise anything yet.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 10:48:58",
        "date": 1745923738,
        "content": "we have public bank holidays with monday and thursday in switzerland, we have 20 companies where you all used the same encryption key which complicated things a lot for us and we have 2 million usd which we can transfer in BTC on friday, we think this is a good deal and we hope your boss does the same",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 11:07:12",
        "date": 1745924832,
        "content": "Do you guarantee payment on Friday?",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 11:07:33",
        "date": 1745924853,
        "content": "yes, we will transfer the BTC on friday\n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 11:46:43",
        "date": 1745927203,
        "content": "",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:36:02",
        "date": 1745930162,
        "content": "we just got the confirmation from one company that the decryption was working, so thank you for that",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:40:22",
        "date": 1745930422,
        "content": "the only thing missing is now the confirmation that the 2 million usd on friday is the final deal\nif the swift transactions are faster and we have the BTC before friday, will we be able to close the deal before ? will this channel be monitored? ",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:45:39",
        "date": 1745930739,
        "content": "Yes, the amount in Bitcoin indicated above is final. The sooner you close the deal, the better.",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:47:48",
        "date": 1745930868,
        "content": "ok, so the deal is final, 2 million usd latest on friday, 2nd May 2025? please confirm \n",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:50:34",
        "date": 1745931034,
        "content": "yes",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 12:51:33",
        "date": 1745931093,
        "content": "we will forward that information to our customers and inform you when we are ready to transfer the money",
        "clientid": 263
    },
    {
        "created_at": "2025-04-29 13:09:16",
        "date": 1745932156,
        "content": "We have agreed. We are waiting for your payment. Now I will send two wallets and the amounts that need to be sent to them.",
        "clientid": 263
    }
]