[
    {
        "created_at": "2024-12-23 10:56:21",
        "date": 1734951381,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 10:57:33",
        "date": 1734951453,
        "content": "hello sir, can you help me what you need to decrypt my files?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 10:58:55",
        "date": 1734951535,
        "content": "7 DAYS MINI ROLLS UNCOVERED CONDENCED MILK 20gr OPP2.pdf.usKv553SJ this is a sample file",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 11:31:23",
        "date": 1734953483,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\n\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 12:28:50",
        "date": 1734956930,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 13:10:53",
        "date": 1734959453,
        "content": "could you please how much it will cost to recover my files because we need to know the costs involved.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 14:50:20",
        "date": 1734965420,
        "content": "wait, tech support will send your test files",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 14:51:56",
        "date": 1734965516,
        "content": "price decrypt 80k in bitcoin, for all hosts and files",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 15:47:11",
        "date": 1734968831,
        "content": "sir this amount is very high to be paid. We would like to work with you because it will take much time to recover our infrastructure. So some questions from our side \n1. Can you please provide a generous discount so it's easier for us to consider your solution?\n2. How fast the recovery process will take if we work with you ?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:08:06",
        "date": 1734970086,
        "content": "we can't offer you a discount",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:12:12",
        "date": 1734970332,
        "content": "if you pay quickly and restore the infostructure on the same day",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:14:28",
        "date": 1734970468,
        "content": "I saw your financial report, our price is not big for you",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:16:24",
        "date": 1734970584,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:38:16",
        "date": 1734971896,
        "content": "Thank you for the file.\nIt's been a very hard year for our company, also as you know we are in Greece and since 2010 it's been very tough times for businesses. And the end of the year is always very hard financially with cashflows.\n\nThat's why i am asking for your understanding in price, so I can make an easier decision for my manager to decide.\nPlease if you can convince your own management to consider a generous discount it will help us in our decision with positive result. \nFrom our side we want our files faster and without loses than the options we have now. \nIt seems that you can provide this service from the proof you sent.\nIt would be nice if we can find an agreement on a price we can pay so we can pay you.\nRight now the amount you said is far beyond our real financial capability so we cannot consider this an option.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 16:46:36",
        "date": 1734972396,
        "content": "ok, we can do a 20% discount",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:14:17",
        "date": 1734974057,
        "content": "First of all thank you for your understanding and the discount you provided. \nI appreciate your help on this. \nBut still we are very far away from what we can really pay. \nStill the amount you mentioned after the discount is very hard to find in cash.\nWe need to take some serious IT decisions tomorrow as most consultants advised us to format and start from latest offline files which will take several days.\nSo please if you can give us a more grounded financial proposal do so since the purpose here is to see if we can use your services.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:19:57",
        "date": 1734974397,
        "content": "I don't care whether you pay me or not, there will be no more talk about discounts",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:25:20",
        "date": 1734974720,
        "content": "If you don't make a decision, the price will be 2x tomorrow.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:29:26",
        "date": 1734974966,
        "content": "Please don't misunderstand the interest to find a way to pay you with insult. This was not my point. I respect you are talking with us right now and understanding our side. I just want to make it work for our company based on our limitations in cashflow in the end of the year. I know that you don't care about us. You attacked us after all. I understand that it's just business for you. Some pay, some don't. We want us to both benefit from this incident. We gain knowledge and you gain money. But we wanted to get an amount that we can be able to pay you realistically. We are not here to play either. Unfortunately if your purpose is to raise the price there is no point of discussing any more. Even if we find the correct amount we can pay, we will need at least 7 working days to pay you. Regulations are hard with this kind of transactions.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:35:39",
        "date": 1734975339,
        "content": "the price will be 60k your decision to pay or not.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:56:21",
        "date": 1734976581,
        "content": "Is there a way to recover 2-3 computers with 15k and get a partial service from your side?  So we can see the quality of your service that is valid and then during next year purchase some more bundle of computers? I am just exploring options here to help our operations based on our cashflows.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-23 17:58:44",
        "date": 1734976724,
        "content": "no, the decryptor will be available for all your files with the extension",
        "clientid": 36
    },
    {
        "created_at": "2024-12-24 16:32:59",
        "date": 1735057979,
        "content": "Hello sir, could you please accept the price of 30000$ before the end of the year so we can catch up with the processes to pay you in full for the full service you provide? It will take a lot of effort for us to return to normality so we can see this as a successful penetration test from your team and justify the expenses we need to pay to your work. Mention we need some days to manage to pay this huge amount of money so we need your understanding on this.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-24 18:04:24",
        "date": 1735063464,
        "content": "you can pay 50k, but the offer will be available for a some days\nif you can't pay on the weekend, I'll refund price.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-24 21:03:25",
        "date": 1735074205,
        "content": "Please stay with me on this. Even if we find a way to work together, the amount is too big to find it these days. Last two years it's been very hard for us and it's the end of the year. We are trying to find whatever resources are available in cash and let you know. In the following two days we will have a better picture on our financials. We need at least 6-7 days to find 30k, we will need more to get more money to you. There is very limited cashflow in the end of the year which makes things very hard. Let me see what we can do and get back to you. I will try my best, because we want this to finish soon. There is big spending in the end of the year and limited cash receivable. Need more time to see what we can do for you.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 10:16:45",
        "date": 1735294605,
        "content": "hello sir, can you please let us know how we can do the payment?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 12:54:26",
        "date": 1735304066,
        "content": "hello, btc wallet: 1PKzZhK35fvszaHBdyAwHTRtEoJwjR1ocD",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:08:42",
        "date": 1735304922,
        "content": "We managed to gather this amount you requested. It's been very hard. \n\nPlease let us know if you accept the following.\nWhen we pay 50.000$ USD to this wallet 1PKzZhK35fvszaHBdyAwHTRtEoJwjR1ocD you will keep your promise to:\n1. Give us a tool to decrypt all our files in ESXi and all computers affected and we will decrypt today\n2. Provide technical support from your side in case something doesn't work\n3. Promise you will never attack us in the future\n4. Help us understand how we can prevent such incidents again in the future and explain how you managed to get in our infrastructure along with technical details.\n\nWhen we have your replies and confirmation for the above we proceed in the payment.",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:18:22",
        "date": 1735305502,
        "content": "1. there will be no problems with the decryptor,for esxi and all windows files\n2. you will need to disable your av and just run the .exe decryptor\n3. it could be someone else\n4. you know your pass P@ssw0rd",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:20:28",
        "date": 1735305628,
        "content": "if we pay in the next hour when we will get decryptor?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:24:37",
        "date": 1735305877,
        "content": "i make a request to tech support, it can take from an hour to five hours",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:26:16",
        "date": 1735305976,
        "content": "shall we sent 10$ just you to confirm and then send the rest 49990 ?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:27:13",
        "date": 1735306033,
        "content": "ok",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:31:24",
        "date": 1735306284,
        "content": "https:\/\/mempool.space\/tx\/afa41038f76e6616814e5c4d4bc7a4907d15d41dac5bf782af42dc2fbbc5c11f can you confirm you received this ?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 13:34:48",
        "date": 1735306488,
        "content": "yes 0.00010389",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:12:01",
        "date": 1735308721,
        "content": "bitcoin seller sais you got the money. Please confirm\nhttps:\/\/mempool.space\/tx\/c3137291d4c673e21f282e346338568f26f7b7c3558c82392bca6d31c66166b2",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:19:47",
        "date": 1735309187,
        "content": "is ok, thank you",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:24:03",
        "date": 1735309443,
        "content": "wait pls, tech support will drop decryptor here",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:24:15",
        "date": 1735309455,
        "content": "ok",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:27:31",
        "date": 1735309651,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:32:37",
        "date": 1735309957,
        "content": "this is not decryptor ",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 14:37:36",
        "date": 1735310256,
        "content": "yes, decryptor  we wait",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 15:49:34",
        "date": 1735314574,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 15:55:19",
        "date": 1735314919,
        "content": "What about esxi ?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 15:55:52",
        "date": 1735314952,
        "content": "Give me readme file from esxi",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 15:57:26",
        "date": 1735315046,
        "content": "ok give me 5 minutes",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:18:02",
        "date": 1735316282,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:30:50",
        "date": 1735317050,
        "content": "the VMDK files cannot be decrypter with the .exe decryptor. could you please send decryptor for VMDK in ESxi based on the txt file i sent you 15 minutes ago ?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:31:33",
        "date": 1735317093,
        "content": "yes",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:31:38",
        "date": 1735317098,
        "content": "wait 5 minutes",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:36:55",
        "date": 1735317415,
        "content": "",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:40:14",
        "date": 1735317614,
        "content": "is there a way to decrypt VMDK files on windows? i have a copy of them and the windows decryptor doesn't work with them",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:40:31",
        "date": 1735317631,
        "content": "only linux",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:42:05",
        "date": 1735317725,
        "content": "please provide command line instructions to run linux",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:55:40",
        "date": 1735318540,
        "content": "1. Could you please tell me which commands to run on ESXi step by step in order to decrypt all files?\n2. Is there a chance that something goes wrong when i execute this decrypt_ESXI_X64 command on ESXi? Do i lose all the VMDK files in the server?",
        "clientid": 36
    },
    {
        "created_at": "2024-12-27 16:56:52",
        "date": 1735318612,
        "content": "Procedure for decrypting ESXi:\n- log in to vCenter\n- enable ssh access to ESXi\n- upload decryptor to ESXi via WinSCP or FileZilla; navigate to \/tmp folder\n- login to ssh with root privileges\n- set permissions to run the decryptor with the command - chmod 777 decrypt\n- launch decryptor .\/decrypt\n- follow the first method of decrypting by viewing the log file: tail -f \/tmp\/decrypt.llg, wait for the message at the end of the log - Your system is decrypted\n- the second way is to check the presence on the disk file decrypt.pid command ls, which protects the decryptor from the restart\n- the third way - ps | grep decrypt, as soon as decrypt.pid will be removed from the disk, or decrypt will disappear from the running processes, decrypt is complete\n- check the decrypt.llg log file and see the message at the end that the system was successfully decrypted  \"Your system is decrypted\"\n- turn on virtual machines in ESXi\n\nYou cannot run multiple copies of a decryptor at the same time. After launching, the decryptor deletes the executable file and is demonetized, so that you cannot run the decryptor again and damage the files, this is normal.\n\nIf you have more than one ESXi host then you should not run the decryptor on all hosts simultaneously, make the decryption alternately, in the case of simultaneous operation of two decryptors may corrupt files and not be able to decrypt\n\nIf any files in another folder stay crypted, please use this command with path\nExample:\n.\/decrypt -i \/tmp\/files1\/",
        "clientid": 36
    }
]