[
    {
        "created_at": "2025-01-24 16:37:40",
        "date": 1737736660,
        "content": "You can attach a few files for test decryption by packing them into an archive with zip, rar, tar, 7zip, 7z, tar.gz extensions of no more than 10 megabytes using the attach button directly in the chat.\r\n\r\nIf your archive weighs more than 10 megabytes, please use our file sharing service.\r\nhttp:\/\/lockbitfss2w7co3ij6am6wox4xcurtgwukunx3yubcoe5cbxiqakxqd.onion\r\nhttp:\/\/lockbitfsvf75glg226he5inkfgtuoakt4vgfhd7nfgghx5kwz5zo3ad.onion\r\nhttp:\/\/lockbitfskq2fxclyfrop5yizyxpzu65w7pphsgthawcyb4gd27x62id.onion\r\nFor security reasons we do not click on other links you send in chat.\r\nPlease wait for a reply, sometimes it takes several hours due to possible time zone differences.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:37:51",
        "date": 1737736671,
        "content": "hi",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:38:46",
        "date": 1737736726,
        "content": "hi, I'm here",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:38:48",
        "date": 1737736728,
        "content": "The previous public chat has been blocked. Now we can communicate with you privately.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:39:42",
        "date": 1737736782,
        "content": "We know about the TOX conversation and that you have already agreed to a price of $50,000.\n\nWhen will you be ready to pay? How much time do you need?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:41:17",
        "date": 1737736877,
        "content": "50,000 is really difficult for me. What is the lowest price you can give me?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:45:03",
        "date": 1737737103,
        "content": "So in the last chat you agreed to the amount of 40,000 dollars.\n\nWe do not agree with this price.\nBut we agree to give you a discount of 5,000 dollars, and the final price will be 45,000 dollars, but on one condition: that you make the payment within 24 hours.\nDo you agree?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 16:49:31",
        "date": 1737737371,
        "content": "I can get 30,000 today. The 40,000 would be for Monday. Also, in a few hours the banks close until Monday. I don't think I can make any payment in 24 hours.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:01:20",
        "date": 1737738080,
        "content": "We offer you the following options:\n\nMain Option:\nThe main payment is due on Tuesday. Find an additional $5,000 to bring the total payment to $45,000.\n\nWe are willing to offer you an alternate option:\nIf you make a $5,000 deposit today, we will give you a $5,000 discount and you can pay the balance of $35,000 on Monday or Tuesday.\n\nWhich option do you choose?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:13:10",
        "date": 1737738790,
        "content": "Ok I would accept the second option. Today I could transfer the 5000, I need the instructions. On the other hand, I would appreciate it if you could send me some other file, of your choice, so that I know that I am not spending the money uselessly.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:22:55",
        "date": 1737739375,
        "content": "Now prepare the money for payment, so that you are ready to make a prepayment quickly.\n\nIn the next tens of minutes we will send you a bitcoin wallet address for payment, and you will be able to make a payment as soon as you are ready.\n\nIn the next few hours we will send you a PARTIAL file tree, from which you can choose any file, and we will send you the original file, or its screenshots if the file is too important in our opinion (happens rarely). We will try to do all this as soon as possible.\n\nYou can make a prepayment after we send you the original file, but the main thing is that the prepayment must be made today.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:24:17",
        "date": 1737739457,
        "content": "We always focus on the time zone UTC+0, so you have approximately 6.5 hours.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:33:02",
        "date": 1737739982,
        "content": "Perfect. I'm getting everything ready. I'm waiting for the address.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:55:12",
        "date": 1737741312,
        "content": "This is bitcoin wallet address for payment:\nbc1q6tqarpua79kwqr0u6np9ac4faqv5hz96rhl92v",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 17:56:15",
        "date": 1737741375,
        "content": "We are currently preparing a partial file tree for you. This will take some time.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 18:41:30",
        "date": 1737744090,
        "content": "Good",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 19:17:23",
        "date": 1737746243,
        "content": "",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 19:17:45",
        "date": 1737746265,
        "content": "Please select a file and we will send you the original file.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 19:30:44",
        "date": 1737747044,
        "content": ".\\Datos\\MCasella\\PC\\NICATEL\\EMPLEADOS\\SUELDOS\\PLANILLA ARCHIVO SANTANDER\\11.2024\\Planilla adelantos Santander 11.2024.txt",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 19:32:03",
        "date": 1737747123,
        "content": "Please, could you also confirm that you have the original .mfd files and show me their names?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:19:13",
        "date": 1737749953,
        "content": "",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:20:20",
        "date": 1737750020,
        "content": "Perhaps you are not talking about \"mfd\" files, but about \"mdf\" database files?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:24:32",
        "date": 1737750272,
        "content": "All the files we downloaded from you are in perfect order, and they are whole and functioning.\nWe sent you a list of files, a partial file tree, which contains about 5% of all the files we downloaded. The full file tree + full logs of deleting these files from our servers you can get only after payment.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:46:57",
        "date": 1737751617,
        "content": "Yes, sorry I mean MDF",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:52:32",
        "date": 1737751952,
        "content": "I see that these files are not in the partial file tree. They may be in the general list, but you will be able to see it only after payment. In any case, if these files are there, they are in perfect order. But you should not worry about this, because after payment you will also receive the decryption keys for the files, and you will be able to decrypt your files if they are encrypted and do not function for now.\n\nWhen will you make the payment? We have fulfilled the conditions on our side. You have about 3 hours left.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 20:55:42",
        "date": 1737752142,
        "content": "Well, we trust you.\nPayment will be made today. We are working on it.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 21:45:43",
        "date": 1737755143,
        "content": "Ok, we are waiting.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 21:50:54",
        "date": 1737755454,
        "content": "Ok, I'm waiting for the dollar transaction to the wallet",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 22:08:59",
        "date": 1737756539,
        "content": "ok",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 22:45:13",
        "date": 1737758713,
        "content": "Done",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 22:46:24",
        "date": 1737758784,
        "content": "you need the id?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 23:00:37",
        "date": 1737759637,
        "content": "Everything is fine. We have received your advance payment. We will wait for the rest of the money from you, Monday or Tuesday. $35,000.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 23:01:22",
        "date": 1737759682,
        "content": "thanks",
        "clientid": 124
    },
    {
        "created_at": "2025-01-24 23:01:49",
        "date": 1737759709,
        "content": "After full payment, you will be able to receive a full tree of files (only upon your request), full logs of deletion of all files from our servers, as well as decryption keys.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 14:32:28",
        "date": 1738074748,
        "content": "Hello. We are expecting payment from you today, right?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 14:50:16",
        "date": 1738075816,
        "content": "Good morning. Yes, I am waiting for the last loan I requested to be credited. I estimate that it will be resolved in 1 hour.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 18:07:49",
        "date": 1738087669,
        "content": "Good afternoon. The bank tells me that the process has been accepted but the accreditation may take a while. In the meantime, I can transfer what I already have, which is 27,000.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 19:27:59",
        "date": 1738092479,
        "content": "Hi, I already have the total. Should I send the 35,000 to the same wallet?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 20:10:03",
        "date": 1738095003,
        "content": "Hello! Please wait, we will answer you soon",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 21:14:19",
        "date": 1738098859,
        "content": "Yes, that's right, you can send money to the same wallet.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 21:37:13",
        "date": 1738100233,
        "content": "Payment has already been sent, it is pending",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 21:52:40",
        "date": 1738101160,
        "content": "The order was processed\n",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 22:17:50",
        "date": 1738102670,
        "content": "We confirm receipt of funds. We will soon give you the decryption keys for the files, in this chat. We are also ready to begin the process of deleting all your files and creating deletion logs for you. Please let us know if you need a full file tree before we begin the process of deleting files. You will also see all these files in the deletion logs.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 22:29:10",
        "date": 1738103350,
        "content": "Ok, I need the MDF files with the decryption key.\nI have to be away for a few minutes. How long will it take you?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 22:30:07",
        "date": 1738103407,
        "content": "It may not be fast, it is already late today. It may be tomorrow. I cannot give a time frame yet.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-28 22:31:56",
        "date": 1738103516,
        "content": "Ok, I'll be back in an hour too. If you have the key for later that would be great.\n",
        "clientid": 124
    },
    {
        "created_at": "2025-01-29 03:36:20",
        "date": 1738121780,
        "content": "",
        "clientid": 124
    },
    {
        "created_at": "2025-01-29 03:36:27",
        "date": 1738121787,
        "content": "",
        "clientid": 124
    },
    {
        "created_at": "2025-01-29 04:59:01",
        "date": 1738126741,
        "content": "Thank you, what is the procedure?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-29 21:02:03",
        "date": 1738184523,
        "content": "The deletion process is in progress. Once completed, we will give you full logs of deleting all your files. Regarding the file decryption keys, have you figured it out yet?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-30 02:05:24",
        "date": 1738202724,
        "content": "Yes, perfect. Thank you. I was able to recover the most important things. Could you give me some recommendations so that this doesn't happen again?",
        "clientid": 124
    },
    {
        "created_at": "2025-01-30 13:11:25",
        "date": 1738242685,
        "content": "Yes, of course, we will prepare it for you.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-30 16:35:25",
        "date": 1738254925,
        "content": "Thank you. \nIs there any way I can download the MDF files you have without encryption? The system provider tells me that they may be corrupted. Thank you.",
        "clientid": 124
    },
    {
        "created_at": "2025-01-30 21:45:25",
        "date": 1738273525,
        "content": "I not understand you",
        "clientid": 124
    },
    {
        "created_at": "2025-01-31 02:44:13",
        "date": 1738291453,
        "content": "We checked the file tree, unfortunately there are no mdf files among them. But our encryption does not damage files, check everything carefully.",
        "clientid": 124
    },
    {
        "created_at": "2025-02-03 19:49:02",
        "date": 1738612142,
        "content": "Hello\nYour deletion files log:",
        "clientid": 124
    },
    {
        "created_at": "2025-02-03 19:49:08",
        "date": 1738612148,
        "content": "",
        "clientid": 124
    },
    {
        "created_at": "2025-02-04 13:17:36",
        "date": 1738675056,
        "content": "Some tips to improve the security of your servers: First of all, to improve security, you need to change all Windows account passwords without exception. You need to change them to long and complex passwords. Secondly, you need to install antivirus software on all servers without exception (Kaspersky, Sophos, Bitdefender or other reliable antivirus software). You also need to more carefully monitor activity on the corporate network, look for unnecessary activity on the network (track traffic) and not run third-party software on machines without antivirus software.",
        "clientid": 124
    }
]