{
    "chat_id": "20221011",
    "messages": [
        {
            "party": "Victim",
            "content": "Hello,\n\nAs per the file tree structure you have provided us, we would like the 3-files listed below to be decrypted (in their original format) and provided back to us as confirmation.\n\nBelow are the 3 files that we require in a decrypted format as confirmation.\n\n1. Summons_Complaint_From_[redacted].pdf\n\n2. 3450_Disbursement_Invoice_[redacted].csv.done\n\n3. 15-01-12 MED MAL CASES FROM [redacted].docx",
            "timestamp": "20:15"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].zip",
            "timestamp": "21:08"
        },
        {
            "party": "Victim",
            "content": "We are a small business, we have been hit hard due to the economic downturn, and the pandemic.\n\nWe can only afford to pay you $77,500 USD; this is all we have at the moment.\n \nWe just don’t have that kind of money you are asking from us.\n \nWe would like to settle soon, let's come to an agreement.",
            "timestamp": "01:14"
        },
        {
            "party": "Black Basta",
            "content": "This is too small and not at all interesting to me. If we move so slowly, we will come to the publication of your data and the destruction of your small business. Make me a worthy offer.",
            "timestamp": "03:41"
        },
        {
            "party": "Victim",
            "content": "As mentioned, we only have $77,500 USD. \n\nWe are actively working with our banker to secure a loan to pay you. \n\nAfter speaking to senior management and our banker, we can secure an additional $47,500 USD.\n\nWe are able to offer you $125,000 USD. \n\nHow can we make payment? Please provide us with instructions so we can move forward quickly.",
            "timestamp": "17:55"
        },
        {
            "party": "Black Basta",
            "content": "This offer is better. We also can step towards you and lower the price by 100,000. Now your price is 500,000.",
            "timestamp": "17:57"
        },
        {
            "party": "Black Basta",
            "content": "We are always ready to give some discount to an adequate people.",
            "timestamp": "18:06"
        },
        {
            "party": "Victim",
            "content": "We are moving as quickly as we can and you mentioned a 20% discount earlier which is $480,000 USD. \n\nAfter speaking with our banker and senior management, we can pay $125,000. \n\nWe are moving as fast as possible but we cannot afford to pay you the $480,000 USD that you are asking for. \n\nWe can offer you $125,000 in exchange for the decryption key, proof of deletion and a security report, and we can work on a payment if you provide us with instructions.",
            "timestamp": "22:28"
        },
        {
            "party": "Black Basta",
            "content": "I will repeat once again that this amount does not suit us and 20% discount we give you if you pay ASAP. You took a step and we made the discount $100k, this is significant. Now we are waiting for the best offer from you to satisfy the both sides and close the deal.",
            "timestamp": "05:55"
        },
        {
            "party": "Victim",
            "content": "We have spoken with senior management and our banker and can secure a total of $175,000 USD in exchange for the decryption key, proof of deletion and a security report.  \n\nAs I mentioned before, we are a small business and have been hit hard by the economic downturn and the pandemic, but were able to secure loans for this amount.  \n\nToday is a holiday but we are able to pay these funds quickly.  We can start working on payment if you provide us with instructions.",
            "timestamp": "17:16"
        },
        {
            "party": "Black Basta",
            "content": "This offer is better. However, as I said before - this is a thoroughly calculated price that includes a full list of services we mentioned before, security audit and a decryptor. \nWe have examined your data and documentation and have no reasons to set the price higher than you can pay. If you can pay 175,000 within the holidays, I think you'll easily find 450,000.",
            "timestamp": "17:22"
        },
        {
            "party": "Victim",
            "content": "Yes, we are doing our best to ensure we can settle fast in exchange for our decryption keys, proof of deletion and security report.  \n\n \n\nWe were able to secure $175,000 USD to pay you.\n\n \n\nMy boss has agreed to contribute the cash from his personal account $41,250 USD.\n\n \n\nThis will total to $216,250 USD.\n\n \n\nLet’s make this work for all of us and we can start working on payment.\n\n \n\nPlease send me payment details so we can make payment as this is all new to us.",
            "timestamp": "21:42"
        },
        {
            "party": "Black Basta",
            "content": "Yes, we see your steps forward and go to meet you. But our services and your data are more expensive, like your reputation. Stories of diseases of your customers, mental state, etc. - their most deep secrets. Their disclosure will bring many problems of your company. But we understand your situation and therefore make you an additional discount. Our price is $400к.",
            "timestamp": "22:15"
        },
        {
            "party": "Victim",
            "content": "We are working with our banker and arranging personal contributions from individuals within the business.\n \nMy boss and his partners have all contributed additional funds from their personal accounts.\n \nYou need to understand that we are a small business and we do not have that kind of money to pay you.\n \nLet’s move forward and settle for $239,125 USD.\n \nWe will require more time to secure a payment. We will need an extension on the timer.\n \nI am waiting for payment instructions, let’s move quickly.",
            "timestamp": "18:25"
        },
        {
            "party": "Black Basta",
            "content": "We give you a last discount. Now your price is 350,000",
            "timestamp": "19:51"
        },
        {
            "party": "Black Basta",
            "content": "We won't lower the price further. It is almost 50% discount.",
            "timestamp": "19:51"
        },
        {
            "party": "Black Basta",
            "content": "Hi, any news?\nTimer is going, so please don't lose the time!",
            "timestamp": "17:34"
        },
        {
            "party": "Victim",
            "content": "A 50% discount, approximately $300,000 USD is very helpful.\n \nMy boss and his partners are able to contribute funds to the above offer and settle for $285,125 USD.\n\n\nThis is the maximum loan; we are able to secure the bank and funds from our personal account.\n \nAlso note that we are entering into a weekend, banks are closed. We will require more time to secure this amount and transfer funds to you.\n \nWe will need an extension on the timer.\n \nIf you agree to settle for $285,125 USD, please also confirm that you will provide us with a decryptor to unlock all systems and you will delete all files of your servers and provide a receipt of deletion?\n \nI am waiting for payment instructions, let’s move quickly.",
            "timestamp": "19:13"
        },
        {
            "party": "Black Basta",
            "content": "We agree on 300,000 USD. 50% discount. \nWe know that banks are closed on the weekend, so prolong a timer till Tuesday.\nBTC Wallet: [redacted]\n\nAlso we confirm that after the payment you will receive a decryptor to unlock all systems and we will delete all files from our servers and provide a receipt of deletion.",
            "timestamp": "19:28"
        },
        {
            "party": "Victim",
            "content": "My boss and his partners have agreed to pay $300,000 USD.\n \nMonday morning, we will be reaching out to our bank to establish our loan and get the funds. Please note these things take time and we are moving as quickly as possible.\n \nYou have provided us with what seems to be a Bitcoin Wallet Address, is this correct?\n \nWe are not familiar with how Bitcoin works and how to acquire bitcoins for the amount you are asking.\n \nAre you able to provide any instruction on what is the best way for us to purchase bitcoins?\n \nWe are doing some research on which exchanges to use, do you have any recommendations?",
            "timestamp": "00:09"
        },
        {
            "party": "Black Basta",
            "content": "Yes, we have provided the wallet address above. You can buy bitcoin on any crypto exchange, binance (https://www.binance.com) or coinbase (https://www.coinbase.com), or contact a broker in your country.",
            "timestamp": "03:37"
        },
        {
            "party": "Victim",
            "content": "Not sure if you got my last message.",
            "timestamp": "04:41"
        },
        {
            "party": "Victim",
            "content": "My boss and his partners have agreed to pay $300,000 USD.\nMonday morning, we will be reaching out to our bank to establish our loan and get the funds. Please note these things take time and we are moving as quickly as possible.\nYou have provided us with what seems to be a Bitcoin Wallet Address, is this correct?\nWe are not familiar with how Bitcoin works and how to acquire bitcoins for the amount you are asking.\nAre you able to provide any instruction on what is the best way for us to purchase bitcoins?\nWe are doing some research on which exchanges to use, do you have any recommendations?",
            "timestamp": "04:41"
        },
        {
            "party": "Victim",
            "content": "We are looking into binance.com and coinbase.",
            "timestamp": "04:42"
        },
        {
            "party": "Black Basta",
            "content": "You are right. Please use google to check exchanges available in your location. It is a bitcoin address. Inform us when the payment will be sent.",
            "timestamp": "05:49"
        },
        {
            "party": "Black Basta",
            "content": "Hi, any success?",
            "timestamp": "12:29"
        },
        {
            "party": "Black Basta",
            "content": "We confirm the test payment 0.00005000 BTC",
            "timestamp": "17:15"
        },
        {
            "party": "Black Basta",
            "content": "Test amount received",
            "timestamp": "17:23"
        },
        {
            "party": "Victim",
            "content": "Hi, I wanted to confirm if you have received test payment. https://www.blockchain.com/btc/tx/[redacted]",
            "timestamp": "23:14"
        },
        {
            "party": "Victim",
            "content": "0.00005000 BTC (This seems correct) ?",
            "timestamp": "23:14"
        },
        {
            "party": "Black Basta",
            "content": "Yes",
            "timestamp": "03:13"
        },
        {
            "party": "Black Basta",
            "content": "Sir, 1,5 hours left. What about the main part of the payment?",
            "timestamp": "21:25"
        },
        {
            "party": "Victim",
            "content": "We are preparing to transfer the payment to your wallet. Please give us more time.",
            "timestamp": "21:49"
        },
        {
            "party": "Victim",
            "content": "We are new to this so please be patience with us.",
            "timestamp": "21:49"
        },
        {
            "party": "Victim",
            "content": "Also, after receiving payment how fast would you make the decryptors for download? Also we will need a receipt of complete data deletion.",
            "timestamp": "21:51"
        },
        {
            "party": "Black Basta",
            "content": "You will receive the decryptor and manual within an hour after the payment. You will receive the log of removing your data later, as it will take some time. Also we will extend the timer for you for 24 hours.",
            "timestamp": "21:58"
        },
        {
            "party": "Victim",
            "content": "Payment has been made in full. Please confirm receipt?",
            "timestamp": "23:01"
        },
        {
            "party": "Victim",
            "content": "https://www.blockchain.com/btc/tx/[redacted]",
            "timestamp": "23:01"
        },
        {
            "party": "Victim",
            "content": "https://www.blockchain.com/btc/tx/[redacted]",
            "timestamp": "23:01"
        },
        {
            "party": "Black Basta",
            "content": "We confirm the payment!",
            "timestamp": "03:14"
        },
        {
            "party": "Black Basta",
            "content": "Your blog was deleted.",
            "timestamp": "03:14"
        },
        {
            "party": "Black Basta",
            "content": "Now your data is wiping. The decrypt tool you will get very soon.",
            "timestamp": "03:15"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].linux",
            "timestamp": "06:28"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].ex",
            "timestamp": "06:28"
        },
        {
            "party": "Black Basta",
            "content": "How to decrypt linux?\n1. Drop executable via ftp/sftp/wget to any folder.\n2. Add rights to the new file: chmod +x ./decrypt_executable\n3. Just run it: nohup ./decrypt_executable > log.txt & \n4. Wait until you see smth like \"Done\" in file \"log.txt\".\n\nHow to decrypt windows?\n1. Drop executable to any folder.\n2. Start new terminal session with administrator rights. (run cmd.exe or powershell.exe with admin rights)\n3.1. In cmd.exe type full path to the executable file and press Enter.\n3.2. In powershell.exe type: \"& c:\\full\\path\\to\\executable.exe\" without quotes and press Enter.\n\nOR\n\n1. Drop file.\n2. Click right mouse button on the file and press run as admin.\n\n\n(!) IMPORTANT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n1. DO NOT CLOSE decryptor yourself, DO NOT INTERRUPT!\n2. Yoy can decrypt only 1 folder (test decrypt for example)\ndecrypt.exe -forcepath c:\\users\\1\\Desktop\\folder",
            "timestamp": "06:29"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].zip",
            "timestamp": "06:49"
        },
        {
            "party": "Black Basta",
            "content": "This is log of deletion all your taken data. Now we have nothing.",
            "timestamp": "06:50"
        },
        {
            "party": "Black Basta",
            "content": "Security report and recommendation:\nYour network has been compromised by mailing of messages to the emails with malicious attachments. \nOne of the users launched malware.\nTo avoid this in the future, give you recommendations of network protection: \n1. Use sandbox to analyze the contents of letters and their attachments.\n2. Use the password security policies  \n3. Make protection from attack like a Pass-the-Hash  and Pass-the-ticket attack\n4. Update all OS and software to the latest versions, especially Microsoft Defender Antivirus. \n5. Implement the hardware firewalls with filtering policies, modern DLP and IDS, SIEM systems.\n6. Block kerberoasting attacks \n7. Conduct full penetrations tests and audit \n8. Use and update Anti-virus/anti-malware and malicious traffic detection software \n9. Configure group policies, disable the default administrators accounts, create new accounts. \n10. Backups. You must have offline backups, does not have access to the network.",
            "timestamp": "06:50"
        },
        {
            "party": "Victim",
            "content": "Thank you. I will follow the instructions and get back to you if we have any questions.",
            "timestamp": "15:55"
        },
        {
            "party": "Black Basta",
            "content": "Sure, we are in touch!",
            "timestamp": "15:55"
        }
    ]
}