{
    "chat_id": "",
    "messages": [
        {
            "party": "Black Basta",
            "content": "okay",
            "timestamp": "19:17"
        },
        {
            "party": "Victim",
            "content": "you have 110GB of our data? what data is it?",
            "timestamp": "14:58"
        },
        {
            "party": "Black Basta",
            "content": "Wait please, we'll send you the list of your taken data.",
            "timestamp": "15:49"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].rar",
            "timestamp": "16:01"
        },
        {
            "party": "Black Basta",
            "content": "You can choose any 5 file names from this list and we will send them to you, like a proof.",
            "timestamp": "16:02"
        },
        {
            "party": "Victim",
            "content": "ok thank you we will take a look",
            "timestamp": "14:04"
        },
        {
            "party": "Black Basta",
            "content": "okay",
            "timestamp": "14:05"
        },
        {
            "party": "Victim",
            "content": "does this list represent all of the data you took?",
            "timestamp": "15:00"
        },
        {
            "party": "Black Basta",
            "content": "Yes, this is full list.",
            "timestamp": "15:08"
        },
        {
            "party": "Victim",
            "content": "Here are the files that leadership has requested: Paperless\\EMAILS 2020-2022\\[redacted].msg\nVol4\\[redacted].docx\nVol4\\[redacted].pdf\nVol4\\[redacted].pdf\nVol4\\USER\\[redacted].doc",
            "timestamp": "14:14"
        },
        {
            "party": "Black Basta",
            "content": "Wait please.",
            "timestamp": "14:15"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].rar",
            "timestamp": "14:27"
        },
        {
            "party": "Black Basta",
            "content": "These are requested files.",
            "timestamp": "14:27"
        },
        {
            "party": "Victim",
            "content": "Ok.  We are having internet issues.  Everyone is working from different locations.  I will give these to leadership to review.  No one will be back until Monday.  I will write you then",
            "timestamp": "13:41"
        },
        {
            "party": "Black Basta",
            "content": "Understood. Wait you on Monday.",
            "timestamp": "13:43"
        },
        {
            "party": "Victim",
            "content": "How do we know that your decryptor will work for our systems?",
            "timestamp": "13:18"
        },
        {
            "party": "Black Basta",
            "content": "You can send some encrypted files, we decrypt them and send back to you. But these files must be unimportant.",
            "timestamp": "14:14"
        },
        {
            "party": "Victim",
            "content": "Ok, I will have leadership choose some files.",
            "timestamp": "16:37"
        },
        {
            "party": "Black Basta",
            "content": "okay",
            "timestamp": "16:53"
        },
        {
            "party": "Victim",
            "content": "Download file: [redacted].jpg",
            "timestamp": "14:17"
        },
        {
            "party": "Victim",
            "content": "Download file: [redacted].doc",
            "timestamp": "14:17"
        },
        {
            "party": "Victim",
            "content": "Here are two files that leadership chose.",
            "timestamp": "14:18"
        },
        {
            "party": "Black Basta",
            "content": "Wait please.",
            "timestamp": "14:21"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].jpg",
            "timestamp": "14:31"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].doc",
            "timestamp": "14:31"
        },
        {
            "party": "Victim",
            "content": "Ok, I will show these to leadership and will be back in touch with you",
            "timestamp": "14:55"
        },
        {
            "party": "Black Basta",
            "content": "We'll in touch.",
            "timestamp": "14:56"
        },
        {
            "party": "Victim",
            "content": "My leadership has a meeting scheduled with the board on Monday afternoon.  Before that meeting, is there any cost breaks that you could provide us?  This event has had a significant impact on our company.",
            "timestamp": "13:46"
        },
        {
            "party": "Black Basta",
            "content": "10% discount for you and we close the deal.",
            "timestamp": "15:09"
        },
        {
            "party": "Victim",
            "content": "Ok, I will provide this to my leaders and I will be back in touch on Monday afternoon.",
            "timestamp": "13:53"
        },
        {
            "party": "Black Basta",
            "content": "Okay, we'll be in touch.",
            "timestamp": "15:39"
        },
        {
            "party": "Victim",
            "content": "Our leadership wants this to come to an end for both of us so we can get back to normality.  They would like to offer $39,250 with all fees included.  This would include the decryptor with any assistance we may need with it, proof that all our data has been removed from your systems and deleted with the promise not to ask for any additional money for anything after payment is received, a detailed explanation on how you got into our systems, and the promise to never attack us again.  Please accept this offer so we can move on.",
            "timestamp": "20:33"
        },
        {
            "party": "Black Basta",
            "content": "Are you seriously? This is an unacceptable offer. We will not even turn our heads in your direction for such a meager amount. Increase it.",
            "timestamp": "20:36"
        },
        {
            "party": "Black Basta",
            "content": "We also want to remind you that you have a lot of critical data, a lot of personal data of your employees and customers, copies of passports and driver's license ([redacted], [redacted], [redacted], [redacted], [redacted] and many others), their SSN, DOB, addresses and phone numbers, your NDA, confidential agreements, financial documents and other documents can be used for bad purposes, loans, etc. Darknet users know how to do this. Therefore, we suggest you to think better and make the worthy offer.",
            "timestamp": "16:36"
        },
        {
            "party": "Victim",
            "content": "What is meager to you, is not to us.  Since this event we are struggling to get operational and have experienced tremendous losses.  Leadership is prepared to offer $44,990 with all fees included.  This would include the decryptor with any assistance we may need with it, proof that all our data has been removed from your systems and deleted with the promise not to ask for any additional money for anything after payment is received, a detailed explanation on how you got into our systems, and the promise to never attack us again.  Please consider this offer as we are trying to get our business back operational.",
            "timestamp": "17:18"
        },
        {
            "party": "Black Basta",
            "content": "We are ready to help restore all your systems and files to their original state very quickly, but the minimum amount we can accept is $150k. Less payment is not possible. Therefore, tell your manager if he wants to make a deal, then he look for this amount. If not, then further negotiations are pointless.",
            "timestamp": "17:43"
        },
        {
            "party": "Victim",
            "content": "Leadership is prepared to accept your offer of $150,000 with all fees included.  This would include a working decryptor with any assistance we may need with it, proof and assurance that all our data has been removed from your systems, deleted, not copied or transferred elsewhere, and with the promise not to ask for any additional money for anything after payment is received, a detailed explanation of why we were targeted and how you got into our systems, and the promise to never attack us again.  Please send us your bitcoin wallet ID so we can proceed with payment.",
            "timestamp": "13:27"
        },
        {
            "party": "Black Basta",
            "content": "Okay. We confirm all points. Our BTC wallet is [redacted]",
            "timestamp": "14:06"
        },
        {
            "party": "Victim",
            "content": "Ok. This may take some time, but please confirm when you receive payment.  I will write you when it is sent.",
            "timestamp": "18:49"
        },
        {
            "party": "Black Basta",
            "content": "Okay.",
            "timestamp": "19:04"
        },
        {
            "party": "Black Basta",
            "content": "Any updates?",
            "timestamp": "16:58"
        },
        {
            "party": "Victim",
            "content": "payment was made.  Can you confirm please",
            "timestamp": "18:51"
        },
        {
            "party": "Black Basta",
            "content": "Yes, we see the transaction, but it hasn't been confirmed yet. Please wait.",
            "timestamp": "18:54"
        },
        {
            "party": "Black Basta",
            "content": "Payment received.",
            "timestamp": "19:06"
        },
        {
            "party": "Black Basta",
            "content": "Your data is wiping.",
            "timestamp": "19:06"
        },
        {
            "party": "Victim",
            "content": "Thank you.  I will stand by for all the agreed upon deliverables.",
            "timestamp": "19:07"
        },
        {
            "party": "Black Basta",
            "content": "This is log of deletion ALL your taken data\nDownload: https://qaz.im/load/[redacted]\nDelete: https://qaz.im/index.php?a=delete&q=[redacted]",
            "timestamp": "19:40"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].ex",
            "timestamp": "23:44"
        },
        {
            "party": "Black Basta",
            "content": "How to decrypt windows?\n1. Drop executable to any folder.\n2. Start new terminal session with administrator rights. (run cmd.exe or powershell.exe with admin rights)\n3.1. In cmd.exe type full path to the executable file and press Enter.\n3.2. In powershell.exe type: \"& c:\\full\\path\\to\\executable.exe\" without quotes and press Enter.\n\nOR\n\n1. Drop file.\n2. Click right mouse button on the file and press run as admin.\n\n\n(!) IMPORTANT, READ ALL BEFORE DECRYPTION PROCESS\n1. Yoy can decrypt only 1 folder (test decrypt for example)\ndecrypt.exe -forcepath c:\\users\\1\\Desktop\\folder\n2. DO NOT CLOSE decryptor yourself\n3. MAKE BACKUPS of important files what you will decrypt, then you can rerun decryptor if something happens\n4. You can decrypt partially encrypted files:\n4.1. Make backup\n4.2. Add encrypted extension (random for every company, you can ask in chat) to file\n4.3. Run decryptor to folder what contains file\n4.4. Now you can test file\n5. Every decryption process saves file in same location with name of decrypted file with extension .kbckp. In this file you can find individual chacha keys for better recovery experience.\n6. You can ask in chat about ECC keys (used to encrypt chacha keys) for your company.\n7. Make sure you have at least 10 gb of free space on each disk.\n8. To choose folder on linux decrypt.linux -forcepath /path",
            "timestamp": "23:44"
        },
        {
            "party": "Black Basta",
            "content": "Security report and recommendation:\nYour network has been compromised by mailing of messages to the emails with malicious attachments. \nOne of the users launched malware.\nTo avoid this in the future, give you recommendations of network protection: \n1. Use sandbox to analyze the contents of letters and their attachments.\n2. Use the password security policies  \n3. Make protection from attack like a Pass-the-Hash  and Pass-the-ticket attack\n4. Update all OS and software to the latest versions, especially Microsoft Defender Antivirus. \n5. Implement the hardware firewalls with filtering policies, modern DLP and IDS, SIEM systems.\n6. Block kerberoasting attacks \n7. Conduct full penetrations tests and audit \n8. Use and update Anti-virus/anti-malware and malicious traffic detection software \n9. Configure group policies, disable the default administrators accounts, create new accounts. \n10. Backups. You must have offline backups, does not have access to the network.",
            "timestamp": "03:02"
        }
    ]
}