{
    "chat_id": "20240814",
    "messages": [
        {
            "party": "Black Basta",
            "content": "Do you need a private chat?",
            "timestamp": "12:34"
        },
        {
            "party": "Black Basta",
            "content": "This chat can include people from your company (your employees, for example), as they may have found the note on their computers. In order to avoid leaking our conversation, we can create a private chat for you. Do you need it?",
            "timestamp": "12:35"
        },
        {
            "party": "Victim",
            "content": "where would this private chat be and what is wrong with talking here? What is this about and did you take our data?",
            "timestamp": "12:40"
        },
        {
            "party": "Black Basta",
            "content": "We are Black Basta Group. We are here to inform that your company local network has been hacked and encrypted. We've downloaded over 540GB of a sensitive information and data from your network.  \nCheck your page in our blog.  Right now we're keeping it secret. However, if we don't come to an agreement within 10 days, it'll be posted on our news board.\nWe will let everyone who wants to connect to your network and get all the necessary data from your. \nDecryption price is $2,750,000.  In case of successful negotiations we guarantee you will get:\n\n1) Decryptor for all your Windows and Hyper-V machines;\n2) Non recoverable removal of all downloaded data from our side;\n3) Security report on how you were hacked to fix your vulnerabilities and avoid such situations in future.\n\nHope you can correctly assess the risks for your company.\nYou can find more information about Black Basta Group in Google.",
            "timestamp": "12:58"
        },
        {
            "party": "Black Basta",
            "content": "https://temp.sh/[redacted].txt\nThis is full list of your taken data.",
            "timestamp": "12:58"
        },
        {
            "party": "Black Basta",
            "content": "You can choose from this list any 3-5 file names and I will send them to you as a proof. But files should not contain important information.",
            "timestamp": "12:58"
        },
        {
            "party": "Victim",
            "content": "Thank you for providing the list. My leadership and IT team are currently reviewing it. It is a large list and it will take some time.",
            "timestamp": "11:56"
        },
        {
            "party": "Black Basta",
            "content": "Okay, we'll be in touch.",
            "timestamp": "13:50"
        },
        {
            "party": "Victim",
            "content": "Just making you aware it is a holiday here. When my team selects the file names we will send them.",
            "timestamp": "12:41"
        },
        {
            "party": "Black Basta",
            "content": "okay, we are in touch.",
            "timestamp": "15:06"
        },
        {
            "party": "Victim",
            "content": "Thank you for your patience.",
            "timestamp": "13:45"
        },
        {
            "party": "Victim",
            "content": "[redacted].pdf // [redacted].docx \\\\  [redacted].csv // [redacted].xlsx // [redacted].tif",
            "timestamp": "11:51"
        },
        {
            "party": "Victim",
            "content": "Here are some file names.",
            "timestamp": "11:51"
        },
        {
            "party": "Black Basta",
            "content": "https://temp.sh/[redacted].rar",
            "timestamp": "18:05"
        },
        {
            "party": "Black Basta",
            "content": "Your requested files.",
            "timestamp": "18:05"
        },
        {
            "party": "Victim",
            "content": "Thank you for providing those. I will have my IT and Leadership team look over these.",
            "timestamp": "12:09"
        },
        {
            "party": "Black Basta",
            "content": "Okay, we'll be in touch.",
            "timestamp": "14:52"
        },
        {
            "party": "Victim",
            "content": "Understood. No one is in the office today since it is Sunday. We will reach back out to you on Monday.",
            "timestamp": "14:39"
        },
        {
            "party": "Black Basta",
            "content": "ok, we are in touch.",
            "timestamp": "17:13"
        },
        {
            "party": "Victim",
            "content": "We have reviewed the files. How does your decryption process work? Do you send us one decryptor that restores all our systems or do you send decryptors for each system affected?",
            "timestamp": "11:44"
        },
        {
            "party": "Black Basta",
            "content": "I can restore all your systems and data in to the original state. We can easily check it. You send me 3 encrypted files, I decrypt them and send you back to you. But these files should not contain important information.",
            "timestamp": "16:58"
        },
        {
            "party": "Black Basta",
            "content": "After payment you receive one decryptor that restores all your systems.",
            "timestamp": "17:01"
        },
        {
            "party": "Victim",
            "content": "Thank you for the information. We will work on getting some files to send you. How long will it take us to restore once we receive your tools?",
            "timestamp": "12:38"
        },
        {
            "party": "Black Basta",
            "content": "Recovery time depends on the size of your system. Usually takes about 1 day.",
            "timestamp": "15:36"
        },
        {
            "party": "Victim",
            "content": "We appreciate you answering our questions. I am still waiting for the files to test. When you say you will bring our systems and data to their original state, does that mean you guarantee that your tool will work on everything?",
            "timestamp": "13:27"
        },
        {
            "party": "Black Basta",
            "content": "We think that you are simply delaying the time, and there is nothing to discuss. We have given the proof of the availability of files, we can also decrypt several encrypted files as a test for demonstrating our decryptor tool. That's all the discussions. Then you must pay the required amount, and we'll provide the program and help restore all your systems and data, also we'll delete all your data and send the deletion log.",
            "timestamp": "20:04"
        },
        {
            "party": "Victim",
            "content": "there was no delaying in time your chat has been down for several days. We have files for you",
            "timestamp": "14:23"
        },
        {
            "party": "Victim",
            "content": "Download file: [redacted].docx",
            "timestamp": "14:23"
        },
        {
            "party": "Victim",
            "content": "Download file: [redacted].docx",
            "timestamp": "14:24"
        },
        {
            "party": "Victim",
            "content": "Download file: [redacted].docx",
            "timestamp": "14:24"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].docx",
            "timestamp": "20:26"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].docx",
            "timestamp": "20:26"
        },
        {
            "party": "Black Basta",
            "content": "Download file: [redacted].docx",
            "timestamp": "20:26"
        },
        {
            "party": "Victim",
            "content": "Thank you for this. It is Sunday and that means no decision makers are here. We will be back in touch tomorrow.",
            "timestamp": "13:34"
        },
        {
            "party": "Victim",
            "content": "My leadership and IT team are currently reviewing the files.",
            "timestamp": "13:06"
        },
        {
            "party": "Victim",
            "content": "We have reviewed the files. Thank you for letting us test your decryption tool. A question has come up from my leadership. Will you provide assistance during the decryption process if we need it? How long will you keep the chat open?",
            "timestamp": "14:37"
        },
        {
            "party": "Black Basta",
            "content": "We will give you a full support the decryption process if you need it. Chat will be open until we have fully fulfilled our obligations.",
            "timestamp": "07:20"
        },
        {
            "party": "Black Basta",
            "content": "Also, after the payment:\n1. You receive decryptors (Windows and Linux OS).\n2. Your page will be totally deleted from the blog.\n3. ALL your data will be deleted from our server and you will receive the full deletion log.\n4. You will get penetration report and recommendations how to avoid such the situations in the future.\n5. You receive the guarantee that Black Basta or anyone of our team will not NEVER attack you again.",
            "timestamp": "07:20"
        },
        {
            "party": "Victim",
            "content": "Okay. Thank you. I will take this to my leadership. We appreciate you answering our questions.",
            "timestamp": "14:36"
        },
        {
            "party": "Black Basta",
            "content": "Okay, we'll be in touch.",
            "timestamp": "07:45"
        },
        {
            "party": "Black Basta",
            "content": "Any updates?",
            "timestamp": "10:21"
        },
        {
            "party": "Victim",
            "content": "We appreciate you working with us and answering our questions. You are however, asking us to pay you a lot of money and we need time to place ourselves in a better financial position to reach an agreement with you. My leadership team is set to meet and discuss this in its finality next Thursday. If you could give us time from now until Friday morning to work hard to place ourselves in a better position, it would show a lot of good faith between us. We were also wondering if there were any discounts available to us so that I could bring that to my leadership during their meeting.",
            "timestamp": "12:26"
        },
        {
            "party": "Black Basta",
            "content": "You had a lot off time. You have time until Monday. If your proposal is not satisfying us on Monday, we will start to publish your data on Tuesday and delete the chat.",
            "timestamp": "19:38"
        },
        {
            "party": "Black Basta",
            "content": "We will take a step towards and make a 25% discount from the initial cost if you pay next week.",
            "timestamp": "10:03"
        },
        {
            "party": "Victim",
            "content": "We appreciate the 25% discount and I will bring that to their attention. Monday is not enough time for us to put ourselves in a better financial position to reach what you are asking. Due to the time of year it is difficult to get all of the leadership together to meet on this. Thursday is the earliest they can all meet so they can all be on the same page with this situation. We are trying to work with you and we need you to work with us.",
            "timestamp": "15:08"
        },
        {
            "party": "Black Basta",
            "content": "Sir, you see that we try to act as a businessman who like their business. We are patient, but we need to clearly understand how much time you need to be ready to pay. We can't wait forever.",
            "timestamp": "10:53"
        },
        {
            "party": "Victim",
            "content": "We understand and we need until Friday due to our leadership all meeting on Thursday evening so that they can all be on the same page.",
            "timestamp": "13:05"
        },
        {
            "party": "Black Basta",
            "content": "Okay, you have time until Friday. If your proposal is not satisfying us on Friday, we will start publishing your data on the weekend.",
            "timestamp": "16:28"
        },
        {
            "party": "Victim",
            "content": "Thank you. We will reach out to you then.",
            "timestamp": "16:40"
        },
        {
            "party": "Black Basta",
            "content": "You made your choice. Your time has passed, we are preparing your data for publication.",
            "timestamp": "14:31"
        }
    ]
}