{
    "chat_id": "20230815",
    "messages": [
        {
            "party": "Victim",
            "content": "> Hello",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon. Do you have a permission to conduct a negotiation on behalf of your organization?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> yes i do have permission",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Ok, thank you. I will get back shortly with more information.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ok, We are here waiting.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have to inform you that we are experiencing technical issues at the moment. All the details will be provided on Monday the latest. Our deepest apologies. Meanwhile, to prove that we can properly decrypt your data you can upload 2-3 encrypted files to our chat and we will upload decrypted copies back. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ok , will get those files for you. what is the amount you are asking?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.txt // 9.56 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> This is the list of files of [redacted] company. We are working on transporting files of the rest companies and will provide you with the lists for them soon. We're willing to set a $2,000,000 price for all the services we offer.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ok, thank you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> hi, when can we expect to receive the additional lists?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> In a few hours.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted]_full_listing.rar // 1.46 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> This is everything we hold.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Given the fact that we hold data of two more companies, we've reconsidered the price for the full deal - $2,400,000. Let us know whether you are interested in a test decryption or files for proof. In case of quick payment we can make a discount.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> pulling down the listings now. appreciate your patience.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Let us know if you are interested in a test decryption and proof files. Waiting for your answer tomorrow.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ok, we are working on your requests. Please allow us sometime to review the file listing and send requested files.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please keep in mind that tight cooperation with us often leads to a more positive end of a deal.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We are waiting for your decision today.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We are looking through all the file listings you gave us. We will get you some files soon. appreciate your patience.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Do not forget about files for the test decryption, if you need it.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Definitely apprecaite your patience. My team is highly stressed due to the incident, and are working to get you the files as soon as possible.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Speed things up on your part and nothing bad will happen.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ok noted, will make sure pass this information along to my boss.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> If we don't get your decision within next 24 hours, we will be forced to announce your corporate data leak on our blog.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].edi.[redacted] // 793 Bytes",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].edi.[redacted] // 1.42 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].edi.[redacted] // 23.4 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].csv.[redacted] // 74.8 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].csv.[redacted] // 1.1 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Definitely appreciate your patience and working with us. We have almost completed going through the file listing and will provide you files soon. While we finish that, can you please decrypt these files.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Yes, I've passed the files to my tech dept. Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> files.zip // 14.8 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here they are. Please check.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> thanks, pulling these down for review. will provide an update when we can.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have to close the deal this week. Are you in time?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We are working as fast as we can. we really appreciate your patience with us during all of this. After reviewing the file listings can you provide the following files please.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Backlog detail 2021.xlsx, [redacted] Rate 10.24-10.28.22.xlsx, Keywords.xlsx, [redacted] Inspection Log 2023.xlsx, img20230508_[redacted].pdf, [redacted] Tax Codes.pdf, Interest Payment [redacted].pdf, Sales Service Agreement.docx, Annual Refiling Survey [redacted].pdf, [redacted] - Aug Insurance Exp [redacted].xls, [redacted] - Accrue Deprec for [redacted].xls, [redacted] - Clear Obsolete Inventory [redacted].xls, [redacted] - Loss on Sale & Liquidation of Assets [redacted].xls, [redacted].xls, [redacted].PDF, [redacted] Tests.xlsx, [redacted].PDF, [redacted].PDF",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Too many files but ok. We will provide shortly. Meanwhile, how's it going with fund gathering?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted].rar // 3.12 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can review the files.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> When reviewing the decrypted files you sent back, we noticed that 2 of them are not what we expected to see as they came back with some empty fields. Can you please decrypt the attached files again and send it back to us so we are able to confirm the decryptability. Appreciate you working with us.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].csv.[redacted] // 74.8 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].csv.[redacted] // 1.1 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will check but we actually have some doubts that they are corrupted. If it is an attempt to win more time, nothing good will happen. Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The files are ok. In 24 hours we will announce your corporate data leak on your blog. Early next week your data will be published. Thank you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We are not stalling for time, we are wanting to make sure that the decryption process brings back the data in its entirety. The 2 files we are asking about it appears that it dropped fields off at the end of the files.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> I'll ask to double check but bear in mind that we are posting you in our blog tomorrow if there is no payment decision from you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We had very good backups and only about 1/4 of our data is encrypted now. We have approval to pay you $800k tomorrow for decryptors, proof of data deletion, and security audit report. Leaking our name will make our ability to pay much harder. Please accept so we can put this behind us.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We appreciate this offer but all we can do is to give you 20% discount in such circumstances.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> I have very good news. I was talking to the upper management and they are willing to accept $1,4M today for all the outlined options. On Monday we will have to return to our previous demand. Do we have a deal now?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> So, I passed your request regarding those files to the tech department. After decryption these same files were increased in size and then re-encrypted. After decryption, the files remained the same size, which means that our decryptor absolutely works correctly. It also means that you tried to play unfairly and gain more time. We also doubt your stories about \"good backups\". \n\nBased on all of the above, our offer of $1.4 million when paid today still stands, but we will not accept anything below $2 million on Monday. If you refuse and break the deal, we will simply publish your stuff and forget about you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you so much for working with us. In good faith we are going to reveal to you that we only have $1,000,000 to work with. We can pay you all of that today. To get any more will be very hard and take many more days. Please accept $1 million and we will get that to you today",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Ok, the leadership has approved that number. Here is a BTC wallet ID for payment: [redacted]",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> How soon are you able to make a transfer?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We are wiring the money to a broker now. They say a couple hours",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Ok, standing by.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> To confirm we pay you $1,000,000, and you will deliver whole network decryptors for linux, and windows, promise to not publish or sell our data, provide proof of deletion, and a security audit report?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We do confirm the terms.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> and guarantees not to attack us in the future",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Sure.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> thank you. sending bitcoin shortly",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Standing by.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We just sent a test transaction. Please verify and we will send the rest",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Test transaction confirmed on blockchain. Please verify",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We will be back in east coast usa morning to send you the rest",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. We have received 0.0001 BTC.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you. Are you ready to receive the rest?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> sending the rest",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Coin sent. Txid: [redacted]",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have received, thank you. Please wait for the decryptor first.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will provide everything within 24 hours. Thank you for your patience.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for update. We will continue to nervously wait",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Just checking. Please provide what you promised soon",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> decrypt.zip // 479 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> decrypt.exe\nName:\n        decrypt\n\nUsage:\n        cli args\n\nFlags:\n        --path    : Start path\n        --secret  : Private key\n        --logs    : Print logs. Valid values for: trace, debug, error, info, warn. Default: off\n        -h, --help        : Show help\n-----------------------------------------------------------\nBuild information:\nVersion: 2023.9.5\nSECRET KEY: \"[redacted]\"\n-----------------------------------------------------------\ndecrypt.exe --path  --secret  : Private key --logs \n----\ndecrypt.exe --path C:\\ --secret [redacted] --logs trace\ndecrypt.exe --secret [redacted] --logs trace",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> thank you we are working on this now. can you provide a security report or how you got in and what we need to do better?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Initial access to your network was purchased on the dark web. Then kerberoasting was carried out and we got passwords hashes. Then we just bruted these and got domain admin password. Spending weeks inside of your network we've managed to detect some fails we highly recommend to eliminate:\n\n1. None of your employees should open suspicious emails, suspicious links or download any files, much less run them on their computer.\n2. Use strong passwords, change them as often as possible (1-2 times per month at least). Passwords should not match or be repeated on different resources.\n3. Install 2FA wherever possible.\n4. Use the latest versions of operating systems, as they are less vulnerable to attacks.\n5. Update all software versions.\n6. Use antivirus solutions and traffic monitoring tools.\n7. Create a jump host for your VPN. Use unique credentials on it that differ from domain one.\n8. Use backup software with cloud storage which supports a token key.\n9. Instruct your employees as often as possible about online safety precautions. The most vulnerable point is the human factor and the irresponsibility of your employees, system administrators, etc.\n\nWe wish you safety, calmness and lots of benefits in the future. Thank you for working with us and your careful attitude to your security. The evidence of data removal will be provided soon.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you. We wait for proof of deletion.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted] dellogs.rar // 524 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> There are three files in the archive.",
            "timestamp": ""
        }
    ]
}