{
    "chat_id": "20230722",
    "messages": [
        {
            "party": "Akira",
            "content": "> Hello",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> So, you've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon. Do you have a permission to conduct a negotiation on behalf of your organization?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> list.7z // 1.11 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files to our chat and we will upload decrypted copies back.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're looking through your files to calculate a fair demand to you. I will let you know the sum shortly. We offer:\n1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future.\nLet me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> So, we've gone through your files to define your financial abilities. We've been looking through your bank statements, net income, cyber liability limits, financial audits - all the info that might help us to calculate our demand to you. We're willing to set a $190,000 price for ALL the services we offer.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> If we don't get a respond within next 24 hours, we will be forced to announce your corporate data leak on our blog.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> 12 hours.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find yourself in our news column: https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion/ If you want this post to be removed, we have to agree at something.",
            "timestamp": ""
        }
    ]
}