{
    "chat_id": "20230707",
    "messages": [
        {
            "party": "Akira",
            "content": "> Congratulations, you have passed a surprise information security audit and become a victim of ransomware. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> list.7z // 493 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files to our chat and we will upload decrypted copies back.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're looking through your files to calculate a fair demand to you. I will let you know the sum shortly. We offer:\n1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future.\nLet me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> In case we don't have a response form you, we will have to post your data in our blog.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello, we're reviewing the list you sent us now.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Ok. We are waiting for the files request tomorrow.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. Have you review the list?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello, we are still reviewing the list at this time but will have those files over to you as soon as we finish. Is this list everything? We want to make sure prior to sending over our requests.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Yes, this is everything.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're willing to set a $350,000 price for ALL the services we offer.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> You advised we could request some files from that list you sent. We would like to request the below:     [redacted].xlsx  [redacted]-2023.xlsx  [redacted]23.docx",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted]2023.xlsx // 336 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted].xlsx // 15.6 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted]23.docx // 1.84 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please review the files.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Okay thank you we are reviewing these. We still need some time to review the entire listing itself and we are a bit worried about your price. I dont think we can afford the 350,000 and theres no guarantee you wont just take the money and run off. How are we supposed to trust this process?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> If we receive the payment within next 48 hours, we will provide you with a 20% discount. \nAfter payment you will receive a deletion log which means the raid drives that contained the only copy of your data are fully formatted and erased. There is no need to deceive you since we value our reputation and you will find no case where we didn't honor an agreement.\nIf we fail to agree, we will not only publish your data but also notify all of your clients, partners, employees and so on. In some cases they will be guided on how to file a claim properly.\nYou will receive a security report that includes information about how we were able to penitrate your network, as well as exclusive first-hand information about the state of your network, the vulnerabilities that we found. What's more, you'll receive high-quality technical recommendations on eliminating any vulnerabilities and strengthening your network to secure your internal and external infrastructure. You will also receive written guarantees that we will not sell or publish your data, keep this conversation private, and delete this chat later. We won't come back for more money after payment and we won't attack you again.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We understand and thank you for the information. We're already in the process of trying to find out exactly how much we can offer you, but it won't be close to the price you gave us. We'll update as soon as we can. I know you said you can unlock our files can we send some over to you? We have a few file types we are concerned with.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. Our tool works on every system/file format. As for your upcoming proposal, we haven't talked about any discounts yet, so you're wrong since you have to get as close as possible to our initial demand to get this over. Thank you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> A lot of our files are larger than 10mb, how do we know the decryption will work on those larger files? Also you are mentioning a discount, is this something you can do for us? We will work on getting the files sent over to you but are concerned we cannot sent anything less than 10mb.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can provide us with one of larger than 10MB. No one is going to deceive you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Ok thank you, we are working on it. We will upload this once we have it, I just need to discuss with the others which ones we can send.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please speed things up on your part. No one is interested in dragging this out.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].dwg // 10.4 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].pdf // 2.39 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait for them decrypted.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please send us the correct files. We do not see any signs of our tool.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> These came from the machines you locked and you said this tool was going to work. This is a little concerning, but let me have our IT grab some more files to send you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> My tech dept has checked those files and they're not encrypted, so please send us correct files asap.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Please try what I'm attaching now to the chat",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> EncryptedSample[redacted].zip // 9.18 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will try.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Just checking out what's going on? Waiting your response.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello? Are you still there? We are awaiting the files.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. We're here. I've asked my tech dept about this.",
            "timestamp": ""
        }
    ]
}