{
    "chat_id": "20240317",
    "messages": [
        {
            "party": "Victim",
            "content": "> What is the price to decrypt?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.\n\nDo you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Yes",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> ?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> So, we didn't take your data. We are the ones who can properly decrypt your data and restore your infrastructure in a short period of time. \nAfter payment you will receive a decryptor for each of your systems and manual on how to use it for particular file/system. If you face any problems during decryption process, we will be here to support. You will receive a security report that includes information about how we were able to penetrate your network, as well as exclusive first-hand information about the state of your network, the vulnerabilities that we found. What's more, you'll receive high-quality technical recommendations on eliminating any vulnerabilities and strengthening your network to secure your internal and external infrastructure. \nYou will also receive written guarantees that we will keep this conversation private, and delete this chat later. We won't come back for more money after payment and we won't attack you again. The price is $10,000,000. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> In case of a quick payment, we will be able to consider a good discount.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. We are expecting to get a reply from you today.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Isn't it easier to come to an agreement with us?",
            "timestamp": ""
        }
    ]
}