{
    "chat_id": "20250310",
    "messages": [
        {
            "party": "Victim",
            "content": "> Hello,  We are responsible for handling communications regarding this matter. To properly assess the situation, we need a complete list of exfiltrated files to understand the scope of the impact.  Additionally, we would like to clarify the timeframe available for reaching an agreement before any further actions are taken on your side.  We look forward to your response.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.rar // 483 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. We're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Are you going to work with us?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find your company name in our news column: https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion \n\nIf you want this post deleted, we must come to an agreement.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Please indicate the amount you are requesting, and in the meantime, we ask that you temporarily remove the post while we evaluate the terms.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> $850,000 for the full deal. The post will be removed after payment only.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We apologize for the delay. Internal discussions were necessary to determine a viable offer. Considering current constraints, your initial demand exceeds our capabilities. Our proposal for the full deal is $150,000 USD. Also, we kindly request the temporary removal of the public post during negotiations as a sign of good faith. While we cannot guarantee immediate payment, we are committed to resolving this matter as quickly as possible.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will temporarily remove the post. Thank you for your offer but it can't be considered. The leadership is willing to come down to $800,000 as a sign of good faith.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you again for your cooperation and for temporarily removing the post. After further internal discussions, our limitations remain significant due to bureaucratic approvals and cryptocurrency transfer restrictions. Nevertheless, in the spirit of progressing towards a mutually acceptable resolution, we can increase our offer slightly to $162,000 USD. We kindly ask for your understanding regarding these economic realities and bureaucratic challenges, including the complexity of transferring funds into cryptocurrency. We remain fully committed to reaching an agreement promptly.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Thank you. A $12,000 step doesn't look fair. We're willing to reach an agreement promptly but it won't be in the 150-300K range, you must understand. We can provide additional 50K discount, so let's not complicate things. We're well aware of bureaucratic challenges. Hope you will break them quick.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for your understanding and willingness to negotiate. To clarify our financial position further, our organization operates in an economically developing country in Latin America, where profit margins are limited, and most earnings are immediately reinvested into business growth and essential operations. Even significantly reducing these activities wouldn’t allow us to substantially exceed our current offer.  We appreciate your additional discount, yet due to the economic realities and constraints already shared, we simply cannot approach your proposed range. Our current offer reflects a realistic effort under these conditions.  We remain committed and sincerely interested in promptly resolving this matter within our available means.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We don't want you take this as a threat but we think your management don't fully understand the consequences that could appear after our further actions. Let me clarify something more:\nThe personal data of your employees, clients and partners, now at our hands. But if you don't pay, it will be released to public. At the most basic level, they face the risk of identity theft, which can manifest in unauthorized loans, financial losses, and other forms of personal fraud. Because your files are saturated with financial data as well, it makes such scenario even more possible. But the risks don't stop at financial implications. With such data. We are willing to give it back, but if it gets published, more even criminals can engage in targeted blackmail schemes, zeroing in on employees, especially those holding pivotal positions within the company. By doing so, they (or we) could coerce your people into acting against your company's best interests. Moreover, the exposure of personal details like home addresses or daily routines could pose a direct threat to the physical safety of employees, making them vulnerable to potential harm or intimidation\nDrawings, logos, formats, internal mail correspondence with your clients and employees, email templates with authentic templates and structures. Now when we have your templates, we can weaponize them to launch convincing phishing attacks if you don't pay. We will mislead employees, clients, or vendors into unintentionally opening our malware and ransomware. This use of your templates can harm your reputation as well. Your stakeholders will begin to question the company's integrity and ability to safeguard critical information, leading to an erosion of trust.\nAccounting files, documents, and audits. When this financial information becomes public on our blog, competitors, upon obtaining this data, could gain invaluable insights into your company's financial health and strategic direction making. Such knowledge would offer them an undue competitive advantage, potentially undermining the company's market position. Furthermore, regulatory bodies might penalize the company for failing to adequately safeguard sensitive data, leading to hefty fines and further erosion of stakeholder trust.\nTry to calculate possible loses from lawsuits, penalties and total loss of your clients. Reputational damage for your business is really deadly.\nYou have to estimate this payment not as a loss or ransom, it is your investment in your company's future. Without getting a deal here your business is fated.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We need further increase from your side to consider any discounts.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for clearly outlining the risks involved and your concerns.  We have carefully evaluated the situation and fully understand the severity. As previously mentioned, our organization operates in an economically developing country, with most of our profits consistently reinvested into business growth and essential operational activities. Additionally, the process of converting funds to cryptocurrency involves significant bureaucratic hurdles and limitations on available resources.  Nevertheless, given the seriousness of the situation, we held another internal meeting and secured approval for an additional increase. After making a substantial effort, our maximum feasible offer has now been raised from $162,000 USD to $200,000 USD. Unfortunately, ongoing financial commitments and internal regulations severely limit any possibility of further increments beyond this point.  We kindly ask for your understanding, as this represents our absolute maximum effort given the circumstances.  We remain fully committed to resolving this matter promptly and appreciate your cooperation.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will discuss this internally. I will get back to you shortly.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The leadership is willing to accept $200,000 if you arrange payment within the next 24 hours. Here is our BTC wallet ID for payment: [redacted]",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for your prompt response and willingness to reach an agreement. However, due to internal procedures and necessary approvals—particularly the complexity of transferring funds into cryptocurrency—we may need slightly more time than 24 hours to finalize the payment.  Please rest assured that we're fully committed to honoring this agreement promptly and are actively working to expedite the necessary internal approvals.  We greatly appreciate your understanding and cooperation.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Keep us posted on your progress please.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> What's your progress?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The publication will be returned shortly. It will be removed as soon as we receive payment.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have returned the publication to our blog:\nhttps://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion\n\nIf you are not going to cooperate, we will make your data publicly available.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Your data will be published soon.",
            "timestamp": ""
        }
    ]
}