{
    "chat_id": "20250227",
    "messages": [
        {
            "party": "Victim",
            "content": "> hello",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> anyone there",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. Do you have a permission to conduct a negotiation on behalf of your organization? Once we get your reply you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please confirm you have a permission to conduct a negotiation on behalf of your organization and we will provide the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> hello",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> yes I can negotiate on behalf of my org",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I confirm",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.7z // 219 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. We're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello any one there?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Chat is not responsive had to reload",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> 1",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].pdf.akira // 2.86 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].oms.akira // 7.67 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> whole package",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> hello anyone there",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> decrypted.7z // 10.5 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're willing to set a $250,000 price for ALL the services we offer.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].pdf.akira // 10.2 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello this is the owner of the company. If you looked at our bank statements you will see we could not even afford $2,500 let alone $250K",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Congratulations.  You attacked literally the poorest company in [redacted].  Now you will essentially bankrupt us and 65 familes will not have money to buy food for their families.  I know you have families to feed as well, but destroying our company and making families go without food is not the way to do it.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Please understand that I am a very small business and I am not in a position to pay such a high amount.  I want to resolve this matter as quickly as possible, but I need to negotiate a much lower amount.  You arn't going to release everything for $0.  But we can't afford much.  We are going to miss payroll this Friday because of this entire situation, and we will have to deal with the damage you already caused over the weekend.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> So, what can you offer?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We understand the seriousness of the situation, with our current situation we could offer 1200 for decryption services.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You don't understand the seriousness of the situation. We will announce the incident soon.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Are you going to increase your counter offer?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello.  This is the owner. I cannot afford what you are asking. You have literally put our company on the brink of bankrupty.  You have to give me a reasonable number. My associate is a $400MIL drywall company and he only had to pay $10,000. We barely make any profit in our tiny company. You can see that from our finacial statements. Can we please work out a more reasonable ransom amount that we can afford and not force us into bankruptcy one way or another.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I cannot afford much or we will not be able to make payroll or pay rent or buy supplies. Will you accept $4000.  I cannot even afford this right now, but I will consider this a $4000 lesson that we need to focus more on network security from a very smart consultant, that being you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We cannot accept $4,000 or $10,000 fir this. If you want to come to an agreement, you should find a way to offer more. Waiting for your reply asap.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I am sorry, we cannot even pay $10,000.  We literally do not have any money to pay.  $4,000 means us laying off 1 person to pay for this.  $8000 would be laying off two people",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> It is fine.  It sounds like you do not see our situation even though you have all of our bank statements and financial information. If you look at them, then you will see $4000 is more than what we can afford. It is that bad for us right now. We aleady have planned to shut down operations because of this virus. So do what you have to do.  I don't know what to tell you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> even if i laid off 10 people, we could not pay for anything because we would not produce enough work to sell to generate the cash to pay bills. You want something we do not have.  We lost - $335K in 2024.  And 2025 is not starting off much better.  We are just a small business trying to survive. You can ask for $10,000 or you would kill my child and I would not have the money to give to you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will verify that information.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted].pdf // 32.4 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> This is not an argument that you've lost $335K in 2024. Previous years were profitable for you. So, we want you to stop trying to cheat us and make a fair deal. We don't want to make things more complicated and we hope you won't force us to take action.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Did you klook at the tax returns?  The PNL are not accurate. Look at the bank statements. they will tell you our situation. We barely have $20K in the bank most of the time. Money comes in slower than it goes out. If you see our 2024 bank statements you will see.  We missed payroll 3 weeks ago. I am willing to pay you something. Nothing about this is fair. You are committing a criminal act. I am trying to pay you to commit a criminal act. I just want to move on.  Our cashflow is miserable. This virus makes matters even worse. As we are unable to collect any money from any of our clients. You can keep accusing me of cheating but I am offering you want I can without bankrupting the company.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We do not have your bank statements or up-to-date reports. We're willing to make an exclusion and come down to the bottom line. $100,000 and we will get you back on track.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find your company name in our news column: https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion \n\nIf you want this post deleted, we must come to an agreement.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello, we cannot afford that amount. Is there any other lower amount that can be considered?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> What is your maximum?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We're a small business, all we can afford is $10,000.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> There is no way we agree to $10,000.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We dont een have $10,000 in the bank right now. I have to sell our only company vehicle that has any value to pay for this. Please.  We are finding ways to move on from this because we cabnnot afford what you are asking.  I am simply asking if you can be reasonable and come up with a reasonable fee considering our situation.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> What amount you can call reasonable in this case? We are $90,000 apart. What do you suggest?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> just beause you ask for $100,000 means we are $90,000 apart.  I am truly offering more than we have.  We have not been able to bill a client for two months because you guys were smart enough to hit us before we could close out February. We are doing everything manually, but we have laid off 1/3 of our staff and just trying to pay the basic bills so we do not get sued or evicted. More layoffs are coming if we cannot start billing and collecting from our clients who owe us real money. It's 7-10 days just to clear the bitcoins. I don't een have $10,000 rgiht now, I would have to wait for the truck to sell this weekend, deposit the cash and convert to bitcoin. Whcih would be 11-15 more days from now",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> i could sell some breand new materials and supplies for some money but I have to put that on ebay and wait for a buyer to bid on it in order to come up with more cash right now",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> i will be honest, you probably would have made more money as our business consultant showing us how crappy our network security was and to tell me I only need 50% of our orginally staffing to to business",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We would maybe accept something less than $100,000 from you but that is not $10,000 for sure. If you cannot increase your offer, we have nothing to talk about.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> i am not going to insult you by incrementally going up. I will layoff 4 more employees and I can increase to $20,000 but i wont be able to realize the savings until next week. I will sell the truck this weekend and purchase the bitcoin once we have the free cash. By end of next week I should be able to free up $20,000 to buy bitcoins. But please that is the most i can do. And you are right, if $20,000 is not enough, there is nothing more to talk about",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Keep trying.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Sir - Will you acceot $20K?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> accept",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> No.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The data of your company and your employees is now freely available. \n\nhttps://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion\n\nWe can delete them, but you have to agree to our terms and conditions.",
            "timestamp": ""
        }
    ]
}