{
    "chat_id": "20250222",
    "messages": [
        {
            "party": "Victim",
            "content": "> We would like to know what data you took from us",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Yes",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> list (20).txt // 798 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back.\n\nWe're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future.\n\nLet me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for sharing this information and the file list. We'll review everything and follow up with you on Monday.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Waiting.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Taking more time than we thought to check this list. Need until tomorrow if thats okay",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> That's is not okay. Provide a file request today.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We first contacted you over the weekend and we haven't had enough time to check this list. It's not the easiest thing to skim through all of these directories.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can ask for any not large file from the list. It doesn't take much time.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Sorry for the wait. Still understanding the data but please send these",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> E:\\[redacted].com\\[redacted].docx",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> E:\\[redacted].com\\[redacted].xlsx",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> E:\\[redacted].com\\[redacted].xlsx",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Files.rar // 1.93 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here are the files. Do you want to test our decryption tool?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Yes, how does that work?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Are you trying to stall? To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. Waiting for the files today.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're willing to set a $450,000 price for ALL the services we offer. Waiting for your files today.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].jpg.akira // 37.7 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].docx.akira // 155 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Please bear with us. We don't want to create an error so we are following your guidance. Can you fix these?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Decrypted.7z // 148 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here are the files. Are you ready to proceed with payment?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Can we slow down just a bit? We're checking these files but you're asking us for almost half a million. Other companies just pay you instantly?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Yes, they do. You have until tomorrow to review the files. We have to move to payment.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We need to set this straight. We reached out to you over the weekend and we've spent each weekday trying to turn on our bricked computers, which has been a slow process. We've also been reviewing your list and now you're asking for $450,000. We're a small shop out of [redacted], not some large corporation in a big city. Can we get more than 1 day to wrap our heads around all of this?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> How much time do you want to gather the amount?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We can't promise any sort of payment at this rate but Tuesday should give us enough time to see how this may play out. I don't handle our finances but I know this is going to be quite the exercise to see what we can come up with.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We cannot give you until Tuesday. We will give you until Thursday evening the latest.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> That's tomorrow...",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We have a handful of employees. We don't make millions and millions in revenue. How do you expect us to evaluate all of this in 24 hours? If we can't have time, then we have no idea how we're going to work with you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Just give us an update on Thursday evening. If you pay this week, we can make a good discount.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I wanted to get back to you before the evening. I really wish I had a better answer but right now the only thing we have available is some petty cash for a few thousand. We need to meet with our accountant since he knows more about this finance stuff and he's not back until next week. This is a lot more serious than we thought and I don't want to lost contact with you. Can you wait for him to get back so we can see what options we have?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We can wait till Monday for a serious counter offer. The incident will be announced if your number is inadequate.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I think we can make that work",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hope so.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> What's your offer?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Our accountant is still performing an analysis but I told them that we need to get some sort of response to you today. Nothing is finalized but for now he's comfortable offering $80,000. I don't know how to even get this money to you but is this something you can allow?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> This doesn't work. $80,000 offer is too far from our demand. We do not work with 5 figure amounts. Update your offer today, if you don't want us to announce the incident.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> The accountant is still reviewing our financials. It's been even harder since he doesn't have access to some of the drives. This isn't our final number but there's nothing else he can provide today. He's going through dozens of reports and re-calculating some of the locked data so he's going to need a few days to figure this out.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will not give more than 24 hours. Hurry up.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> If we keep getting these short deadlines, then we're going to continue coming up short. It's just a few of us that work here and each day has been painful for us. We don't have access to our files and we're trying to come up with a price that feels unfair. If you're not going to meet us on the price, then please give us enough time to actually give you a proper response. We don't need a whole week, just a few days.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You have the deadline. No one is going to drag this out.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> So we have like 2-3 days? That's all we need.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> No, we can't give you 3 days. Update us on Tuesday evening. We will decide how to proceed with you.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We'll try but we really don't know what we can come up with in a few hours...",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You have to take it seriously. We will not wait long.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Ok this is where we're at. The accountant said that we were already in bad shape to start the year and the budget was trimmed because our profits aren't getting better. We may be able to sideline a small project to come up with more cash for you, but anything more and we're going to need help from the bank. There is nothing else left for now. To sum it up, we can pay $103,000 now. Anything more will require help from the bank.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> This is something already. You can understand that you are still far from our demand but we are open to work with you. So, the leadership decided to make a big step towards you and we are ready to accept $400,000 if you pay this week.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> $400,000? This week?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Is this some sort of a trick? How do you think we'll 4x our offer in 3 days?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Take a loan or try to borrow. Ask your accountant. You have a few hundred thousands in cash and a couple of dozens in assets.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I don't know much about the financials but I know our accountant has said multiple times that we are already in a lot of debt. If there's any chance of borrowing then that will take time too. I hate sounding like a broken record constantly asking for time, but you need to give us something to work off of. Can we get the rest of this week to see our options then update you on Monday?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We cannot wait that long. Update us on Thursday evening the latest.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We have a few banks that we normally work with and I can guarantee that they won't sign off on a loan in 48 hours. We're at their mercy if we go down this path so Thursday won't work.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Do your best. We believe you will make it.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Just letting you know we are still working on this, but it's moving slowly. We're at the mercy of the banks right now",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Keep us posted on your progress.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We certainly will. We want this resolved just as much as you do.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Waiting.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> What's your progress?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We just received word from the bank working with us that they won't have a decision on the loan until next weekend. Either Monday or Tuesday.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We have to keep providing them with documentation of our financials so we can justify the amount of the loan so there is a lot involved.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You have to push your bank to get a quicker decision from them. The deadline is Monday. If you provide little or no offer, we will announce the incident incident.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> If we had that power we would tell them that, but it's a bank and we need something from them. They aren't going to just give us money without doing their due diligence.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We will let you know on Monday if we have their decision or not.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Ok. We will see on Monday whether your data be published or not.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You have 24 hours to give us your decision regarding this deal. If you stay silent, we will announce the breach on our blog.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find your company name in our news column:\n\nhttps://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion \n\nIf you want this post deleted, we must come to an agreement.",
            "timestamp": ""
        }
    ]
}