{
    "chat_id": "20250313",
    "messages": [
        {
            "party": "Victim",
            "content": "> Hi, my name is [redacted] and i am authorized to speak with you. please contact immediately.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I am part of the company, i am allowed to deal with you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.txt.7z // 281 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. We're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].mp4.akira // 1.17 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].mp4.akira // 1.17 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].pdf.akira // 3.32 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted].mp4.7z // 1.13 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> [redacted].mp4.7z // 1.13 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We won't provide you with the third file for an obvious reason.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Here are the three files from your list ( 4,573,696 [redacted].xls -   [redacted].xlsx -  109,056 [redacted].xls) that we would like to have decrypted. Of course, we would like to know your price for the whole package: 1. the decryption of our entire system. 2. the evidence of data removal. 3. the guarantee that our files will not be passed. 4. the security reports on vulnerabilities. 5. the security that we will not be the target of further attacks.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> files.rar // 3.94 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here are the files. We will provide a quote for our services shortly.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The price for the whole package is $150,000.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Ok. So please tell us what is the price for our requestetd Service.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Which of these options are you interested in?\n1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> The price for everything is $150,000.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> That is a lot of money, even for us. We can not simply organize that much. We can organize and pay $40.000. How should we transfer?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We can't accept $40,000. The leadership is willing to accept $120,000 if you pay quickly. We can't consider 5 figure amounts, so let's save our time.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We can offer $100.000. Please tell us quickly the way for the transfer and how we get our decrypter?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> $115,000 and we have a deal. Here is our BTC wallet ID for payment: [redacted]",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> After payment you will receive a decryptor for each of your systems and manual on how to use it for particular file/system. You will be able to restore your infrastructure within 24 hours. If you face any problems during decryption process, we will be here to support.\nYou will receive a deletion log which means the raid drives that contained the only copy of your data are fully formatted and erased. \nYou will receive a security report that includes information about how we were able to penetrate your network, as well as exclusive first-hand information about the state of your network, the vulnerabilities that we found. What's more, you'll receive high-quality technical recommendations on eliminating any vulnerabilities and strengthening your network to secure your internal and external infrastructure. \nYou will also receive written guarantees that we will not sell or publish your data, keep this conversation private, and delete this chat later. We won't come back for more money after payment and we won't attack you again.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Ok. How will you send us the decrypter? We are also currently looking into setting up a wallet and pruchasing BTC. This is new territory for us, so itś taking some time. if you have any recommendations on how to do this quickly and securely, let us know.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We will upload unlockers to this chat.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> To gain bitcoins you have to go to any exchange platform as binance or coinbase. Here are the guides: https://www.coinbase.com/how-to-buy/bitcoin\nhttps://www.binance.com/en/how-to-buy/bitcoin You also can buy bitcoin from any local brokers. If you withdraw funds from your bank account, then you have to inform the bank that you need this money for investment purposes only.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. How's your progress?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We are sorry, but we are struggeling with issues at the bitpanda account. We spent the whole day setting up the wallet. It now also set up, but the transfer of the balance is still ongoing. We are not able to transfer money today. We will get back to you as soon as possible. You can be assured that it is our goal to complete everything with you as quickly as possible.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Standing by, thank you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello, we´re still having minor issues with the bank and the Bitpanda account. Sorry, we´ll resolve this as soon as possible.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have to close the case before the weekend. Standing by.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We will make a test transfer now. Please inform us about the amount of the transfer, so we can check if everything worked well. In this case we will transfer the remaining amount.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> 0.000587 BTC received. You can proceed with the rest amount.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> We have transferred the remaining amount. Please confirm receipt of the agreed total amount and send the decryptor as soon as possible. We expect you to honour the agreed total package.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Received, thank you.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> unlockers.7z // 2.1 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> unlocker.exe -p=\"path_to_unlock\" \nunlocker.exe -s=\"C:\\paths.txt\" \nwhere \"paths.txt\" is a list of paths for the decryptor, each path on a new line \nESXi commands \n1) chmod +x unlocker \n2) ./unlocker -p=\"/vmfs/volumes\"",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> After we made the agreed payment, please also send us the security report of vulnerabilities. If  we have any problems to reset the system, we`ll contact your support again. Please keep your promise!",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Initial access to your network was purchased on the dark web. Then kerberoasting was carried out and we got passwords hashes. Then we just bruted these and got domain admin password. Spending weeks inside of your network we've managed to detect some fails we highly recommend to eliminate:\n\n1. None of your employees should open suspicious emails, suspicious links or download any files, much less run them on their computer.\n2. Use strong passwords, change them as often as possible (1-2 times per month at least). Passwords should not match or be repeated on different resources.\n3. Install 2FA wherever possible.\n4. Use the latest versions of operating systems, as they are less vulnerable to attacks.\n5. Update all software versions.\n6. Use antivirus solutions and traffic monitoring tools.\n7. Create a jump host for your VPN. Use unique credentials on it that differ from domain one.\n8. Use backup software with cloud storage which supports a token key.\n9. Instruct your employees as often as possible about online safety precautions. The most vulnerable point is the human factor and the irresponsibility of your employees, system administrators, etc.\n\nWe guarantee that we will not sell or publish your data, keep this conversation private, and delete this chat later. We won't come back for more money after payment and we won't attack you again.\n\nWe wish you safety, calmness and lots of benefits in the future. Thank you for working with us and your careful attitude to your security.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> log_erase.txt.7z // 171 KB",
            "timestamp": ""
        }
    ]
}