{
    "chat_id": "20250216",
    "messages": [
        {
            "party": "Akira",
            "content": "> Hello. You've reached Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. Do you have a permission to conduct a negotiation on behalf of your organization? Once we get your reply you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Are you going to work with us.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find your company name in our news column: https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion \n\nIf you want this post deleted, we must come to an agreement.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello. What exactly is this? What is going on?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> And who are you?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> I need my files and pictures back",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Hello?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> What is going on. I never wrote you these things above. Did I log in tot he right place???",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> How do i get my files back?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Of course I am authorized to talk toy you on behalf of my organization. The problem is that it seems that someone who is NOT autorized to talk to you has access to this chatroom, because I did not write \"How do I get my files back\" above.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Are other people have access to this platform under our password??",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We have just sent a code for a new chat to your leadership by email. Please check and contact us asap in the new chat. We are waiting.",
            "timestamp": ""
        }
    ]
}