{
    "chat_id": "20250408",
    "messages": [
        {
            "party": "Victim",
            "content": "> How much you want for the encrypton?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> test",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> yes i have",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": ">\nPlease wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.txt // 3.23 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. We're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> cost for 1 and full package",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> full decryption cost ? and Whole deal cost?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Wait a bit.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're willing to set a $390,000 price for ALL the services we offer. Decryption tool only will cost you $285,000. We accept payments in BTC. To gain bitcoins you need to go to any exchange platform as binance or coinbase. Here are the guides: https://www.coinbase.com/how-to-buy/bitcoin\nhttps://www.binance.com/en/how-to-buy/bitcoin You also can buy bitcoin from any local brokers. If you withdraw funds from your bank account, then you have to inform the bank that you need this money for investment purposes only.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Are you going to work with us?",
            "timestamp": ""
        }
    ]
}