{
    "chat_id": "20250321",
    "messages": [
        {
            "party": "Victim",
            "content": "> Hi friends, Thanks you for pointing out our security issues. Luckily, we succeeded to get 50% of our files back. However, we're still missing the other 50% (more or less). As there are mainly files we don't necessarly need to operate our current business (archives), we would like to know how much you are willing to accept in order to give us the encryption key?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Hello. You've reached an Akira support chat. Currently, we are preparing the list of data we took from your network. For now you have to know that dealing with us is the best possible way to settle this quick and cheap. Keep in touch and be patient with us. We will reach out to you soon.  Do you have a permission to conduct a negotiation on behalf of your organization? Once we get a response you will be provided with all the details.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thanks for your response. We do have permission to conduct a negotiation.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> List.7z // 200 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> These files were taken from your network prior to encryption. You can pick 2-3 random files up to 10 MB each from the list and we will upload them to this chat as a proof of possession. To prove that we can properly decrypt your data you can upload 2-3 encrypted files up to 10 MB each to our chat and we will upload decrypted copies back. We're looking through your financial papers to come up with a reasonable demand to you. We offer: 1) full decryption assistance;\n2) evidence of data removal;\n3) security report on vulnerabilities we found;\n4) guarantees not to publish or sell your data;\n5) guarantees not to attack you in the future. Let me know whether you're interested in a whole deal or in parts. This will affect the final price.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for your proof of decryption of our file. We have indeed chosen to decrypt 3 files, as follows : (1) \"C:\\DATA\\[redacted].pdf\" (2) \"C:\\DATA\\[redacted].pdf\" (3) \"C:\\DATA\\[redacted].docx\". By the way, can you tell us the cost for the full package (1 to 5)? Thanks.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Please wait.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Files.docx.7z // 606 KB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here are the files. Do you want to test our decryption tool?",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> We're willing to set a $200,000 price for ALL the services we offer. We accept payments in BTC. To gain bitcoins you need to go to any exchange platform as binance or coinbase. Here are the guides: https://www.coinbase.com/how-to-buy/bitcoin\nhttps://www.binance.com/en/how-to-buy/bitcoin You also can buy bitcoin from any local brokers. If you withdraw funds from your bank account, then you have to inform the bank that you need this money for investment purposes only.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> 200K$? We don't have this money... If you look at our balance sheet, that is public [redacted], you can clearly see we have losses over the 3 past years and we don't have this money in our bank account... We can't ask for a loan as no bank will help us... What are the possibilities? What could be the lowest price for you?",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].idml.akira // 685 KB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> [redacted].idml.akira // 4.17 MB",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> As proof of decryption, can you try to decrypt these 2 files? Thanks.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Let us know what you are going to offer and we will discuss. Wait for decrypted files.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> As I mentionned, we already face a loss of 490K$ and have less than 80K$ left on our bank account, mainly reserved to pay the salaries of our employees the next month (22 people in 2025, 32 in 2024). If we pay more than 50K$, our company will shut down and we'll be forced to lay off everyone in the next couple of months... This is not what we want and that’s why I’m asking you to consider a final price of 50K$. In exchange, we agree to select options (1) Full decryption support and (4) Guarantee that our data will not be published or resold. It's simply the maximum we can pay to survive. I hope you can understand and accept this so we can resolve the situation quickly.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> If the answer is no, I understand, but I will have to inform my stakeholders, as I can't do more without consequences.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Decrypted.7z // 4.08 MB",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> Here are the files. Do you think the situation will get easier if you don't pay? If you really think so, you can log out right now as $50,000 will not be ever considered. Option 4 is only possible if you purchase option 2. So, if you only need our decryption tool, we can accept $150,000, but keep in mind that your data will be published.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for your answer. We understand your position, but as mentioned before, we simply cannot go beyond 50K$. It’s a hard financial limit. We have no external funding, no insurance, and no loan access. Also, our data are for production purpose, they are not confidential. We are still ready to make this payment immediately, under the same conditions: Full decryption tool and assistance. If this offer is rejected, we will have no choice but to stop this discussion. Let us know if you are ready to proceed with this amount. We are still open, but this is the final effort on our side. You have the choice between 0$ or 50K$.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> $150,000 is our bottom line in your case.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> I can try to get approval to reduce by another 10-15k if you arrange payment this week.",
            "timestamp": ""
        },
        {
            "party": "Victim",
            "content": "> Thank you for the updated offer. This is really appreciated. We understand your effort to reduce the price, but unfortunately, even 135K$ is still far beyond our financial capacity as I already mentioned. Our final and only possible offer remains 50K$, which we can pay quickly. This is not emotional or strategic, it’s a financial and operational constraint. We can’t give you what we don’t have.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> That means that the incident will be announced soon.",
            "timestamp": ""
        },
        {
            "party": "Akira",
            "content": "> You can find your company name in our news column: https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion \n\nIf you want this post deleted, we must come to an agreement.",
            "timestamp": ""
        }
    ]
}